TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Sat Apr 29 07:00:44 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../image/normal1.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13 00000000                   .sect   ".const:.string:pixel_normal14BPP_UNCOMP"
      14                            .clink

     841 00000020 0031603E          .bits   3235902,32                      ; palette_normal14BPP_UNCOMP[8] @ 256
     842 00000024 00F5F5F5          .bits   16119285,32                     ; palette_normal14BPP_UNCOMP[9] @ 288
     843 00000028 00355B44          .bits   3496772,32                      ; palette_normal14BPP_UNCOMP[10] @ 320
     844 0000002c 00F8FCFB          .bits   16317691,32                     ; palette_normal14BPP_UNCOMP[11] @ 352
     845 00000030 00F3FDF5          .bits   15990261,32                     ; palette_normal14BPP_UNCOMP[12] @ 384
     846 00000034 002F6040          .bits   3104832,32                      ; palette_normal14BPP_UNCOMP[13] @ 416
     847 00000038 002E6140          .bits   3039552,32                      ; palette_normal14BPP_UNCOMP[14] @ 448
     848 0000003c 00FFFFFF          .bits   16777215,32                     ; palette_normal14BPP_UNCOMP[15] @ 480
     849                    
     850                    $C$DW$2 .dwtag  DW_TAG_variable
     851                            .dwattr $C$DW$2, DW_AT_name("palette_normal14BPP_UNCOMP")
     852                            .dwattr $C$DW$2, DW_AT_TI_symbol_name("palette_normal14BPP_UNCOMP")
     853                            .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$94)
     854                            .dwattr $C$DW$2, DW_AT_location[DW_OP_addr palette_normal14BPP_UNCOMP]
     855                            .dwattr $C$DW$2, DW_AT_decl_file("../image/normal1.c")
     856                            .dwattr $C$DW$2, DW_AT_decl_line(0x4e)
     857                            .dwattr $C$DW$2, DW_AT_decl_column(0x1c)
     858                    
     859                            .global normal14BPP_UNCOMP
     860 00000000                   .sect   ".const:normal14BPP_UNCOMP"
     861                            .clink
     862                            .align  4
     863                            .elfsym normal14BPP_UNCOMP,SYM_SIZE(16)
     864 00000000           normal14BPP_UNCOMP:
     865 00000000 00000004          .bits   4,8                     ; normal14BPP_UNCOMP.bPP @ 0
     866 00000000 00000004          .bits   0,8
     867 00000000 00280004          .bits   40,16                   ; normal14BPP_UNCOMP.xSize @ 16
     868 00000004 00000028          .bits   40,16                   ; normal14BPP_UNCOMP.ySize @ 32
     869 00000004 00100028          .bits   16,16                   ; normal14BPP_UNCOMP.numColors @ 48
     870 00000008 00000000!         .bits   palette_normal14BPP_UNCOMP,32           ; normal14BPP_UNCOMP.pPalette @ 64
     871 0000000c 00000000!         .bits   pixel_normal14BPP_UNCOMP,32             ; normal14BPP_UNCOMP.pPixel @ 96
     872                    
     873                    $C$DW$3 .dwtag  DW_TAG_variable
     874                            .dwattr $C$DW$3, DW_AT_name("normal14BPP_UNCOMP")
     875                            .dwattr $C$DW$3, DW_AT_TI_symbol_name("normal14BPP_UNCOMP")
     876                            .dwattr $C$DW$3, DW_AT_location[DW_OP_addr normal14BPP_UNCOMP]
     877                            .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$74)
     878                            .dwattr $C$DW$3, DW_AT_external
     879                            .dwattr $C$DW$3, DW_AT_decl_file("../image/normal1.c")
     880                            .dwattr $C$DW$3, DW_AT_decl_line(0x56)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   17

     881                            .dwattr $C$DW$3, DW_AT_decl_column(0x0f)
     882                    
     883                    ;       /Applications/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/bin/armopt /var/tmp/11544xz7AOu /v
     884                    
     885                    ;******************************************************************************
     886                    ;* BUILD ATTRIBUTES                                                           *
     887                    ;******************************************************************************
     888                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     889                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     890                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     891                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     892                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     893                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     894                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
     895                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     896                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     897                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     898                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     899                    
     900                    ;******************************************************************************
     901                    ;* TYPE INFORMATION                                                           *
     902                    ;******************************************************************************
     903                    
     904                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     905                            .dwattr $C$DW$T$28, DW_AT_name("Graphics_Context")
     906                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x1c)
     907                    $C$DW$4 .dwtag  DW_TAG_member
     908                            .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$19)
     909                            .dwattr $C$DW$4, DW_AT_name("size")
     910                            .dwattr $C$DW$4, DW_AT_TI_symbol_name("size")
     911                            .dwattr $C$DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                            .dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)
     913                            .dwattr $C$DW$4, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     914                            .dwattr $C$DW$4, DW_AT_decl_line(0xe8)
     915                            .dwattr $C$DW$4, DW_AT_decl_column(0x0d)
     916                    
     917                    $C$DW$5 .dwtag  DW_TAG_member
     918                            .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$22)
     919                            .dwattr $C$DW$5, DW_AT_name("display")
     920                            .dwattr $C$DW$5, DW_AT_TI_symbol_name("display")
     921                            .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     922                            .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     923                            .dwattr $C$DW$5, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     924                            .dwattr $C$DW$5, DW_AT_decl_line(0xe9)
     925                            .dwattr $C$DW$5, DW_AT_decl_column(0x1d)
     926                    
     927                    $C$DW$6 .dwtag  DW_TAG_member
     928                            .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$23)
     929                            .dwattr $C$DW$6, DW_AT_name("clipRegion")
     930                            .dwattr $C$DW$6, DW_AT_TI_symbol_name("clipRegion")
     931                            .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     932                            .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     933                            .dwattr $C$DW$6, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     934                            .dwattr $C$DW$6, DW_AT_decl_line(0xea)
     935                            .dwattr $C$DW$6, DW_AT_decl_column(0x18)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   18

     936                    
     937                    $C$DW$7 .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$24)
     939                            .dwattr $C$DW$7, DW_AT_name("foreground")
     940                            .dwattr $C$DW$7, DW_AT_TI_symbol_name("foreground")
     941                            .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     942                            .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$7, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     944                            .dwattr $C$DW$7, DW_AT_decl_line(0xeb)
     945                            .dwattr $C$DW$7, DW_AT_decl_column(0x0e)
     946                    
     947                    $C$DW$8 .dwtag  DW_TAG_member
     948                            .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$24)
     949                            .dwattr $C$DW$8, DW_AT_name("background")
     950                            .dwattr $C$DW$8, DW_AT_TI_symbol_name("background")
     951                            .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     952                            .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     953                            .dwattr $C$DW$8, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     954                            .dwattr $C$DW$8, DW_AT_decl_line(0xec)
     955                            .dwattr $C$DW$8, DW_AT_decl_column(0x0e)
     956                    
     957                    $C$DW$9 .dwtag  DW_TAG_member
     958                            .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$27)
     959                            .dwattr $C$DW$9, DW_AT_name("font")
     960                            .dwattr $C$DW$9, DW_AT_TI_symbol_name("font")
     961                            .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     962                            .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     963                            .dwattr $C$DW$9, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     964                            .dwattr $C$DW$9, DW_AT_decl_line(0xed)
     965                            .dwattr $C$DW$9, DW_AT_decl_column(0x1a)
     966                    
     967                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     968                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xe6)
     969                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     970                            .dwendtag $C$DW$T$28
     971                    
     972                    $C$DW$T$71      .dwtag  DW_TAG_typedef
     973                            .dwattr $C$DW$T$71, DW_AT_name("Graphics_Context")
     974                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
     975                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     976                            .dwattr $C$DW$T$71, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     977                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xee)
     978                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
     979                    
     980                    
     981                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
     982                            .dwattr $C$DW$T$33, DW_AT_name("Graphics_Display")
     983                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
     984                    $C$DW$10        .dwtag  DW_TAG_member
     985                            .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     986                            .dwattr $C$DW$10, DW_AT_name("size")
     987                            .dwattr $C$DW$10, DW_AT_TI_symbol_name("size")
     988                            .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                            .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     990                            .dwattr $C$DW$10, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   19

     991                            .dwattr $C$DW$10, DW_AT_decl_line(0xb2)
     992                            .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     993                    
     994                    $C$DW$11        .dwtag  DW_TAG_member
     995                            .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$3)
     996                            .dwattr $C$DW$11, DW_AT_name("displayData")
     997                            .dwattr $C$DW$11, DW_AT_TI_symbol_name("displayData")
     998                            .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     999                            .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
    1000                            .dwattr $C$DW$11, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1001                            .dwattr $C$DW$11, DW_AT_decl_line(0xb3)
    1002                            .dwattr $C$DW$11, DW_AT_decl_column(0x0b)
    1003                    
    1004                    $C$DW$12        .dwtag  DW_TAG_member
    1005                            .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$29)
    1006                            .dwattr $C$DW$12, DW_AT_name("width")
    1007                            .dwattr $C$DW$12, DW_AT_TI_symbol_name("width")
    1008                            .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1009                            .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
    1010                            .dwattr $C$DW$12, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1011                            .dwattr $C$DW$12, DW_AT_decl_line(0xb4)
    1012                            .dwattr $C$DW$12, DW_AT_decl_column(0x0e)
    1013                    
    1014                    $C$DW$13        .dwtag  DW_TAG_member
    1015                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$29)
    1016                            .dwattr $C$DW$13, DW_AT_name("heigth")
    1017                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("heigth")
    1018                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1019                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
    1020                            .dwattr $C$DW$13, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1021                            .dwattr $C$DW$13, DW_AT_decl_line(0xb5)
    1022                            .dwattr $C$DW$13, DW_AT_decl_column(0x0e)
    1023                    
    1024                    $C$DW$14        .dwtag  DW_TAG_member
    1025                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$32)
    1026                            .dwattr $C$DW$14, DW_AT_name("pFxns")
    1027                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("pFxns")
    1028                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1029                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
    1030                            .dwattr $C$DW$14, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1031                            .dwattr $C$DW$14, DW_AT_decl_line(0xb6)
    1032                            .dwattr $C$DW$14, DW_AT_decl_column(0x27)
    1033                    
    1034                            .dwattr $C$DW$T$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1035                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xb0)
    1036                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x08)
    1037                            .dwendtag $C$DW$T$33
    1038                    
    1039                    $C$DW$T$20      .dwtag  DW_TAG_typedef
    1040                            .dwattr $C$DW$T$20, DW_AT_name("Graphics_Display")
    1041                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$33)
    1042                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1043                            .dwattr $C$DW$T$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1044                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x66)
    1045                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x21)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   20

    1046                    
    1047                    $C$DW$T$21      .dwtag  DW_TAG_const_type
    1048                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1049                    
    1050                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1051                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    1052                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    1053                    
    1054                    
    1055                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1056                            .dwattr $C$DW$T$63, DW_AT_name("Graphics_Display_Functions")
    1057                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x20)
    1058                    $C$DW$15        .dwtag  DW_TAG_member
    1059                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$37)
    1060                            .dwattr $C$DW$15, DW_AT_name("pfnPixelDraw")
    1061                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("pfnPixelDraw")
    1062                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
    1064                            .dwattr $C$DW$15, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1065                            .dwattr $C$DW$15, DW_AT_decl_line(0x72)
    1066                            .dwattr $C$DW$15, DW_AT_decl_column(0x12)
    1067                    
    1068                    $C$DW$16        .dwtag  DW_TAG_member
    1069                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$45)
    1070                            .dwattr $C$DW$16, DW_AT_name("pfnPixelDrawMultiple")
    1071                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("pfnPixelDrawMultiple")
    1072                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1073                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
    1074                            .dwattr $C$DW$16, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1075                            .dwattr $C$DW$16, DW_AT_decl_line(0x79)
    1076                            .dwattr $C$DW$16, DW_AT_decl_column(0x12)
    1077                    
    1078                    $C$DW$17        .dwtag  DW_TAG_member
    1079                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$48)
    1080                            .dwattr $C$DW$17, DW_AT_name("pfnLineDrawH")
    1081                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("pfnLineDrawH")
    1082                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1083                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
    1084                            .dwattr $C$DW$17, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1085                            .dwattr $C$DW$17, DW_AT_decl_line(0x83)
    1086                            .dwattr $C$DW$17, DW_AT_decl_column(0x12)
    1087                    
    1088                    $C$DW$18        .dwtag  DW_TAG_member
    1089                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$48)
    1090                            .dwattr $C$DW$18, DW_AT_name("pfnLineDrawV")
    1091                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("pfnLineDrawV")
    1092                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1093                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
    1094                            .dwattr $C$DW$18, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1095                            .dwattr $C$DW$18, DW_AT_decl_line(0x8a)
    1096                            .dwattr $C$DW$18, DW_AT_decl_column(0x12)
    1097                    
    1098                    $C$DW$19        .dwtag  DW_TAG_member
    1099                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$53)
    1100                            .dwattr $C$DW$19, DW_AT_name("pfnRectFill")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   21

    1101                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("pfnRectFill")
    1102                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1103                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
    1104                            .dwattr $C$DW$19, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1105                            .dwattr $C$DW$19, DW_AT_decl_line(0x91)
    1106                            .dwattr $C$DW$19, DW_AT_decl_column(0x12)
    1107                    
    1108                    $C$DW$20        .dwtag  DW_TAG_member
    1109                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$56)
    1110                            .dwattr $C$DW$20, DW_AT_name("pfnColorTranslate")
    1111                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("pfnColorTranslate")
    1112                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1113                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
    1114                            .dwattr $C$DW$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1115                            .dwattr $C$DW$20, DW_AT_decl_line(0x99)
    1116                            .dwattr $C$DW$20, DW_AT_decl_column(0x16)
    1117                    
    1118                    $C$DW$21        .dwtag  DW_TAG_member
    1119                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$59)
    1120                            .dwattr $C$DW$21, DW_AT_name("pfnFlush")
    1121                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("pfnFlush")
    1122                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1123                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
    1124                            .dwattr $C$DW$21, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1125                            .dwattr $C$DW$21, DW_AT_decl_line(0xa0)
    1126                            .dwattr $C$DW$21, DW_AT_decl_column(0x12)
    1127                    
    1128                    $C$DW$22        .dwtag  DW_TAG_member
    1129                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$62)
    1130                            .dwattr $C$DW$22, DW_AT_name("pfnClearDisplay")
    1131                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("pfnClearDisplay")
    1132                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1133                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
    1134                            .dwattr $C$DW$22, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1135                            .dwattr $C$DW$22, DW_AT_decl_line(0xa6)
    1136                            .dwattr $C$DW$22, DW_AT_decl_column(0x12)
    1137                    
    1138                            .dwattr $C$DW$T$63, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1139                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x6d)
    1140                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
    1141                            .dwendtag $C$DW$T$63
    1142                    
    1143                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1144                            .dwattr $C$DW$T$30, DW_AT_name("Graphics_Display_Functions")
    1145                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$63)
    1146                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1147                            .dwattr $C$DW$T$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1148                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xa9)
    1149                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1150                    
    1151                    $C$DW$T$31      .dwtag  DW_TAG_const_type
    1152                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1153                    
    1154                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    1155                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   22

    1156                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    1157                    
    1158                    
    1159                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    1160                            .dwattr $C$DW$T$65, DW_AT_name("Graphics_Font")
    1161                            .dwattr $C$DW$T$65, DW_AT_byte_size(0xc8)
    1162                    $C$DW$23        .dwtag  DW_TAG_member
    1163                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$38)
    1164                            .dwattr $C$DW$23, DW_AT_name("format")
    1165                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("format")
    1166                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
    1168                            .dwattr $C$DW$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1169                            .dwattr $C$DW$23, DW_AT_decl_line(0xc0)
    1170                            .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
    1171                    
    1172                    $C$DW$24        .dwtag  DW_TAG_member
    1173                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$38)
    1174                            .dwattr $C$DW$24, DW_AT_name("maxWidth")
    1175                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("maxWidth")
    1176                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1177                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
    1178                            .dwattr $C$DW$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1179                            .dwattr $C$DW$24, DW_AT_decl_line(0xc1)
    1180                            .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
    1181                    
    1182                    $C$DW$25        .dwtag  DW_TAG_member
    1183                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$38)
    1184                            .dwattr $C$DW$25, DW_AT_name("height")
    1185                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("height")
    1186                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1187                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
    1188                            .dwattr $C$DW$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1189                            .dwattr $C$DW$25, DW_AT_decl_line(0xc2)
    1190                            .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
    1191                    
    1192                    $C$DW$26        .dwtag  DW_TAG_member
    1193                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$38)
    1194                            .dwattr $C$DW$26, DW_AT_name("baseline")
    1195                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("baseline")
    1196                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1197                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1198                            .dwattr $C$DW$26, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1199                            .dwattr $C$DW$26, DW_AT_decl_line(0xc3)
    1200                            .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
    1201                    
    1202                    $C$DW$27        .dwtag  DW_TAG_member
    1203                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$64)
    1204                            .dwattr $C$DW$27, DW_AT_name("offset")
    1205                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("offset")
    1206                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1207                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1208                            .dwattr $C$DW$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1209                            .dwattr $C$DW$27, DW_AT_decl_line(0xc4)
    1210                            .dwattr $C$DW$27, DW_AT_decl_column(0x0e)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   23

    1211                    
    1212                    $C$DW$28        .dwtag  DW_TAG_member
    1213                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$40)
    1214                            .dwattr $C$DW$28, DW_AT_name("data")
    1215                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("data")
    1216                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1217                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1218                            .dwattr $C$DW$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1219                            .dwattr $C$DW$28, DW_AT_decl_line(0xc5)
    1220                            .dwattr $C$DW$28, DW_AT_decl_column(0x14)
    1221                    
    1222                            .dwattr $C$DW$T$65, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1223                            .dwattr $C$DW$T$65, DW_AT_decl_line(0xbe)
    1224                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
    1225                            .dwendtag $C$DW$T$65
    1226                    
    1227                    $C$DW$T$25      .dwtag  DW_TAG_typedef
    1228                            .dwattr $C$DW$T$25, DW_AT_name("Graphics_Font")
    1229                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$65)
    1230                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1231                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1232                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xc6)
    1233                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    1234                    
    1235                    $C$DW$T$26      .dwtag  DW_TAG_const_type
    1236                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1237                    
    1238                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1239                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1240                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    1241                    
    1242                    
    1243                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    1244                            .dwattr $C$DW$T$68, DW_AT_name("Graphics_FontEx")
    1245                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    1246                    $C$DW$29        .dwtag  DW_TAG_member
    1247                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$38)
    1248                            .dwattr $C$DW$29, DW_AT_name("format")
    1249                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("format")
    1250                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1252                            .dwattr $C$DW$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1253                            .dwattr $C$DW$29, DW_AT_decl_line(0xd6)
    1254                            .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
    1255                    
    1256                    $C$DW$30        .dwtag  DW_TAG_member
    1257                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$38)
    1258                            .dwattr $C$DW$30, DW_AT_name("maxWidth")
    1259                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("maxWidth")
    1260                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1261                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1262                            .dwattr $C$DW$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1263                            .dwattr $C$DW$30, DW_AT_decl_line(0xd7)
    1264                            .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
    1265                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   24

    1266                    $C$DW$31        .dwtag  DW_TAG_member
    1267                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$38)
    1268                            .dwattr $C$DW$31, DW_AT_name("height")
    1269                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("height")
    1270                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1271                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1272                            .dwattr $C$DW$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1273                            .dwattr $C$DW$31, DW_AT_decl_line(0xd8)
    1274                            .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
    1275                    
    1276                    $C$DW$32        .dwtag  DW_TAG_member
    1277                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$38)
    1278                            .dwattr $C$DW$32, DW_AT_name("baseline")
    1279                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("baseline")
    1280                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1281                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    1282                            .dwattr $C$DW$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1283                            .dwattr $C$DW$32, DW_AT_decl_line(0xd9)
    1284                            .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
    1285                    
    1286                    $C$DW$33        .dwtag  DW_TAG_member
    1287                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$38)
    1288                            .dwattr $C$DW$33, DW_AT_name("first")
    1289                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("first")
    1290                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1291                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1292                            .dwattr $C$DW$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1293                            .dwattr $C$DW$33, DW_AT_decl_line(0xda)
    1294                            .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
    1295                    
    1296                    $C$DW$34        .dwtag  DW_TAG_member
    1297                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$38)
    1298                            .dwattr $C$DW$34, DW_AT_name("last")
    1299                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("last")
    1300                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1301                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1302                            .dwattr $C$DW$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1303                            .dwattr $C$DW$34, DW_AT_decl_line(0xdb)
    1304                            .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
    1305                    
    1306                    $C$DW$35        .dwtag  DW_TAG_member
    1307                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$67)
    1308                            .dwattr $C$DW$35, DW_AT_name("offset")
    1309                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("offset")
    1310                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1311                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1312                            .dwattr $C$DW$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1313                            .dwattr $C$DW$35, DW_AT_decl_line(0xdc)
    1314                            .dwattr $C$DW$35, DW_AT_decl_column(0x15)
    1315                    
    1316                    $C$DW$36        .dwtag  DW_TAG_member
    1317                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$40)
    1318                            .dwattr $C$DW$36, DW_AT_name("data")
    1319                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("data")
    1320                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   25

    1321                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1322                            .dwattr $C$DW$36, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1323                            .dwattr $C$DW$36, DW_AT_decl_line(0xdd)
    1324                            .dwattr $C$DW$36, DW_AT_decl_column(0x14)
    1325                    
    1326                            .dwattr $C$DW$T$68, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1327                            .dwattr $C$DW$T$68, DW_AT_decl_line(0xd4)
    1328                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    1329                            .dwendtag $C$DW$T$68
    1330                    
    1331                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    1332                            .dwattr $C$DW$T$72, DW_AT_name("Graphics_FontEx")
    1333                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$68)
    1334                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1335                            .dwattr $C$DW$T$72, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1336                            .dwattr $C$DW$T$72, DW_AT_decl_line(0xde)
    1337                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    1338                    
    1339                    
    1340                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1341                            .dwattr $C$DW$T$69, DW_AT_name("Graphics_Image")
    1342                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x10)
    1343                    $C$DW$37        .dwtag  DW_TAG_member
    1344                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$38)
    1345                            .dwattr $C$DW$37, DW_AT_name("bPP")
    1346                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("bPP")
    1347                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1349                            .dwattr $C$DW$37, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1350                            .dwattr $C$DW$37, DW_AT_decl_line(0x4f)
    1351                            .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
    1352                    
    1353                    $C$DW$38        .dwtag  DW_TAG_member
    1354                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$29)
    1355                            .dwattr $C$DW$38, DW_AT_name("xSize")
    1356                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("xSize")
    1357                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1358                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1359                            .dwattr $C$DW$38, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1360                            .dwattr $C$DW$38, DW_AT_decl_line(0x50)
    1361                            .dwattr $C$DW$38, DW_AT_decl_column(0x0e)
    1362                    
    1363                    $C$DW$39        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$29)
    1365                            .dwattr $C$DW$39, DW_AT_name("ySize")
    1366                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("ySize")
    1367                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1368                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwattr $C$DW$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1370                            .dwattr $C$DW$39, DW_AT_decl_line(0x51)
    1371                            .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
    1372                    
    1373                    $C$DW$40        .dwtag  DW_TAG_member
    1374                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$29)
    1375                            .dwattr $C$DW$40, DW_AT_name("numColors")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   26

    1376                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("numColors")
    1377                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1378                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1380                            .dwattr $C$DW$40, DW_AT_decl_line(0x52)
    1381                            .dwattr $C$DW$40, DW_AT_decl_column(0x0e)
    1382                    
    1383                    $C$DW$41        .dwtag  DW_TAG_member
    1384                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$42)
    1385                            .dwattr $C$DW$41, DW_AT_name("pPalette")
    1386                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("pPalette")
    1387                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1388                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1389                            .dwattr $C$DW$41, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1390                            .dwattr $C$DW$41, DW_AT_decl_line(0x53)
    1391                            .dwattr $C$DW$41, DW_AT_decl_column(0x17)
    1392                    
    1393                    $C$DW$42        .dwtag  DW_TAG_member
    1394                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$40)
    1395                            .dwattr $C$DW$42, DW_AT_name("pPixel")
    1396                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("pPixel")
    1397                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1398                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1399                            .dwattr $C$DW$42, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1400                            .dwattr $C$DW$42, DW_AT_decl_line(0x54)
    1401                            .dwattr $C$DW$42, DW_AT_decl_column(0x15)
    1402                    
    1403                            .dwattr $C$DW$T$69, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1404                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x4d)
    1405                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    1406                            .dwendtag $C$DW$T$69
    1407                    
    1408                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    1409                            .dwattr $C$DW$T$73, DW_AT_name("Graphics_Image")
    1410                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$69)
    1411                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1412                            .dwattr $C$DW$T$73, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1413                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x55)
    1414                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    1415                    
    1416                    $C$DW$T$74      .dwtag  DW_TAG_const_type
    1417                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1418                    
    1419                    
    1420                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1421                            .dwattr $C$DW$T$70, DW_AT_name("Graphics_Rectangle")
    1422                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1423                    $C$DW$43        .dwtag  DW_TAG_member
    1424                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$34)
    1425                            .dwattr $C$DW$43, DW_AT_name("xMin")
    1426                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("xMin")
    1427                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$43, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1430                            .dwattr $C$DW$43, DW_AT_decl_line(0x60)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   27

    1431                            .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
    1432                    
    1433                    $C$DW$44        .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$34)
    1435                            .dwattr $C$DW$44, DW_AT_name("yMin")
    1436                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("yMin")
    1437                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1438                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1439                            .dwattr $C$DW$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1440                            .dwattr $C$DW$44, DW_AT_decl_line(0x61)
    1441                            .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
    1442                    
    1443                    $C$DW$45        .dwtag  DW_TAG_member
    1444                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$34)
    1445                            .dwattr $C$DW$45, DW_AT_name("xMax")
    1446                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("xMax")
    1447                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1448                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1449                            .dwattr $C$DW$45, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1450                            .dwattr $C$DW$45, DW_AT_decl_line(0x62)
    1451                            .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
    1452                    
    1453                    $C$DW$46        .dwtag  DW_TAG_member
    1454                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$34)
    1455                            .dwattr $C$DW$46, DW_AT_name("yMax")
    1456                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("yMax")
    1457                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1458                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1459                            .dwattr $C$DW$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1460                            .dwattr $C$DW$46, DW_AT_decl_line(0x63)
    1461                            .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
    1462                    
    1463                            .dwattr $C$DW$T$70, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1464                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5e)
    1465                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    1466                            .dwendtag $C$DW$T$70
    1467                    
    1468                    $C$DW$T$23      .dwtag  DW_TAG_typedef
    1469                            .dwattr $C$DW$T$23, DW_AT_name("Graphics_Rectangle")
    1470                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$70)
    1471                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1472                            .dwattr $C$DW$T$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1473                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x64)
    1474                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    1475                    
    1476                    $C$DW$T$49      .dwtag  DW_TAG_const_type
    1477                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$23)
    1478                    
    1479                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1480                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1481                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    1482                    
    1483                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1484                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1485                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   28

    1486                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1487                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1488                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1489                    
    1490                    
    1491                    $C$DW$T$35      .dwtag  DW_TAG_subroutine_type
    1492                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1493                    $C$DW$47        .dwtag  DW_TAG_formal_parameter
    1494                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
    1495                    
    1496                    $C$DW$48        .dwtag  DW_TAG_formal_parameter
    1497                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$34)
    1498                    
    1499                    $C$DW$49        .dwtag  DW_TAG_formal_parameter
    1500                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$34)
    1501                    
    1502                    $C$DW$50        .dwtag  DW_TAG_formal_parameter
    1503                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$29)
    1504                    
    1505                            .dwendtag $C$DW$T$35
    1506                    
    1507                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1508                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1509                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    1510                    
    1511                    $C$DW$T$37      .dwtag  DW_TAG_const_type
    1512                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1513                    
