TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Sat Apr 29 07:00:45 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../image/play3.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13 00000000                   .sect   ".const:.string:pixel_play34BPP_UNCOMP"
      14                            .clink

     823 00000028 00000200          .bits   512,32                  ; palette_play34BPP_UNCOMP[10] @ 320
     824 0000002c 00325F42          .bits   3301186,32                      ; palette_play34BPP_UNCOMP[11] @ 352
     825 00000030 00325F40          .bits   3301184,32                      ; palette_play34BPP_UNCOMP[12] @ 384
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   16

     826 00000034 002F6040          .bits   3104832,32                      ; palette_play34BPP_UNCOMP[13] @ 416
     827 00000038 00316040          .bits   3235904,32                      ; palette_play34BPP_UNCOMP[14] @ 448
     828 0000003c 00FFFFFF          .bits   16777215,32                     ; palette_play34BPP_UNCOMP[15] @ 480
     829                    
     830                    $C$DW$2 .dwtag  DW_TAG_variable
     831                            .dwattr $C$DW$2, DW_AT_name("palette_play34BPP_UNCOMP")
     832                            .dwattr $C$DW$2, DW_AT_TI_symbol_name("palette_play34BPP_UNCOMP")
     833                            .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$94)
     834                            .dwattr $C$DW$2, DW_AT_location[DW_OP_addr palette_play34BPP_UNCOMP]
     835                            .dwattr $C$DW$2, DW_AT_decl_file("../image/play3.c")
     836                            .dwattr $C$DW$2, DW_AT_decl_line(0x4d)
     837                            .dwattr $C$DW$2, DW_AT_decl_column(0x1c)
     838                    
     839                            .global play34BPP_UNCOMP
     840 00000000                   .sect   ".const:play34BPP_UNCOMP"
     841                            .clink
     842                            .align  4
     843                            .elfsym play34BPP_UNCOMP,SYM_SIZE(16)
     844 00000000           play34BPP_UNCOMP:
     845 00000000 00000004          .bits   4,8                     ; play34BPP_UNCOMP.bPP @ 0
     846 00000000 00000004          .bits   0,8
     847 00000000 00280004          .bits   40,16                   ; play34BPP_UNCOMP.xSize @ 16
     848 00000004 00000027          .bits   39,16                   ; play34BPP_UNCOMP.ySize @ 32
     849 00000004 00100027          .bits   16,16                   ; play34BPP_UNCOMP.numColors @ 48
     850 00000008 00000000!         .bits   palette_play34BPP_UNCOMP,32             ; play34BPP_UNCOMP.pPalette @ 64
     851 0000000c 00000000!         .bits   pixel_play34BPP_UNCOMP,32               ; play34BPP_UNCOMP.pPixel @ 96
     852                    
     853                    $C$DW$3 .dwtag  DW_TAG_variable
     854                            .dwattr $C$DW$3, DW_AT_name("play34BPP_UNCOMP")
     855                            .dwattr $C$DW$3, DW_AT_TI_symbol_name("play34BPP_UNCOMP")
     856                            .dwattr $C$DW$3, DW_AT_location[DW_OP_addr play34BPP_UNCOMP]
     857                            .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$74)
     858                            .dwattr $C$DW$3, DW_AT_external
     859                            .dwattr $C$DW$3, DW_AT_decl_file("../image/play3.c")
     860                            .dwattr $C$DW$3, DW_AT_decl_line(0x55)
     861                            .dwattr $C$DW$3, DW_AT_decl_column(0x0f)
     862                    
     863                    ;       /Applications/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.0.LTS/bin/armopt /var/tmp/115981ewxFo /v
     864                    
     865                    ;******************************************************************************
     866                    ;* BUILD ATTRIBUTES                                                           *
     867                    ;******************************************************************************
     868                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     869                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     870                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     871                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     872                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     873                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     874                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
     875                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     876                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     877                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     878                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     879                    
     880                    ;******************************************************************************
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   17

     881                    ;* TYPE INFORMATION                                                           *
     882                    ;******************************************************************************
     883                    
     884                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     885                            .dwattr $C$DW$T$28, DW_AT_name("Graphics_Context")
     886                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x1c)
     887                    $C$DW$4 .dwtag  DW_TAG_member
     888                            .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$19)
     889                            .dwattr $C$DW$4, DW_AT_name("size")
     890                            .dwattr $C$DW$4, DW_AT_TI_symbol_name("size")
     891                            .dwattr $C$DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                            .dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)
     893                            .dwattr $C$DW$4, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     894                            .dwattr $C$DW$4, DW_AT_decl_line(0xe8)
     895                            .dwattr $C$DW$4, DW_AT_decl_column(0x0d)
     896                    
     897                    $C$DW$5 .dwtag  DW_TAG_member
     898                            .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$22)
     899                            .dwattr $C$DW$5, DW_AT_name("display")
     900                            .dwattr $C$DW$5, DW_AT_TI_symbol_name("display")
     901                            .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     902                            .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
     903                            .dwattr $C$DW$5, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     904                            .dwattr $C$DW$5, DW_AT_decl_line(0xe9)
     905                            .dwattr $C$DW$5, DW_AT_decl_column(0x1d)
     906                    
     907                    $C$DW$6 .dwtag  DW_TAG_member
     908                            .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$23)
     909                            .dwattr $C$DW$6, DW_AT_name("clipRegion")
     910                            .dwattr $C$DW$6, DW_AT_TI_symbol_name("clipRegion")
     911                            .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     912                            .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     913                            .dwattr $C$DW$6, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     914                            .dwattr $C$DW$6, DW_AT_decl_line(0xea)
     915                            .dwattr $C$DW$6, DW_AT_decl_column(0x18)
     916                    
     917                    $C$DW$7 .dwtag  DW_TAG_member
     918                            .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$24)
     919                            .dwattr $C$DW$7, DW_AT_name("foreground")
     920                            .dwattr $C$DW$7, DW_AT_TI_symbol_name("foreground")
     921                            .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     922                            .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     923                            .dwattr $C$DW$7, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     924                            .dwattr $C$DW$7, DW_AT_decl_line(0xeb)
     925                            .dwattr $C$DW$7, DW_AT_decl_column(0x0e)
     926                    
     927                    $C$DW$8 .dwtag  DW_TAG_member
     928                            .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$24)
     929                            .dwattr $C$DW$8, DW_AT_name("background")
     930                            .dwattr $C$DW$8, DW_AT_TI_symbol_name("background")
     931                            .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     932                            .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     933                            .dwattr $C$DW$8, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     934                            .dwattr $C$DW$8, DW_AT_decl_line(0xec)
     935                            .dwattr $C$DW$8, DW_AT_decl_column(0x0e)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   18

     936                    
     937                    $C$DW$9 .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$27)
     939                            .dwattr $C$DW$9, DW_AT_name("font")
     940                            .dwattr $C$DW$9, DW_AT_TI_symbol_name("font")
     941                            .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     942                            .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$9, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00
     944                            .dwattr $C$DW$9, DW_AT_decl_line(0xed)
     945                            .dwattr $C$DW$9, DW_AT_decl_column(0x1a)
     946                    
     947                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     948                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xe6)
     949                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     950                            .dwendtag $C$DW$T$28
     951                    
     952                    $C$DW$T$71      .dwtag  DW_TAG_typedef
     953                            .dwattr $C$DW$T$71, DW_AT_name("Graphics_Context")
     954                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
     955                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     956                            .dwattr $C$DW$T$71, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     957                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xee)
     958                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
     959                    
     960                    
     961                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
     962                            .dwattr $C$DW$T$33, DW_AT_name("Graphics_Display")
     963                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
     964                    $C$DW$10        .dwtag  DW_TAG_member
     965                            .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     966                            .dwattr $C$DW$10, DW_AT_name("size")
     967                            .dwattr $C$DW$10, DW_AT_TI_symbol_name("size")
     968                            .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                            .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     970                            .dwattr $C$DW$10, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     971                            .dwattr $C$DW$10, DW_AT_decl_line(0xb2)
     972                            .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     973                    
     974                    $C$DW$11        .dwtag  DW_TAG_member
     975                            .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$3)
     976                            .dwattr $C$DW$11, DW_AT_name("displayData")
     977                            .dwattr $C$DW$11, DW_AT_TI_symbol_name("displayData")
     978                            .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     979                            .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     980                            .dwattr $C$DW$11, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     981                            .dwattr $C$DW$11, DW_AT_decl_line(0xb3)
     982                            .dwattr $C$DW$11, DW_AT_decl_column(0x0b)
     983                    
     984                    $C$DW$12        .dwtag  DW_TAG_member
     985                            .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$29)
     986                            .dwattr $C$DW$12, DW_AT_name("width")
     987                            .dwattr $C$DW$12, DW_AT_TI_symbol_name("width")
     988                            .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     989                            .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     990                            .dwattr $C$DW$12, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   19

     991                            .dwattr $C$DW$12, DW_AT_decl_line(0xb4)
     992                            .dwattr $C$DW$12, DW_AT_decl_column(0x0e)
     993                    
     994                    $C$DW$13        .dwtag  DW_TAG_member
     995                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$29)
     996                            .dwattr $C$DW$13, DW_AT_name("heigth")
     997                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("heigth")
     998                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     999                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
    1000                            .dwattr $C$DW$13, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1001                            .dwattr $C$DW$13, DW_AT_decl_line(0xb5)
    1002                            .dwattr $C$DW$13, DW_AT_decl_column(0x0e)
    1003                    
    1004                    $C$DW$14        .dwtag  DW_TAG_member
    1005                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$32)
    1006                            .dwattr $C$DW$14, DW_AT_name("pFxns")
    1007                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("pFxns")
    1008                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1009                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
    1010                            .dwattr $C$DW$14, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1011                            .dwattr $C$DW$14, DW_AT_decl_line(0xb6)
    1012                            .dwattr $C$DW$14, DW_AT_decl_column(0x27)
    1013                    
    1014                            .dwattr $C$DW$T$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1015                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xb0)
    1016                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x08)
    1017                            .dwendtag $C$DW$T$33
    1018                    
    1019                    $C$DW$T$20      .dwtag  DW_TAG_typedef
    1020                            .dwattr $C$DW$T$20, DW_AT_name("Graphics_Display")
    1021                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$33)
    1022                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1023                            .dwattr $C$DW$T$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1024                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x66)
    1025                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x21)
    1026                    
    1027                    $C$DW$T$21      .dwtag  DW_TAG_const_type
    1028                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1029                    
    1030                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1031                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    1032                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    1033                    
    1034                    
    1035                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1036                            .dwattr $C$DW$T$63, DW_AT_name("Graphics_Display_Functions")
    1037                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x20)
    1038                    $C$DW$15        .dwtag  DW_TAG_member
    1039                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$37)
    1040                            .dwattr $C$DW$15, DW_AT_name("pfnPixelDraw")
    1041                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("pfnPixelDraw")
    1042                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
    1044                            .dwattr $C$DW$15, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1045                            .dwattr $C$DW$15, DW_AT_decl_line(0x72)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   20

    1046                            .dwattr $C$DW$15, DW_AT_decl_column(0x12)
    1047                    
    1048                    $C$DW$16        .dwtag  DW_TAG_member
    1049                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$45)
    1050                            .dwattr $C$DW$16, DW_AT_name("pfnPixelDrawMultiple")
    1051                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("pfnPixelDrawMultiple")
    1052                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1053                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
    1054                            .dwattr $C$DW$16, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1055                            .dwattr $C$DW$16, DW_AT_decl_line(0x79)
    1056                            .dwattr $C$DW$16, DW_AT_decl_column(0x12)
    1057                    
    1058                    $C$DW$17        .dwtag  DW_TAG_member
    1059                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$48)
    1060                            .dwattr $C$DW$17, DW_AT_name("pfnLineDrawH")
    1061                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("pfnLineDrawH")
    1062                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1063                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
    1064                            .dwattr $C$DW$17, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1065                            .dwattr $C$DW$17, DW_AT_decl_line(0x83)
    1066                            .dwattr $C$DW$17, DW_AT_decl_column(0x12)
    1067                    
    1068                    $C$DW$18        .dwtag  DW_TAG_member
    1069                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$48)
    1070                            .dwattr $C$DW$18, DW_AT_name("pfnLineDrawV")
    1071                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("pfnLineDrawV")
    1072                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1073                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
    1074                            .dwattr $C$DW$18, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1075                            .dwattr $C$DW$18, DW_AT_decl_line(0x8a)
    1076                            .dwattr $C$DW$18, DW_AT_decl_column(0x12)
    1077                    
    1078                    $C$DW$19        .dwtag  DW_TAG_member
    1079                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$53)
    1080                            .dwattr $C$DW$19, DW_AT_name("pfnRectFill")
    1081                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("pfnRectFill")
    1082                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1083                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
    1084                            .dwattr $C$DW$19, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1085                            .dwattr $C$DW$19, DW_AT_decl_line(0x91)
    1086                            .dwattr $C$DW$19, DW_AT_decl_column(0x12)
    1087                    
    1088                    $C$DW$20        .dwtag  DW_TAG_member
    1089                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$56)
    1090                            .dwattr $C$DW$20, DW_AT_name("pfnColorTranslate")
    1091                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("pfnColorTranslate")
    1092                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1093                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
    1094                            .dwattr $C$DW$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1095                            .dwattr $C$DW$20, DW_AT_decl_line(0x99)
    1096                            .dwattr $C$DW$20, DW_AT_decl_column(0x16)
    1097                    
    1098                    $C$DW$21        .dwtag  DW_TAG_member
    1099                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$59)
    1100                            .dwattr $C$DW$21, DW_AT_name("pfnFlush")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   21

    1101                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("pfnFlush")
    1102                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1103                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
    1104                            .dwattr $C$DW$21, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1105                            .dwattr $C$DW$21, DW_AT_decl_line(0xa0)
    1106                            .dwattr $C$DW$21, DW_AT_decl_column(0x12)
    1107                    
    1108                    $C$DW$22        .dwtag  DW_TAG_member
    1109                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$62)
    1110                            .dwattr $C$DW$22, DW_AT_name("pfnClearDisplay")
    1111                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("pfnClearDisplay")
    1112                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1113                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
    1114                            .dwattr $C$DW$22, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1115                            .dwattr $C$DW$22, DW_AT_decl_line(0xa6)
    1116                            .dwattr $C$DW$22, DW_AT_decl_column(0x12)
    1117                    
    1118                            .dwattr $C$DW$T$63, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1119                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x6d)
    1120                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
    1121                            .dwendtag $C$DW$T$63
    1122                    
    1123                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1124                            .dwattr $C$DW$T$30, DW_AT_name("Graphics_Display_Functions")
    1125                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$63)
    1126                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1127                            .dwattr $C$DW$T$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1128                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xa9)
    1129                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1130                    
    1131                    $C$DW$T$31      .dwtag  DW_TAG_const_type
    1132                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1133                    
    1134                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    1135                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1136                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    1137                    
    1138                    
    1139                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    1140                            .dwattr $C$DW$T$65, DW_AT_name("Graphics_Font")
    1141                            .dwattr $C$DW$T$65, DW_AT_byte_size(0xc8)
    1142                    $C$DW$23        .dwtag  DW_TAG_member
    1143                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$38)
    1144                            .dwattr $C$DW$23, DW_AT_name("format")
    1145                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("format")
    1146                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
    1148                            .dwattr $C$DW$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1149                            .dwattr $C$DW$23, DW_AT_decl_line(0xc0)
    1150                            .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
    1151                    
    1152                    $C$DW$24        .dwtag  DW_TAG_member
    1153                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$38)
    1154                            .dwattr $C$DW$24, DW_AT_name("maxWidth")
    1155                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("maxWidth")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   22

    1156                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1157                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
    1158                            .dwattr $C$DW$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1159                            .dwattr $C$DW$24, DW_AT_decl_line(0xc1)
    1160                            .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
    1161                    
    1162                    $C$DW$25        .dwtag  DW_TAG_member
    1163                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$38)
    1164                            .dwattr $C$DW$25, DW_AT_name("height")
    1165                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("height")
    1166                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1167                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
    1168                            .dwattr $C$DW$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1169                            .dwattr $C$DW$25, DW_AT_decl_line(0xc2)
    1170                            .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
    1171                    
    1172                    $C$DW$26        .dwtag  DW_TAG_member
    1173                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$38)
    1174                            .dwattr $C$DW$26, DW_AT_name("baseline")
    1175                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("baseline")
    1176                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1177                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1178                            .dwattr $C$DW$26, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1179                            .dwattr $C$DW$26, DW_AT_decl_line(0xc3)
    1180                            .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
    1181                    
    1182                    $C$DW$27        .dwtag  DW_TAG_member
    1183                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$64)
    1184                            .dwattr $C$DW$27, DW_AT_name("offset")
    1185                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("offset")
    1186                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1187                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1188                            .dwattr $C$DW$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1189                            .dwattr $C$DW$27, DW_AT_decl_line(0xc4)
    1190                            .dwattr $C$DW$27, DW_AT_decl_column(0x0e)
    1191                    
    1192                    $C$DW$28        .dwtag  DW_TAG_member
    1193                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$40)
    1194                            .dwattr $C$DW$28, DW_AT_name("data")
    1195                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("data")
    1196                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1197                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1198                            .dwattr $C$DW$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1199                            .dwattr $C$DW$28, DW_AT_decl_line(0xc5)
    1200                            .dwattr $C$DW$28, DW_AT_decl_column(0x14)
    1201                    
    1202                            .dwattr $C$DW$T$65, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1203                            .dwattr $C$DW$T$65, DW_AT_decl_line(0xbe)
    1204                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
    1205                            .dwendtag $C$DW$T$65
    1206                    
    1207                    $C$DW$T$25      .dwtag  DW_TAG_typedef
    1208                            .dwattr $C$DW$T$25, DW_AT_name("Graphics_Font")
    1209                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$65)
    1210                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   23

    1211                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1212                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xc6)
    1213                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    1214                    
    1215                    $C$DW$T$26      .dwtag  DW_TAG_const_type
    1216                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1217                    
    1218                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1219                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1220                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    1221                    
    1222                    
    1223                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    1224                            .dwattr $C$DW$T$68, DW_AT_name("Graphics_FontEx")
    1225                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    1226                    $C$DW$29        .dwtag  DW_TAG_member
    1227                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$38)
    1228                            .dwattr $C$DW$29, DW_AT_name("format")
    1229                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("format")
    1230                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1232                            .dwattr $C$DW$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1233                            .dwattr $C$DW$29, DW_AT_decl_line(0xd6)
    1234                            .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
    1235                    
    1236                    $C$DW$30        .dwtag  DW_TAG_member
    1237                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$38)
    1238                            .dwattr $C$DW$30, DW_AT_name("maxWidth")
    1239                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("maxWidth")
    1240                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1241                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1242                            .dwattr $C$DW$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1243                            .dwattr $C$DW$30, DW_AT_decl_line(0xd7)
    1244                            .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
    1245                    
    1246                    $C$DW$31        .dwtag  DW_TAG_member
    1247                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$38)
    1248                            .dwattr $C$DW$31, DW_AT_name("height")
    1249                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("height")
    1250                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1251                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1252                            .dwattr $C$DW$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1253                            .dwattr $C$DW$31, DW_AT_decl_line(0xd8)
    1254                            .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
    1255                    
    1256                    $C$DW$32        .dwtag  DW_TAG_member
    1257                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$38)
    1258                            .dwattr $C$DW$32, DW_AT_name("baseline")
    1259                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("baseline")
    1260                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1261                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    1262                            .dwattr $C$DW$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1263                            .dwattr $C$DW$32, DW_AT_decl_line(0xd9)
    1264                            .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
    1265                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   24

    1266                    $C$DW$33        .dwtag  DW_TAG_member
    1267                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$38)
    1268                            .dwattr $C$DW$33, DW_AT_name("first")
    1269                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("first")
    1270                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1271                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1272                            .dwattr $C$DW$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1273                            .dwattr $C$DW$33, DW_AT_decl_line(0xda)
    1274                            .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
    1275                    
    1276                    $C$DW$34        .dwtag  DW_TAG_member
    1277                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$38)
    1278                            .dwattr $C$DW$34, DW_AT_name("last")
    1279                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("last")
    1280                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1281                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1282                            .dwattr $C$DW$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1283                            .dwattr $C$DW$34, DW_AT_decl_line(0xdb)
    1284                            .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
    1285                    
    1286                    $C$DW$35        .dwtag  DW_TAG_member
    1287                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$67)
    1288                            .dwattr $C$DW$35, DW_AT_name("offset")
    1289                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("offset")
    1290                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1291                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1292                            .dwattr $C$DW$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1293                            .dwattr $C$DW$35, DW_AT_decl_line(0xdc)
    1294                            .dwattr $C$DW$35, DW_AT_decl_column(0x15)
    1295                    
    1296                    $C$DW$36        .dwtag  DW_TAG_member
    1297                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$40)
    1298                            .dwattr $C$DW$36, DW_AT_name("data")
    1299                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("data")
    1300                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1301                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1302                            .dwattr $C$DW$36, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1303                            .dwattr $C$DW$36, DW_AT_decl_line(0xdd)
    1304                            .dwattr $C$DW$36, DW_AT_decl_column(0x14)
    1305                    
    1306                            .dwattr $C$DW$T$68, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1307                            .dwattr $C$DW$T$68, DW_AT_decl_line(0xd4)
    1308                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    1309                            .dwendtag $C$DW$T$68
    1310                    
    1311                    $C$DW$T$72      .dwtag  DW_TAG_typedef
    1312                            .dwattr $C$DW$T$72, DW_AT_name("Graphics_FontEx")
    1313                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$68)
    1314                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1315                            .dwattr $C$DW$T$72, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1316                            .dwattr $C$DW$T$72, DW_AT_decl_line(0xde)
    1317                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    1318                    
    1319                    
    1320                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   25

    1321                            .dwattr $C$DW$T$69, DW_AT_name("Graphics_Image")
    1322                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x10)
    1323                    $C$DW$37        .dwtag  DW_TAG_member
    1324                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$38)
    1325                            .dwattr $C$DW$37, DW_AT_name("bPP")
    1326                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("bPP")
    1327                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1329                            .dwattr $C$DW$37, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1330                            .dwattr $C$DW$37, DW_AT_decl_line(0x4f)
    1331                            .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
    1332                    
    1333                    $C$DW$38        .dwtag  DW_TAG_member
    1334                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$29)
    1335                            .dwattr $C$DW$38, DW_AT_name("xSize")
    1336                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("xSize")
    1337                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1338                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1339                            .dwattr $C$DW$38, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1340                            .dwattr $C$DW$38, DW_AT_decl_line(0x50)
    1341                            .dwattr $C$DW$38, DW_AT_decl_column(0x0e)
    1342                    
    1343                    $C$DW$39        .dwtag  DW_TAG_member
    1344                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$29)
    1345                            .dwattr $C$DW$39, DW_AT_name("ySize")
    1346                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("ySize")
    1347                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1348                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1349                            .dwattr $C$DW$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1350                            .dwattr $C$DW$39, DW_AT_decl_line(0x51)
    1351                            .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
    1352                    
    1353                    $C$DW$40        .dwtag  DW_TAG_member
    1354                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$29)
    1355                            .dwattr $C$DW$40, DW_AT_name("numColors")
    1356                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("numColors")
    1357                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1358                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1359                            .dwattr $C$DW$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1360                            .dwattr $C$DW$40, DW_AT_decl_line(0x52)
    1361                            .dwattr $C$DW$40, DW_AT_decl_column(0x0e)
    1362                    
    1363                    $C$DW$41        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$42)
    1365                            .dwattr $C$DW$41, DW_AT_name("pPalette")
    1366                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("pPalette")
    1367                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1368                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwattr $C$DW$41, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1370                            .dwattr $C$DW$41, DW_AT_decl_line(0x53)
    1371                            .dwattr $C$DW$41, DW_AT_decl_column(0x17)
    1372                    
    1373                    $C$DW$42        .dwtag  DW_TAG_member
    1374                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$40)
    1375                            .dwattr $C$DW$42, DW_AT_name("pPixel")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   26

    1376                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("pPixel")
    1377                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1378                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$42, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1380                            .dwattr $C$DW$42, DW_AT_decl_line(0x54)
    1381                            .dwattr $C$DW$42, DW_AT_decl_column(0x15)
    1382                    
    1383                            .dwattr $C$DW$T$69, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1384                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x4d)
    1385                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    1386                            .dwendtag $C$DW$T$69
    1387                    
    1388                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    1389                            .dwattr $C$DW$T$73, DW_AT_name("Graphics_Image")
    1390                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$69)
    1391                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1392                            .dwattr $C$DW$T$73, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1393                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x55)
    1394                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    1395                    
    1396                    $C$DW$T$74      .dwtag  DW_TAG_const_type
    1397                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1398                    
    1399                    
    1400                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1401                            .dwattr $C$DW$T$70, DW_AT_name("Graphics_Rectangle")
    1402                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1403                    $C$DW$43        .dwtag  DW_TAG_member
    1404                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$34)
    1405                            .dwattr $C$DW$43, DW_AT_name("xMin")
    1406                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("xMin")
    1407                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1409                            .dwattr $C$DW$43, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1410                            .dwattr $C$DW$43, DW_AT_decl_line(0x60)
    1411                            .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
    1412                    
    1413                    $C$DW$44        .dwtag  DW_TAG_member
    1414                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$34)
    1415                            .dwattr $C$DW$44, DW_AT_name("yMin")
    1416                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("yMin")
    1417                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1418                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1419                            .dwattr $C$DW$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1420                            .dwattr $C$DW$44, DW_AT_decl_line(0x61)
    1421                            .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
    1422                    
    1423                    $C$DW$45        .dwtag  DW_TAG_member
    1424                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$34)
    1425                            .dwattr $C$DW$45, DW_AT_name("xMax")
    1426                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("xMax")
    1427                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1428                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$45, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1430                            .dwattr $C$DW$45, DW_AT_decl_line(0x62)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   27

    1431                            .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
    1432                    
    1433                    $C$DW$46        .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$34)
    1435                            .dwattr $C$DW$46, DW_AT_name("yMax")
    1436                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("yMax")
    1437                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1438                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1439                            .dwattr $C$DW$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1440                            .dwattr $C$DW$46, DW_AT_decl_line(0x63)
    1441                            .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
    1442                    
    1443                            .dwattr $C$DW$T$70, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1444                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5e)
    1445                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    1446                            .dwendtag $C$DW$T$70
    1447                    
    1448                    $C$DW$T$23      .dwtag  DW_TAG_typedef
    1449                            .dwattr $C$DW$T$23, DW_AT_name("Graphics_Rectangle")
    1450                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$70)
    1451                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1452                            .dwattr $C$DW$T$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1453                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x64)
    1454                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    1455                    
    1456                    $C$DW$T$49      .dwtag  DW_TAG_const_type
    1457                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$23)
    1458                    
    1459                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1460                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1461                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    1462                    
    1463                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1464                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1465                    
    1466                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1467                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1468                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1469                    
    1470                    
    1471                    $C$DW$T$35      .dwtag  DW_TAG_subroutine_type
    1472                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1473                    $C$DW$47        .dwtag  DW_TAG_formal_parameter
    1474                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
    1475                    
    1476                    $C$DW$48        .dwtag  DW_TAG_formal_parameter
    1477                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$34)
    1478                    
    1479                    $C$DW$49        .dwtag  DW_TAG_formal_parameter
    1480                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$34)
    1481                    
    1482                    $C$DW$50        .dwtag  DW_TAG_formal_parameter
    1483                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$29)
    1484                    
    1485                            .dwendtag $C$DW$T$35
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
play3.asm                                                            PAGE   28

    1486                    
    1487                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1488                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1489                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    1490                    
    1491                    $C$DW$T$37      .dwtag  DW_TAG_const_type
    1492                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1493                    
