TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Sat Apr 29 06:20:02 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../4bit.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Graphics_drawImage")

     553                    $C$DW$13        .dwtag  DW_TAG_variable
     554                            .dwattr $C$DW$13, DW_AT_name("x")
     555                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("x")
     556                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$95)
     557                            .dwattr $C$DW$13, DW_AT_location[DW_OP_reg1]
     558                    
     559                    ;* A3    assigned to y
     560                    $C$DW$14        .dwtag  DW_TAG_variable
     561                            .dwattr $C$DW$14, DW_AT_name("y")
     562                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("y")
     563                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$95)
     564                            .dwattr $C$DW$14, DW_AT_location[DW_OP_reg2]
     565                    
     566                            .dwcfi  cfa_offset, 0
     567                            .dwpsn  file "../4bit.c",line 95,column 5,is_stmt,isa 1
     568                    ;----------------------------------------------------------------------
     569                    ;  95 | Graphics_drawImage(gs, &walk22BPP_UNCOMP, x, y);                       
     570                    ;----------------------------------------------------------------------
     571 00000000 B213              SXTH      A4, A3                ; [DPU_3_PIPE] |95|  ; [ORIG 16-BIT INS]
     572 00000002 B20A              SXTH      A3, A2                ; [DPU_3_PIPE] |95|  ; [ORIG 16-BIT INS]
     573 00000004 4901              LDR       A2, $C$CON1           ; [DPU_3_PIPE] |95|  ; [ORIG 16-BIT INS]
     574                    $C$DW$15        .dwtag  DW_TAG_TI_branch
     575                            .dwattr $C$DW$15, DW_AT_low_pc(0x00)
     576                            .dwattr $C$DW$15, DW_AT_name("Graphics_drawImage")
     577                            .dwattr $C$DW$15, DW_AT_TI_call
     578                            .dwattr $C$DW$15, DW_AT_TI_return
     579                    
     580 00000006 BFFEF7FF!         CRET      Graphics_drawImage    ; [DPU_3_PIPE] |95|  ; [KEEP 32-BIT INS]
     581                            ; CALL OCCURS {Graphics_drawImage }  ; [] |95| 
     582                            .dwattr $C$DW$9, DW_AT_TI_end_file("../4bit.c")
     583                            .dwattr $C$DW$9, DW_AT_TI_end_line(0x60)
     584                            .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     585                            .dwendentry
     586                            .dwendtag $C$DW$9
     587                    
     588                    ;******************************************************************************
     589                    ;* CONSTANT TABLE                                                             *
     590                    ;******************************************************************************
     591 0000000a                   .sect   ".text:draw_4bit"
     592                            .align  4
     593 0000000a 000046C0! ||$C$CON1||:    .bits   walk22BPP_UNCOMP,32
         0000000e 00000000 
     594                    ;*****************************************************************************
     595                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     596                    ;*****************************************************************************
     597                            .global Graphics_drawImage
     598                    
     599                    ;******************************************************************************
     600                    ;* BUILD ATTRIBUTES                                                           *
     601                    ;******************************************************************************
     602                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     603                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     604                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   12

     605                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     606                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     607                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     608                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
     609                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     610                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     611                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     612                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     613                    
     614                    ;******************************************************************************
     615                    ;* TYPE INFORMATION                                                           *
     616                    ;******************************************************************************
     617                    
     618                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     619                            .dwattr $C$DW$T$28, DW_AT_name("Graphics_Context")
     620                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x1c)
     621                    $C$DW$16        .dwtag  DW_TAG_member
     622                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     623                            .dwattr $C$DW$16, DW_AT_name("size")
     624                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("size")
     625                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     626                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     627                            .dwattr $C$DW$16, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     628                            .dwattr $C$DW$16, DW_AT_decl_line(0xe8)
     629                            .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     630                    
     631                    $C$DW$17        .dwtag  DW_TAG_member
     632                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$22)
     633                            .dwattr $C$DW$17, DW_AT_name("display")
     634                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("display")
     635                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     636                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     637                            .dwattr $C$DW$17, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     638                            .dwattr $C$DW$17, DW_AT_decl_line(0xe9)
     639                            .dwattr $C$DW$17, DW_AT_decl_column(0x1d)
     640                    
     641                    $C$DW$18        .dwtag  DW_TAG_member
     642                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$23)
     643                            .dwattr $C$DW$18, DW_AT_name("clipRegion")
     644                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("clipRegion")
     645                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     646                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     647                            .dwattr $C$DW$18, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     648                            .dwattr $C$DW$18, DW_AT_decl_line(0xea)
     649                            .dwattr $C$DW$18, DW_AT_decl_column(0x18)
     650                    
     651                    $C$DW$19        .dwtag  DW_TAG_member
     652                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$24)
     653                            .dwattr $C$DW$19, DW_AT_name("foreground")
     654                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("foreground")
     655                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     656                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     657                            .dwattr $C$DW$19, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     658                            .dwattr $C$DW$19, DW_AT_decl_line(0xeb)
     659                            .dwattr $C$DW$19, DW_AT_decl_column(0x0e)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   13

     660                    
     661                    $C$DW$20        .dwtag  DW_TAG_member
     662                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$24)
     663                            .dwattr $C$DW$20, DW_AT_name("background")
     664                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("background")
     665                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     666                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     667                            .dwattr $C$DW$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     668                            .dwattr $C$DW$20, DW_AT_decl_line(0xec)
     669                            .dwattr $C$DW$20, DW_AT_decl_column(0x0e)
     670                    
     671                    $C$DW$21        .dwtag  DW_TAG_member
     672                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$27)
     673                            .dwattr $C$DW$21, DW_AT_name("font")
     674                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("font")
     675                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     676                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     677                            .dwattr $C$DW$21, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     678                            .dwattr $C$DW$21, DW_AT_decl_line(0xed)
     679                            .dwattr $C$DW$21, DW_AT_decl_column(0x1a)
     680                    
     681                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     682                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xe6)
     683                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     684                            .dwendtag $C$DW$T$28
     685                    
     686                    $C$DW$T$71      .dwtag  DW_TAG_typedef
     687                            .dwattr $C$DW$T$71, DW_AT_name("Graphics_Context")
     688                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
     689                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     690                            .dwattr $C$DW$T$71, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     691                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xee)
     692                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
     693                    
     694                    $C$DW$T$72      .dwtag  DW_TAG_const_type
     695                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
     696                    
     697                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
     698                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
     699                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
     700                    
     701                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
     702                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$71)
     703                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
     704                    
     705                    
     706                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
     707                            .dwattr $C$DW$T$33, DW_AT_name("Graphics_Display")
     708                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
     709                    $C$DW$22        .dwtag  DW_TAG_member
     710                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     711                            .dwattr $C$DW$22, DW_AT_name("size")
     712                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("size")
     713                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   14

     715                            .dwattr $C$DW$22, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     716                            .dwattr $C$DW$22, DW_AT_decl_line(0xb2)
     717                            .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     718                    
     719                    $C$DW$23        .dwtag  DW_TAG_member
     720                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$3)
     721                            .dwattr $C$DW$23, DW_AT_name("displayData")
     722                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("displayData")
     723                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     724                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     725                            .dwattr $C$DW$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     726                            .dwattr $C$DW$23, DW_AT_decl_line(0xb3)
     727                            .dwattr $C$DW$23, DW_AT_decl_column(0x0b)
     728                    
     729                    $C$DW$24        .dwtag  DW_TAG_member
     730                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$29)
     731                            .dwattr $C$DW$24, DW_AT_name("width")
     732                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("width")
     733                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     734                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     735                            .dwattr $C$DW$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     736                            .dwattr $C$DW$24, DW_AT_decl_line(0xb4)
     737                            .dwattr $C$DW$24, DW_AT_decl_column(0x0e)
     738                    
     739                    $C$DW$25        .dwtag  DW_TAG_member
     740                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$29)
     741                            .dwattr $C$DW$25, DW_AT_name("heigth")
     742                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("heigth")
     743                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     744                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     745                            .dwattr $C$DW$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     746                            .dwattr $C$DW$25, DW_AT_decl_line(0xb5)
     747                            .dwattr $C$DW$25, DW_AT_decl_column(0x0e)
     748                    
     749                    $C$DW$26        .dwtag  DW_TAG_member
     750                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$32)
     751                            .dwattr $C$DW$26, DW_AT_name("pFxns")
     752                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("pFxns")
     753                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     754                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     755                            .dwattr $C$DW$26, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     756                            .dwattr $C$DW$26, DW_AT_decl_line(0xb6)
     757                            .dwattr $C$DW$26, DW_AT_decl_column(0x27)
     758                    
     759                            .dwattr $C$DW$T$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     760                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xb0)
     761                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x08)
     762                            .dwendtag $C$DW$T$33
     763                    
     764                    $C$DW$T$20      .dwtag  DW_TAG_typedef
     765                            .dwattr $C$DW$T$20, DW_AT_name("Graphics_Display")
     766                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$33)
     767                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     768                            .dwattr $C$DW$T$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     769                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x66)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   15

     770                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x21)
     771                    
     772                    $C$DW$T$21      .dwtag  DW_TAG_const_type
     773                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     774                    
     775                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     776                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     777                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     778                    
     779                    
     780                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
     781                            .dwattr $C$DW$T$63, DW_AT_name("Graphics_Display_Functions")
     782                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x20)
     783                    $C$DW$27        .dwtag  DW_TAG_member
     784                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$37)
     785                            .dwattr $C$DW$27, DW_AT_name("pfnPixelDraw")
     786                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("pfnPixelDraw")
     787                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     789                            .dwattr $C$DW$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     790                            .dwattr $C$DW$27, DW_AT_decl_line(0x72)
     791                            .dwattr $C$DW$27, DW_AT_decl_column(0x12)
     792                    
     793                    $C$DW$28        .dwtag  DW_TAG_member
     794                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$45)
     795                            .dwattr $C$DW$28, DW_AT_name("pfnPixelDrawMultiple")
     796                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("pfnPixelDrawMultiple")
     797                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     798                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     799                            .dwattr $C$DW$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     800                            .dwattr $C$DW$28, DW_AT_decl_line(0x79)
     801                            .dwattr $C$DW$28, DW_AT_decl_column(0x12)
     802                    
     803                    $C$DW$29        .dwtag  DW_TAG_member
     804                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$48)
     805                            .dwattr $C$DW$29, DW_AT_name("pfnLineDrawH")
     806                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("pfnLineDrawH")
     807                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     808                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     809                            .dwattr $C$DW$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     810                            .dwattr $C$DW$29, DW_AT_decl_line(0x83)
     811                            .dwattr $C$DW$29, DW_AT_decl_column(0x12)
     812                    
     813                    $C$DW$30        .dwtag  DW_TAG_member
     814                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$48)
     815                            .dwattr $C$DW$30, DW_AT_name("pfnLineDrawV")
     816                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("pfnLineDrawV")
     817                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     818                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     819                            .dwattr $C$DW$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     820                            .dwattr $C$DW$30, DW_AT_decl_line(0x8a)
     821                            .dwattr $C$DW$30, DW_AT_decl_column(0x12)
     822                    
     823                    $C$DW$31        .dwtag  DW_TAG_member
     824                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$53)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   16

     825                            .dwattr $C$DW$31, DW_AT_name("pfnRectFill")
     826                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("pfnRectFill")
     827                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     828                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     829                            .dwattr $C$DW$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     830                            .dwattr $C$DW$31, DW_AT_decl_line(0x91)
     831                            .dwattr $C$DW$31, DW_AT_decl_column(0x12)
     832                    
     833                    $C$DW$32        .dwtag  DW_TAG_member
     834                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$56)
     835                            .dwattr $C$DW$32, DW_AT_name("pfnColorTranslate")
     836                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("pfnColorTranslate")
     837                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     838                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     839                            .dwattr $C$DW$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     840                            .dwattr $C$DW$32, DW_AT_decl_line(0x99)
     841                            .dwattr $C$DW$32, DW_AT_decl_column(0x16)
     842                    
     843                    $C$DW$33        .dwtag  DW_TAG_member
     844                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$59)
     845                            .dwattr $C$DW$33, DW_AT_name("pfnFlush")
     846                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("pfnFlush")
     847                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     848                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     849                            .dwattr $C$DW$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     850                            .dwattr $C$DW$33, DW_AT_decl_line(0xa0)
     851                            .dwattr $C$DW$33, DW_AT_decl_column(0x12)
     852                    
     853                    $C$DW$34        .dwtag  DW_TAG_member
     854                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$62)
     855                            .dwattr $C$DW$34, DW_AT_name("pfnClearDisplay")
     856                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("pfnClearDisplay")
     857                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     858                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     859                            .dwattr $C$DW$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     860                            .dwattr $C$DW$34, DW_AT_decl_line(0xa6)
     861                            .dwattr $C$DW$34, DW_AT_decl_column(0x12)
     862                    
     863                            .dwattr $C$DW$T$63, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     864                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x6d)
     865                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
     866                            .dwendtag $C$DW$T$63
     867                    
     868                    $C$DW$T$30      .dwtag  DW_TAG_typedef
     869                            .dwattr $C$DW$T$30, DW_AT_name("Graphics_Display_Functions")
     870                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$63)
     871                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     872                            .dwattr $C$DW$T$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     873                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xa9)
     874                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
     875                    
     876                    $C$DW$T$31      .dwtag  DW_TAG_const_type
     877                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     878                    
     879                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   17

     880                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
     881                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
     882                    
     883                    
     884                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
     885                            .dwattr $C$DW$T$65, DW_AT_name("Graphics_Font")
     886                            .dwattr $C$DW$T$65, DW_AT_byte_size(0xc8)
     887                    $C$DW$35        .dwtag  DW_TAG_member
     888                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$38)
     889                            .dwattr $C$DW$35, DW_AT_name("format")
     890                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("format")
     891                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     893                            .dwattr $C$DW$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     894                            .dwattr $C$DW$35, DW_AT_decl_line(0xc0)
     895                            .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     896                    
     897                    $C$DW$36        .dwtag  DW_TAG_member
     898                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$38)
     899                            .dwattr $C$DW$36, DW_AT_name("maxWidth")
     900                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("maxWidth")
     901                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     902                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     903                            .dwattr $C$DW$36, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     904                            .dwattr $C$DW$36, DW_AT_decl_line(0xc1)
     905                            .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     906                    
     907                    $C$DW$37        .dwtag  DW_TAG_member
     908                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$38)
     909                            .dwattr $C$DW$37, DW_AT_name("height")
     910                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("height")
     911                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     912                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     913                            .dwattr $C$DW$37, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     914                            .dwattr $C$DW$37, DW_AT_decl_line(0xc2)
     915                            .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     916                    
     917                    $C$DW$38        .dwtag  DW_TAG_member
     918                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$38)
     919                            .dwattr $C$DW$38, DW_AT_name("baseline")
     920                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("baseline")
     921                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     922                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     923                            .dwattr $C$DW$38, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     924                            .dwattr $C$DW$38, DW_AT_decl_line(0xc3)
     925                            .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     926                    
     927                    $C$DW$39        .dwtag  DW_TAG_member
     928                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$64)
     929                            .dwattr $C$DW$39, DW_AT_name("offset")
     930                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("offset")
     931                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     932                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     933                            .dwattr $C$DW$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     934                            .dwattr $C$DW$39, DW_AT_decl_line(0xc4)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   18

     935                            .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
     936                    
     937                    $C$DW$40        .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$40)
     939                            .dwattr $C$DW$40, DW_AT_name("data")
     940                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("data")
     941                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
     942                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     944                            .dwattr $C$DW$40, DW_AT_decl_line(0xc5)
     945                            .dwattr $C$DW$40, DW_AT_decl_column(0x14)
     946                    
     947                            .dwattr $C$DW$T$65, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     948                            .dwattr $C$DW$T$65, DW_AT_decl_line(0xbe)
     949                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
     950                            .dwendtag $C$DW$T$65
     951                    
     952                    $C$DW$T$25      .dwtag  DW_TAG_typedef
     953                            .dwattr $C$DW$T$25, DW_AT_name("Graphics_Font")
     954                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$65)
     955                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     956                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
     957                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xc6)
     958                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
     959                    
     960                    $C$DW$T$26      .dwtag  DW_TAG_const_type
     961                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
     962                    
     963                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     964                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     965                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
     966                    
     967                    
     968                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
     969                            .dwattr $C$DW$T$68, DW_AT_name("Graphics_FontEx")
     970                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
     971                    $C$DW$41        .dwtag  DW_TAG_member
     972                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$38)
     973                            .dwattr $C$DW$41, DW_AT_name("format")
     974                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("format")
     975                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     977                            .dwattr $C$DW$41, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     978                            .dwattr $C$DW$41, DW_AT_decl_line(0xd6)
     979                            .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     980                    
     981                    $C$DW$42        .dwtag  DW_TAG_member
     982                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$38)
     983                            .dwattr $C$DW$42, DW_AT_name("maxWidth")
     984                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("maxWidth")
     985                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     986                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     987                            .dwattr $C$DW$42, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     988                            .dwattr $C$DW$42, DW_AT_decl_line(0xd7)
     989                            .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   19

     990                    
     991                    $C$DW$43        .dwtag  DW_TAG_member
     992                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$38)
     993                            .dwattr $C$DW$43, DW_AT_name("height")
     994                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("height")
     995                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     996                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     997                            .dwattr $C$DW$43, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     998                            .dwattr $C$DW$43, DW_AT_decl_line(0xd8)
     999                            .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
    1000                    
    1001                    $C$DW$44        .dwtag  DW_TAG_member
    1002                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$38)
    1003                            .dwattr $C$DW$44, DW_AT_name("baseline")
    1004                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("baseline")
    1005                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1006                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1007                            .dwattr $C$DW$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1008                            .dwattr $C$DW$44, DW_AT_decl_line(0xd9)
    1009                            .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
    1010                    
    1011                    $C$DW$45        .dwtag  DW_TAG_member
    1012                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$38)
    1013                            .dwattr $C$DW$45, DW_AT_name("first")
    1014                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("first")
    1015                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1016                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1017                            .dwattr $C$DW$45, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1018                            .dwattr $C$DW$45, DW_AT_decl_line(0xda)
    1019                            .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
    1020                    
    1021                    $C$DW$46        .dwtag  DW_TAG_member
    1022                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$38)
    1023                            .dwattr $C$DW$46, DW_AT_name("last")
    1024                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("last")
    1025                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1026                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1027                            .dwattr $C$DW$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1028                            .dwattr $C$DW$46, DW_AT_decl_line(0xdb)
    1029                            .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
    1030                    
    1031                    $C$DW$47        .dwtag  DW_TAG_member
    1032                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$67)
    1033                            .dwattr $C$DW$47, DW_AT_name("offset")
    1034                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("offset")
    1035                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1036                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1037                            .dwattr $C$DW$47, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1038                            .dwattr $C$DW$47, DW_AT_decl_line(0xdc)
    1039                            .dwattr $C$DW$47, DW_AT_decl_column(0x15)
    1040                    
    1041                    $C$DW$48        .dwtag  DW_TAG_member
    1042                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$40)
    1043                            .dwattr $C$DW$48, DW_AT_name("data")
    1044                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("data")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   20

    1045                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1046                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1047                            .dwattr $C$DW$48, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1048                            .dwattr $C$DW$48, DW_AT_decl_line(0xdd)
    1049                            .dwattr $C$DW$48, DW_AT_decl_column(0x14)
    1050                    
    1051                            .dwattr $C$DW$T$68, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1052                            .dwattr $C$DW$T$68, DW_AT_decl_line(0xd4)
    1053                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    1054                            .dwendtag $C$DW$T$68
    1055                    
    1056                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1057                            .dwattr $C$DW$T$78, DW_AT_name("Graphics_FontEx")
    1058                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$68)
    1059                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1060                            .dwattr $C$DW$T$78, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1061                            .dwattr $C$DW$T$78, DW_AT_decl_line(0xde)
    1062                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1063                    
    1064                    
    1065                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1066                            .dwattr $C$DW$T$69, DW_AT_name("Graphics_Image")
    1067                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x10)
    1068                    $C$DW$49        .dwtag  DW_TAG_member
    1069                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$38)
    1070                            .dwattr $C$DW$49, DW_AT_name("bPP")
    1071                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("bPP")
    1072                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1074                            .dwattr $C$DW$49, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1075                            .dwattr $C$DW$49, DW_AT_decl_line(0x4f)
    1076                            .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
    1077                    
    1078                    $C$DW$50        .dwtag  DW_TAG_member
    1079                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$29)
    1080                            .dwattr $C$DW$50, DW_AT_name("xSize")
    1081                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("xSize")
    1082                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1083                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1084                            .dwattr $C$DW$50, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1085                            .dwattr $C$DW$50, DW_AT_decl_line(0x50)
    1086                            .dwattr $C$DW$50, DW_AT_decl_column(0x0e)
    1087                    
    1088                    $C$DW$51        .dwtag  DW_TAG_member
    1089                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$29)
    1090                            .dwattr $C$DW$51, DW_AT_name("ySize")
    1091                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ySize")
    1092                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1093                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1094                            .dwattr $C$DW$51, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1095                            .dwattr $C$DW$51, DW_AT_decl_line(0x51)
    1096                            .dwattr $C$DW$51, DW_AT_decl_column(0x0e)
    1097                    
    1098                    $C$DW$52        .dwtag  DW_TAG_member
    1099                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$29)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   21

    1100                            .dwattr $C$DW$52, DW_AT_name("numColors")
    1101                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("numColors")
    1102                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1103                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1104                            .dwattr $C$DW$52, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1105                            .dwattr $C$DW$52, DW_AT_decl_line(0x52)
    1106                            .dwattr $C$DW$52, DW_AT_decl_column(0x0e)
    1107                    
    1108                    $C$DW$53        .dwtag  DW_TAG_member
    1109                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$42)
    1110                            .dwattr $C$DW$53, DW_AT_name("pPalette")
    1111                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("pPalette")
    1112                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1113                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1114                            .dwattr $C$DW$53, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1115                            .dwattr $C$DW$53, DW_AT_decl_line(0x53)
    1116                            .dwattr $C$DW$53, DW_AT_decl_column(0x17)
    1117                    
    1118                    $C$DW$54        .dwtag  DW_TAG_member
    1119                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$40)
    1120                            .dwattr $C$DW$54, DW_AT_name("pPixel")
    1121                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pPixel")
    1122                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1123                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1124                            .dwattr $C$DW$54, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1125                            .dwattr $C$DW$54, DW_AT_decl_line(0x54)
    1126                            .dwattr $C$DW$54, DW_AT_decl_column(0x15)
    1127                    
    1128                            .dwattr $C$DW$T$69, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1129                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x4d)
    1130                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    1131                            .dwendtag $C$DW$T$69
    1132                    
    1133                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1134                            .dwattr $C$DW$T$79, DW_AT_name("Graphics_Image")
    1135                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$69)
    1136                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1137                            .dwattr $C$DW$T$79, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1138                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x55)
    1139                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    1140                    
    1141                    $C$DW$T$80      .dwtag  DW_TAG_const_type
    1142                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    1143                    
    1144                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    1145                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1146                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    1147                    
    1148                    
    1149                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1150                            .dwattr $C$DW$T$70, DW_AT_name("Graphics_Rectangle")
    1151                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1152                    $C$DW$55        .dwtag  DW_TAG_member
    1153                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$34)
    1154                            .dwattr $C$DW$55, DW_AT_name("xMin")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   22

    1155                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("xMin")
    1156                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1158                            .dwattr $C$DW$55, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1159                            .dwattr $C$DW$55, DW_AT_decl_line(0x60)
    1160                            .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1161                    
    1162                    $C$DW$56        .dwtag  DW_TAG_member
    1163                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$34)
    1164                            .dwattr $C$DW$56, DW_AT_name("yMin")
    1165                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("yMin")
    1166                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1167                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1168                            .dwattr $C$DW$56, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1169                            .dwattr $C$DW$56, DW_AT_decl_line(0x61)
    1170                            .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1171                    
    1172                    $C$DW$57        .dwtag  DW_TAG_member
    1173                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$34)
    1174                            .dwattr $C$DW$57, DW_AT_name("xMax")
    1175                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("xMax")
    1176                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1177                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1178                            .dwattr $C$DW$57, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1179                            .dwattr $C$DW$57, DW_AT_decl_line(0x62)
    1180                            .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1181                    
    1182                    $C$DW$58        .dwtag  DW_TAG_member
    1183                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$34)
    1184                            .dwattr $C$DW$58, DW_AT_name("yMax")
    1185                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("yMax")
    1186                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1187                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1188                            .dwattr $C$DW$58, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1189                            .dwattr $C$DW$58, DW_AT_decl_line(0x63)
    1190                            .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1191                    
    1192                            .dwattr $C$DW$T$70, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1193                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5e)
    1194                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    1195                            .dwendtag $C$DW$T$70
    1196                    
    1197                    $C$DW$T$23      .dwtag  DW_TAG_typedef
    1198                            .dwattr $C$DW$T$23, DW_AT_name("Graphics_Rectangle")
    1199                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$70)
    1200                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1201                            .dwattr $C$DW$T$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1202                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x64)
    1203                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    1204                    
    1205                    $C$DW$T$49      .dwtag  DW_TAG_const_type
    1206                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$23)
    1207                    
    1208                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1209                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
4bit.asm                                                             PAGE   23

    1210                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    1211                    
    1212                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1213                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1214                    
    1215                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1216                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1217                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1218                    
    1219                    
    1220                    $C$DW$T$35      .dwtag  DW_TAG_subroutine_type
    1221                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1222                    $C$DW$59        .dwtag  DW_TAG_formal_parameter
    1223                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
    1224                    
    1225                    $C$DW$60        .dwtag  DW_TAG_formal_parameter
    1226                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$34)
    1227                    
    1228                    $C$DW$61        .dwtag  DW_TAG_formal_parameter
    1229                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$34)
    1230                    
    1231                    $C$DW$62        .dwtag  DW_TAG_formal_parameter
    1232                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$29)
    1233                    
    1234                            .dwendtag $C$DW$T$35
    1235                    
    1236                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1237                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1238                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    1239                    
    1240                    $C$DW$T$37      .dwtag  DW_TAG_const_type
    1241                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1242                    
