TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Mon Apr  3 01:00:07 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../joystick_draw3.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/BUWORK/2017 Spring/Joy3/Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("ADC14_getResult")

    1356                    ;******************************************************************************
    1357 0000010b                   .sect   ".text:ADC14_IRQHandler"
    1358                            .align  4
    1359 0000010c 00000000  ||$C$FL1||:     .word   000000000h
    1360 00000110 3FE00000          .word   03fe00000h      ; 0.5
    1361                            .align  4
    1362 00000114 00000000  ||$C$FL2||:     .word   000000000h
    1363 00000118 4072C000          .word   04072c000h      ; 300
    1364                            .align  4
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   26

    1365 0000011c 00000000  ||$C$FL3||:     .word   000000000h
    1366 00000120 3FF00000          .word   03ff00000h      ; 1
    1367                            .align  4
    1368 00000124 00000000  ||$C$FL4||:     .word   000000000h
    1369 00000128 412E8480          .word   0412e8480h      ; 1000000
    1370                            .align  4
    1371 0000012c 9999999A  ||$C$FL5||:     .word   09999999ah
    1372 00000130 BFA99999          .word   0bfa99999h      ; -0.05000000000000000278
    1373                            .align  4
    1374 00000134 00000000  ||$C$FL6||:     .word   000000000h
    1375 00000138 40890000          .word   040890000h      ; 800
    1376                    ;******************************************************************************
    1377                    ;* CONSTANT TABLE                                                             *
    1378                    ;******************************************************************************
    1379 0000013c                   .sect   ".text:ADC14_IRQHandler"
    1380                            .align  4
    1381 0000013c 02000804  ||$C$CON14||:   .bits   33556484,32
    1382                            .align  4
    1383 00000140 40004C21  ||$C$CON15||:   .bits   1073761313,32
    1384                            .align  4
    1385 00000144 00000000! ||$C$CON16||:   .bits   buttonPressed,32
    1386                            .align  4
    1387 00000148 00000000! ||$C$CON17||:   .bits   state,32
    1388                            .align  4
    1389 0000014c 00000000! ||$C$CON19||:   .bits   frequency,32
    1390                            .align  4
    1391 00000150 40000012  ||$C$CON20||:   .bits   1073741842,32
    1392                            .align  4
    1393 00000154 00000000! ||$C$CON21||:   .bits   duty_cycle,32
    1394                            .align  4
    1395 00000158 00000000! ||$C$CON22||:   .bits   resultsBuffer,32
    1396                    ;*****************************************************************************
    1397                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1398                    ;*****************************************************************************
    1399                            .global ADC14_getResult
    1400                            .global GPIO_setAsPeripheralModuleFunctionOutputPin
    1401                            .global Timer_A_registerInterrupt
    1402                            .global printf
    1403                            .global print_current_results
    1404                            .global __aeabi_ui2d
    1405                            .global __aeabi_dmul
    1406                            .global __aeabi_dadd
    1407                            .global __aeabi_ddiv
    1408                            .global __aeabi_d2uiz
    1409                    
    1410                    ;******************************************************************************
    1411                    ;* BUILD ATTRIBUTES                                                           *
    1412                    ;******************************************************************************
    1413                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    1414                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    1415                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    1416                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    1417                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    1418                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
    1419                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   27

    1420                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1421                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
    1422                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1423                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1424                    
    1425                    ;******************************************************************************
    1426                    ;* TYPE INFORMATION                                                           *
    1427                    ;******************************************************************************
    1428                    
    1429                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1430                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x30)
    1431                    $C$DW$76        .dwtag  DW_TAG_member
    1432                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1433                            .dwattr $C$DW$76, DW_AT_name("CTL")
    1434                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("CTL")
    1435                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1437                            .dwattr $C$DW$76, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1438                            .dwattr $C$DW$76, DW_AT_decl_line(0x4a1)
    1439                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1440                    
    1441                    $C$DW$77        .dwtag  DW_TAG_member
    1442                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1443                            .dwattr $C$DW$77, DW_AT_name("CCTL")
    1444                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("CCTL")
    1445                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1446                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1447                            .dwattr $C$DW$77, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1448                            .dwattr $C$DW$77, DW_AT_decl_line(0x4a2)
    1449                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1450                    
    1451                    $C$DW$78        .dwtag  DW_TAG_member
    1452                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1453                            .dwattr $C$DW$78, DW_AT_name("R")
    1454                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("R")
    1455                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1456                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1457                            .dwattr $C$DW$78, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1458                            .dwattr $C$DW$78, DW_AT_decl_line(0x4a3)
    1459                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1460                    
    1461                    $C$DW$79        .dwtag  DW_TAG_member
    1462                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1463                            .dwattr $C$DW$79, DW_AT_name("CCR")
    1464                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("CCR")
    1465                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1466                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1467                            .dwattr $C$DW$79, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1468                            .dwattr $C$DW$79, DW_AT_decl_line(0x4a4)
    1469                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1470                    
    1471                    $C$DW$80        .dwtag  DW_TAG_member
    1472                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1473                            .dwattr $C$DW$80, DW_AT_name("EX0")
    1474                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("EX0")
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   28

    1475                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1476                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$80, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1478                            .dwattr $C$DW$80, DW_AT_decl_line(0x4a5)
    1479                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1480                    
    1481                    $C$DW$81        .dwtag  DW_TAG_member
    1482                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
    1483                            .dwattr $C$DW$81, DW_AT_name("RESERVED0")
    1484                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED0")
    1485                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1486                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1487                            .dwattr $C$DW$81, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1488                            .dwattr $C$DW$81, DW_AT_decl_line(0x4a6)
    1489                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1490                    
    1491                    $C$DW$82        .dwtag  DW_TAG_member
    1492                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$23)
    1493                            .dwattr $C$DW$82, DW_AT_name("IV")
    1494                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("IV")
    1495                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1496                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1497                            .dwattr $C$DW$82, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1498                            .dwattr $C$DW$82, DW_AT_decl_line(0x4a7)
    1499                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1500                    
    1501                            .dwattr $C$DW$T$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1502                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x4a0)
    1503                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1504                            .dwendtag $C$DW$T$24
    1505                    
    1506                    $C$DW$T$193     .dwtag  DW_TAG_typedef
    1507                            .dwattr $C$DW$T$193, DW_AT_name("Timer_A_Type")
    1508                            .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$24)
    1509                            .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    1510                            .dwattr $C$DW$T$193, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    1511                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x4a8)
    1512                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x03)
    1513                    
    1514                    
    1515                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1516                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1517                    $C$DW$83        .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$25)
    1519                            .dwattr $C$DW$83, DW_AT_name("_reserved0")
    1520                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("_reserved0")
    1521                            .dwattr $C$DW$83, DW_AT_bit_offset(0x10)
    1522                            .dwattr $C$DW$83, DW_AT_bit_size(0x10)
    1523                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwattr $C$DW$83, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1526                            .dwattr $C$DW$83, DW_AT_decl_line(0x138)
    1527                            .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1528                    
    1529                    $C$DW$84        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   29

    1530                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
    1531                            .dwattr $C$DW$84, DW_AT_name("GE")
    1532                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("GE")
    1533                            .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
    1534                            .dwattr $C$DW$84, DW_AT_bit_size(0x04)
    1535                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1537                            .dwattr $C$DW$84, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1538                            .dwattr $C$DW$84, DW_AT_decl_line(0x139)
    1539                            .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1540                    
    1541                    $C$DW$85        .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$25)
    1543                            .dwattr $C$DW$85, DW_AT_name("_reserved1")
    1544                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("_reserved1")
    1545                            .dwattr $C$DW$85, DW_AT_bit_offset(0x05)
    1546                            .dwattr $C$DW$85, DW_AT_bit_size(0x07)
    1547                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1549                            .dwattr $C$DW$85, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1550                            .dwattr $C$DW$85, DW_AT_decl_line(0x13a)
    1551                            .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1552                    
    1553                    $C$DW$86        .dwtag  DW_TAG_member
    1554                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
    1555                            .dwattr $C$DW$86, DW_AT_name("Q")
    1556                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("Q")
    1557                            .dwattr $C$DW$86, DW_AT_bit_offset(0x04)
    1558                            .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1559                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1561                            .dwattr $C$DW$86, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1562                            .dwattr $C$DW$86, DW_AT_decl_line(0x13b)
    1563                            .dwattr $C$DW$86, DW_AT_decl_column(0x0e)
    1564                    
    1565                    $C$DW$87        .dwtag  DW_TAG_member
    1566                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$25)
    1567                            .dwattr $C$DW$87, DW_AT_name("V")
    1568                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("V")
    1569                            .dwattr $C$DW$87, DW_AT_bit_offset(0x03)
    1570                            .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1571                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1573                            .dwattr $C$DW$87, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1574                            .dwattr $C$DW$87, DW_AT_decl_line(0x13c)
    1575                            .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1576                    
    1577                    $C$DW$88        .dwtag  DW_TAG_member
    1578                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$25)
    1579                            .dwattr $C$DW$88, DW_AT_name("C")
    1580                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("C")
    1581                            .dwattr $C$DW$88, DW_AT_bit_offset(0x02)
    1582                            .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1583                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   30

    1585                            .dwattr $C$DW$88, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1586                            .dwattr $C$DW$88, DW_AT_decl_line(0x13d)
    1587                            .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1588                    
    1589                    $C$DW$89        .dwtag  DW_TAG_member
    1590                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1591                            .dwattr $C$DW$89, DW_AT_name("Z")
    1592                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("Z")
    1593                            .dwattr $C$DW$89, DW_AT_bit_offset(0x01)
    1594                            .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1595                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1597                            .dwattr $C$DW$89, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1598                            .dwattr $C$DW$89, DW_AT_decl_line(0x13e)
    1599                            .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
    1600                    
    1601                    $C$DW$90        .dwtag  DW_TAG_member
    1602                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$25)
    1603                            .dwattr $C$DW$90, DW_AT_name("N")
    1604                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("N")
    1605                            .dwattr $C$DW$90, DW_AT_bit_offset(0x00)
    1606                            .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1607                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1609                            .dwattr $C$DW$90, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1610                            .dwattr $C$DW$90, DW_AT_decl_line(0x13f)
    1611                            .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1612                    
    1613                            .dwattr $C$DW$T$26, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1614                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x137)
    1615                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    1616                            .dwendtag $C$DW$T$26
    1617                    
    1618                    
    1619                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1620                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1621                    $C$DW$91        .dwtag  DW_TAG_member
    1622                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$25)
    1623                            .dwattr $C$DW$91, DW_AT_name("ISR")
    1624                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ISR")
    1625                            .dwattr $C$DW$91, DW_AT_bit_offset(0x17)
    1626                            .dwattr $C$DW$91, DW_AT_bit_size(0x09)
    1627                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1629                            .dwattr $C$DW$91, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1630                            .dwattr $C$DW$91, DW_AT_decl_line(0x15f)
    1631                            .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1632                    
    1633                    $C$DW$92        .dwtag  DW_TAG_member
    1634                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$25)
    1635                            .dwattr $C$DW$92, DW_AT_name("_reserved0")
    1636                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("_reserved0")
    1637                            .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
    1638                            .dwattr $C$DW$92, DW_AT_bit_size(0x17)
    1639                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   31

    1640                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1641                            .dwattr $C$DW$92, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1642                            .dwattr $C$DW$92, DW_AT_decl_line(0x160)
    1643                            .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1644                    
    1645                            .dwattr $C$DW$T$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1646                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x15e)
    1647                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    1648                            .dwendtag $C$DW$T$27
    1649                    
    1650                    
    1651                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1652                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1653                    $C$DW$93        .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1655                            .dwattr $C$DW$93, DW_AT_name("ISR")
    1656                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("ISR")
    1657                            .dwattr $C$DW$93, DW_AT_bit_offset(0x17)
    1658                            .dwattr $C$DW$93, DW_AT_bit_size(0x09)
    1659                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1661                            .dwattr $C$DW$93, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1662                            .dwattr $C$DW$93, DW_AT_decl_line(0x171)
    1663                            .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1664                    
    1665                    $C$DW$94        .dwtag  DW_TAG_member
    1666                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$25)
    1667                            .dwattr $C$DW$94, DW_AT_name("_reserved0")
    1668                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("_reserved0")
    1669                            .dwattr $C$DW$94, DW_AT_bit_offset(0x10)
    1670                            .dwattr $C$DW$94, DW_AT_bit_size(0x07)
    1671                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$94, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1674                            .dwattr $C$DW$94, DW_AT_decl_line(0x172)
    1675                            .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1676                    
    1677                    $C$DW$95        .dwtag  DW_TAG_member
    1678                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$25)
    1679                            .dwattr $C$DW$95, DW_AT_name("GE")
    1680                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("GE")
    1681                            .dwattr $C$DW$95, DW_AT_bit_offset(0x0c)
    1682                            .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1683                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwattr $C$DW$95, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1686                            .dwattr $C$DW$95, DW_AT_decl_line(0x173)
    1687                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1688                    
    1689                    $C$DW$96        .dwtag  DW_TAG_member
    1690                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$25)
    1691                            .dwattr $C$DW$96, DW_AT_name("_reserved1")
    1692                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("_reserved1")
    1693                            .dwattr $C$DW$96, DW_AT_bit_offset(0x08)
    1694                            .dwattr $C$DW$96, DW_AT_bit_size(0x04)
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   32

    1695                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1697                            .dwattr $C$DW$96, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1698                            .dwattr $C$DW$96, DW_AT_decl_line(0x174)
    1699                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1700                    
    1701                    $C$DW$97        .dwtag  DW_TAG_member
    1702                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$25)
    1703                            .dwattr $C$DW$97, DW_AT_name("T")
    1704                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("T")
    1705                            .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
    1706                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1707                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$97, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1710                            .dwattr $C$DW$97, DW_AT_decl_line(0x175)
    1711                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1712                    
    1713                    $C$DW$98        .dwtag  DW_TAG_member
    1714                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$25)
    1715                            .dwattr $C$DW$98, DW_AT_name("IT")
    1716                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("IT")
    1717                            .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1718                            .dwattr $C$DW$98, DW_AT_bit_size(0x02)
    1719                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$98, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1722                            .dwattr $C$DW$98, DW_AT_decl_line(0x176)
    1723                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1724                    
    1725                    $C$DW$99        .dwtag  DW_TAG_member
    1726                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$25)
    1727                            .dwattr $C$DW$99, DW_AT_name("Q")
    1728                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("Q")
    1729                            .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1730                            .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1731                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwattr $C$DW$99, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1734                            .dwattr $C$DW$99, DW_AT_decl_line(0x177)
    1735                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1736                    
    1737                    $C$DW$100       .dwtag  DW_TAG_member
    1738                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$25)
    1739                            .dwattr $C$DW$100, DW_AT_name("V")
    1740                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("V")
    1741                            .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1742                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1743                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1745                            .dwattr $C$DW$100, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1746                            .dwattr $C$DW$100, DW_AT_decl_line(0x178)
    1747                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1748                    
    1749                    $C$DW$101       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   33

    1750                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$25)
    1751                            .dwattr $C$DW$101, DW_AT_name("C")
    1752                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("C")
    1753                            .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1754                            .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1755                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1757                            .dwattr $C$DW$101, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1758                            .dwattr $C$DW$101, DW_AT_decl_line(0x179)
    1759                            .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1760                    
    1761                    $C$DW$102       .dwtag  DW_TAG_member
    1762                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$25)
    1763                            .dwattr $C$DW$102, DW_AT_name("Z")
    1764                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("Z")
    1765                            .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1766                            .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1767                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1769                            .dwattr $C$DW$102, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1770                            .dwattr $C$DW$102, DW_AT_decl_line(0x17a)
    1771                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1772                    
    1773                    $C$DW$103       .dwtag  DW_TAG_member
    1774                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$25)
    1775                            .dwattr $C$DW$103, DW_AT_name("N")
    1776                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("N")
    1777                            .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1778                            .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1779                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1780                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1781                            .dwattr $C$DW$103, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1782                            .dwattr $C$DW$103, DW_AT_decl_line(0x17b)
    1783                            .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1784                    
    1785                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1786                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x170)
    1787                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1788                            .dwendtag $C$DW$T$28
    1789                    
    1790                    
    1791                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1792                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1793                    $C$DW$104       .dwtag  DW_TAG_member
    1794                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$25)
    1795                            .dwattr $C$DW$104, DW_AT_name("nPRIV")
    1796                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("nPRIV")
    1797                            .dwattr $C$DW$104, DW_AT_bit_offset(0x1f)
    1798                            .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1799                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1801                            .dwattr $C$DW$104, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1802                            .dwattr $C$DW$104, DW_AT_decl_line(0x1a4)
    1803                            .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1804                    
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   34

    1805                    $C$DW$105       .dwtag  DW_TAG_member
    1806                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$25)
    1807                            .dwattr $C$DW$105, DW_AT_name("SPSEL")
    1808                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("SPSEL")
    1809                            .dwattr $C$DW$105, DW_AT_bit_offset(0x1e)
    1810                            .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1811                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1813                            .dwattr $C$DW$105, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1814                            .dwattr $C$DW$105, DW_AT_decl_line(0x1a5)
    1815                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1816                    
    1817                    $C$DW$106       .dwtag  DW_TAG_member
    1818                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$25)
    1819                            .dwattr $C$DW$106, DW_AT_name("FPCA")
    1820                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("FPCA")
    1821                            .dwattr $C$DW$106, DW_AT_bit_offset(0x1d)
    1822                            .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1823                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$106, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1826                            .dwattr $C$DW$106, DW_AT_decl_line(0x1a6)
    1827                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1828                    
    1829                    $C$DW$107       .dwtag  DW_TAG_member
    1830                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1831                            .dwattr $C$DW$107, DW_AT_name("_reserved0")
    1832                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("_reserved0")
    1833                            .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    1834                            .dwattr $C$DW$107, DW_AT_bit_size(0x1d)
    1835                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1837                            .dwattr $C$DW$107, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1838                            .dwattr $C$DW$107, DW_AT_decl_line(0x1a7)
    1839                            .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1840                    
    1841                            .dwattr $C$DW$T$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1842                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1a3)
    1843                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    1844                            .dwendtag $C$DW$T$29
    1845                    
    1846                    
    1847                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1848                            .dwattr $C$DW$T$38, DW_AT_byte_size(0xe04)
    1849                    $C$DW$108       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$31)
    1851                            .dwattr $C$DW$108, DW_AT_name("ISER")
    1852                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("ISER")
    1853                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1855                            .dwattr $C$DW$108, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1856                            .dwattr $C$DW$108, DW_AT_decl_line(0x1c5)
    1857                            .dwattr $C$DW$108, DW_AT_decl_column(0x12)
    1858                    
    1859                    $C$DW$109       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   35

    1860                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$32)
    1861                            .dwattr $C$DW$109, DW_AT_name("RESERVED0")
    1862                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("RESERVED0")
    1863                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1864                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$109, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1866                            .dwattr $C$DW$109, DW_AT_decl_line(0x1c6)
    1867                            .dwattr $C$DW$109, DW_AT_decl_column(0x12)
    1868                    
    1869                    $C$DW$110       .dwtag  DW_TAG_member
    1870                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$31)
    1871                            .dwattr $C$DW$110, DW_AT_name("ICER")
    1872                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("ICER")
    1873                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1874                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1875                            .dwattr $C$DW$110, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1876                            .dwattr $C$DW$110, DW_AT_decl_line(0x1c7)
    1877                            .dwattr $C$DW$110, DW_AT_decl_column(0x12)
    1878                    
    1879                    $C$DW$111       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$32)
    1881                            .dwattr $C$DW$111, DW_AT_name("RSERVED1")
    1882                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("RSERVED1")
    1883                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1884                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$111, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1886                            .dwattr $C$DW$111, DW_AT_decl_line(0x1c8)
    1887                            .dwattr $C$DW$111, DW_AT_decl_column(0x12)
    1888                    
    1889                    $C$DW$112       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$31)
    1891                            .dwattr $C$DW$112, DW_AT_name("ISPR")
    1892                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("ISPR")
    1893                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1894                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$112, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1896                            .dwattr $C$DW$112, DW_AT_decl_line(0x1c9)
    1897                            .dwattr $C$DW$112, DW_AT_decl_column(0x12)
    1898                    
    1899                    $C$DW$113       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$32)
    1901                            .dwattr $C$DW$113, DW_AT_name("RESERVED2")
    1902                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("RESERVED2")
    1903                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1904                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$113, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1906                            .dwattr $C$DW$113, DW_AT_decl_line(0x1ca)
    1907                            .dwattr $C$DW$113, DW_AT_decl_column(0x12)
    1908                    
    1909                    $C$DW$114       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$31)
    1911                            .dwattr $C$DW$114, DW_AT_name("ICPR")
    1912                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("ICPR")
    1913                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1914                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   36

    1915                            .dwattr $C$DW$114, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1916                            .dwattr $C$DW$114, DW_AT_decl_line(0x1cb)
    1917                            .dwattr $C$DW$114, DW_AT_decl_column(0x12)
    1918                    
    1919                    $C$DW$115       .dwtag  DW_TAG_member
    1920                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$32)
    1921                            .dwattr $C$DW$115, DW_AT_name("RESERVED3")
    1922                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("RESERVED3")
    1923                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1924                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1925                            .dwattr $C$DW$115, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1926                            .dwattr $C$DW$115, DW_AT_decl_line(0x1cc)
    1927                            .dwattr $C$DW$115, DW_AT_decl_column(0x12)
    1928                    
    1929                    $C$DW$116       .dwtag  DW_TAG_member
    1930                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$31)
    1931                            .dwattr $C$DW$116, DW_AT_name("IABR")
    1932                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("IABR")
    1933                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1934                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1935                            .dwattr $C$DW$116, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1936                            .dwattr $C$DW$116, DW_AT_decl_line(0x1cd)
    1937                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1938                    
    1939                    $C$DW$117       .dwtag  DW_TAG_member
    1940                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$33)
    1941                            .dwattr $C$DW$117, DW_AT_name("RESERVED4")
    1942                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("RESERVED4")
    1943                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1944                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1945                            .dwattr $C$DW$117, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1946                            .dwattr $C$DW$117, DW_AT_decl_line(0x1ce)
    1947                            .dwattr $C$DW$117, DW_AT_decl_column(0x12)
    1948                    
    1949                    $C$DW$118       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$36)
    1951                            .dwattr $C$DW$118, DW_AT_name("IP")
    1952                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("IP")
    1953                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1954                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$118, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1956                            .dwattr $C$DW$118, DW_AT_decl_line(0x1cf)
    1957                            .dwattr $C$DW$118, DW_AT_decl_column(0x12)
    1958                    
    1959                    $C$DW$119       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$37)
    1961                            .dwattr $C$DW$119, DW_AT_name("RESERVED5")
    1962                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("RESERVED5")
    1963                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1964                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1965                            .dwattr $C$DW$119, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1966                            .dwattr $C$DW$119, DW_AT_decl_line(0x1d0)
    1967                            .dwattr $C$DW$119, DW_AT_decl_column(0x12)
    1968                    
    1969                    $C$DW$120       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   37

    1970                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$30)
    1971                            .dwattr $C$DW$120, DW_AT_name("STIR")
    1972                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("STIR")
    1973                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1974                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$120, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1976                            .dwattr $C$DW$120, DW_AT_decl_line(0x1d1)
    1977                            .dwattr $C$DW$120, DW_AT_decl_column(0x12)
    1978                    
    1979                            .dwattr $C$DW$T$38, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1980                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1c4)
    1981                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    1982                            .dwendtag $C$DW$T$38
    1983                    
    1984                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    1985                            .dwattr $C$DW$T$194, DW_AT_name("NVIC_Type")
    1986                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$38)
    1987                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    1988                            .dwattr $C$DW$T$194, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    1989                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x1d2)
    1990                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x04)
    1991                    
    1992                    
    1993                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1994                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x8c)
    1995                    $C$DW$121       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$39)
    1997                            .dwattr $C$DW$121, DW_AT_name("CPUID")
    1998                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("CPUID")
    1999                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$121, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2002                            .dwattr $C$DW$121, DW_AT_decl_line(0x1e7)
    2003                            .dwattr $C$DW$121, DW_AT_decl_column(0x12)
    2004                    
    2005                    $C$DW$122       .dwtag  DW_TAG_member
    2006                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$30)
    2007                            .dwattr $C$DW$122, DW_AT_name("ICSR")
    2008                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("ICSR")
    2009                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2010                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2011                            .dwattr $C$DW$122, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2012                            .dwattr $C$DW$122, DW_AT_decl_line(0x1e8)
    2013                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    2014                    
    2015                    $C$DW$123       .dwtag  DW_TAG_member
    2016                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$30)
    2017                            .dwattr $C$DW$123, DW_AT_name("VTOR")
    2018                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("VTOR")
    2019                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2020                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2021                            .dwattr $C$DW$123, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2022                            .dwattr $C$DW$123, DW_AT_decl_line(0x1e9)
    2023                            .dwattr $C$DW$123, DW_AT_decl_column(0x12)
    2024                    
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   38

    2025                    $C$DW$124       .dwtag  DW_TAG_member
    2026                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$30)
    2027                            .dwattr $C$DW$124, DW_AT_name("AIRCR")
    2028                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("AIRCR")
    2029                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2030                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2031                            .dwattr $C$DW$124, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2032                            .dwattr $C$DW$124, DW_AT_decl_line(0x1ea)
    2033                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    2034                    
    2035                    $C$DW$125       .dwtag  DW_TAG_member
    2036                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$30)
    2037                            .dwattr $C$DW$125, DW_AT_name("SCR")
    2038                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("SCR")
    2039                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2040                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2041                            .dwattr $C$DW$125, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2042                            .dwattr $C$DW$125, DW_AT_decl_line(0x1eb)
    2043                            .dwattr $C$DW$125, DW_AT_decl_column(0x12)
    2044                    
    2045                    $C$DW$126       .dwtag  DW_TAG_member
    2046                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$30)
    2047                            .dwattr $C$DW$126, DW_AT_name("CCR")
    2048                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("CCR")
    2049                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2050                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2051                            .dwattr $C$DW$126, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2052                            .dwattr $C$DW$126, DW_AT_decl_line(0x1ec)
    2053                            .dwattr $C$DW$126, DW_AT_decl_column(0x12)
    2054                    
    2055                    $C$DW$127       .dwtag  DW_TAG_member
    2056                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$40)
    2057                            .dwattr $C$DW$127, DW_AT_name("SHP")
    2058                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("SHP")
    2059                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2060                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2061                            .dwattr $C$DW$127, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2062                            .dwattr $C$DW$127, DW_AT_decl_line(0x1ed)
    2063                            .dwattr $C$DW$127, DW_AT_decl_column(0x12)
    2064                    
    2065                    $C$DW$128       .dwtag  DW_TAG_member
    2066                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$30)
    2067                            .dwattr $C$DW$128, DW_AT_name("SHCSR")
    2068                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("SHCSR")
    2069                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2070                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2071                            .dwattr $C$DW$128, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2072                            .dwattr $C$DW$128, DW_AT_decl_line(0x1ee)
    2073                            .dwattr $C$DW$128, DW_AT_decl_column(0x12)
    2074                    
    2075                    $C$DW$129       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$30)
    2077                            .dwattr $C$DW$129, DW_AT_name("CFSR")
    2078                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("CFSR")
    2079                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   39

    2080                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2081                            .dwattr $C$DW$129, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2082                            .dwattr $C$DW$129, DW_AT_decl_line(0x1ef)
    2083                            .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    2084                    
    2085                    $C$DW$130       .dwtag  DW_TAG_member
    2086                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$30)
    2087                            .dwattr $C$DW$130, DW_AT_name("HFSR")
    2088                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("HFSR")
    2089                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2090                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2091                            .dwattr $C$DW$130, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2092                            .dwattr $C$DW$130, DW_AT_decl_line(0x1f0)
    2093                            .dwattr $C$DW$130, DW_AT_decl_column(0x12)
    2094                    
    2095                    $C$DW$131       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$30)
    2097                            .dwattr $C$DW$131, DW_AT_name("DFSR")
    2098                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("DFSR")
    2099                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2100                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$131, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2102                            .dwattr $C$DW$131, DW_AT_decl_line(0x1f1)
    2103                            .dwattr $C$DW$131, DW_AT_decl_column(0x12)
    2104                    
    2105                    $C$DW$132       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$30)
    2107                            .dwattr $C$DW$132, DW_AT_name("MMFAR")
    2108                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("MMFAR")
    2109                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2110                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2111                            .dwattr $C$DW$132, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2112                            .dwattr $C$DW$132, DW_AT_decl_line(0x1f2)
    2113                            .dwattr $C$DW$132, DW_AT_decl_column(0x12)
    2114                    
    2115                    $C$DW$133       .dwtag  DW_TAG_member
    2116                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$30)
    2117                            .dwattr $C$DW$133, DW_AT_name("BFAR")
    2118                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("BFAR")
    2119                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2120                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2121                            .dwattr $C$DW$133, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2122                            .dwattr $C$DW$133, DW_AT_decl_line(0x1f3)
    2123                            .dwattr $C$DW$133, DW_AT_decl_column(0x12)
    2124                    
    2125                    $C$DW$134       .dwtag  DW_TAG_member
    2126                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$30)
    2127                            .dwattr $C$DW$134, DW_AT_name("AFSR")
    2128                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("AFSR")
    2129                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2130                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2131                            .dwattr $C$DW$134, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2132                            .dwattr $C$DW$134, DW_AT_decl_line(0x1f4)
    2133                            .dwattr $C$DW$134, DW_AT_decl_column(0x12)
    2134                    
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   40

    2135                    $C$DW$135       .dwtag  DW_TAG_member
    2136                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$41)
    2137                            .dwattr $C$DW$135, DW_AT_name("PFR")
    2138                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("PFR")
    2139                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2140                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2141                            .dwattr $C$DW$135, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2142                            .dwattr $C$DW$135, DW_AT_decl_line(0x1f5)
    2143                            .dwattr $C$DW$135, DW_AT_decl_column(0x12)
    2144                    
    2145                    $C$DW$136       .dwtag  DW_TAG_member
    2146                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$39)
    2147                            .dwattr $C$DW$136, DW_AT_name("DFR")
    2148                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("DFR")
    2149                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2150                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2151                            .dwattr $C$DW$136, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2152                            .dwattr $C$DW$136, DW_AT_decl_line(0x1f6)
    2153                            .dwattr $C$DW$136, DW_AT_decl_column(0x12)
    2154                    
    2155                    $C$DW$137       .dwtag  DW_TAG_member
    2156                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$39)
    2157                            .dwattr $C$DW$137, DW_AT_name("ADR")
    2158                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("ADR")
    2159                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2160                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2161                            .dwattr $C$DW$137, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2162                            .dwattr $C$DW$137, DW_AT_decl_line(0x1f7)
    2163                            .dwattr $C$DW$137, DW_AT_decl_column(0x12)
    2164                    
    2165                    $C$DW$138       .dwtag  DW_TAG_member
    2166                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$42)
    2167                            .dwattr $C$DW$138, DW_AT_name("MMFR")
    2168                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("MMFR")
    2169                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2170                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2171                            .dwattr $C$DW$138, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2172                            .dwattr $C$DW$138, DW_AT_decl_line(0x1f8)
    2173                            .dwattr $C$DW$138, DW_AT_decl_column(0x12)
    2174                    
    2175                    $C$DW$139       .dwtag  DW_TAG_member
    2176                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$43)
    2177                            .dwattr $C$DW$139, DW_AT_name("ISAR")
    2178                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("ISAR")
    2179                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2180                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2181                            .dwattr $C$DW$139, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2182                            .dwattr $C$DW$139, DW_AT_decl_line(0x1f9)
    2183                            .dwattr $C$DW$139, DW_AT_decl_column(0x12)
    2184                    
    2185                    $C$DW$140       .dwtag  DW_TAG_member
    2186                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$44)
    2187                            .dwattr $C$DW$140, DW_AT_name("RESERVED0")
    2188                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("RESERVED0")
    2189                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   41

    2190                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2191                            .dwattr $C$DW$140, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2192                            .dwattr $C$DW$140, DW_AT_decl_line(0x1fa)
    2193                            .dwattr $C$DW$140, DW_AT_decl_column(0x12)
    2194                    
    2195                    $C$DW$141       .dwtag  DW_TAG_member
    2196                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$30)
    2197                            .dwattr $C$DW$141, DW_AT_name("CPACR")
    2198                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("CPACR")
    2199                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2200                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2201                            .dwattr $C$DW$141, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2202                            .dwattr $C$DW$141, DW_AT_decl_line(0x1fb)
    2203                            .dwattr $C$DW$141, DW_AT_decl_column(0x12)
    2204                    
    2205                            .dwattr $C$DW$T$45, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2206                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x1e6)
    2207                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    2208                            .dwendtag $C$DW$T$45
    2209                    
    2210                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    2211                            .dwattr $C$DW$T$195, DW_AT_name("SCB_Type")
    2212                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$45)
    2213                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    2214                            .dwattr $C$DW$T$195, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2215                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x1fc)
    2216                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x03)
    2217                    
    2218                    
    2219                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2220                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
    2221                    $C$DW$142       .dwtag  DW_TAG_member
    2222                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$46)
    2223                            .dwattr $C$DW$142, DW_AT_name("RESERVED0")
    2224                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("RESERVED0")
    2225                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2226                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2227                            .dwattr $C$DW$142, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2228                            .dwattr $C$DW$142, DW_AT_decl_line(0x2c2)
    2229                            .dwattr $C$DW$142, DW_AT_decl_column(0x12)
    2230                    
    2231                    $C$DW$143       .dwtag  DW_TAG_member
    2232                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$39)
    2233                            .dwattr $C$DW$143, DW_AT_name("ICTR")
    2234                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("ICTR")
    2235                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2236                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2237                            .dwattr $C$DW$143, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2238                            .dwattr $C$DW$143, DW_AT_decl_line(0x2c3)
    2239                            .dwattr $C$DW$143, DW_AT_decl_column(0x12)
    2240                    
    2241                    $C$DW$144       .dwtag  DW_TAG_member
    2242                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$30)
    2243                            .dwattr $C$DW$144, DW_AT_name("ACTLR")
    2244                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("ACTLR")
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   42

    2245                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2246                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2247                            .dwattr $C$DW$144, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2248                            .dwattr $C$DW$144, DW_AT_decl_line(0x2c4)
    2249                            .dwattr $C$DW$144, DW_AT_decl_column(0x12)
    2250                    
    2251                            .dwattr $C$DW$T$47, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2252                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2c1)
    2253                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2254                            .dwendtag $C$DW$T$47
    2255                    
    2256                    $C$DW$T$196     .dwtag  DW_TAG_typedef
    2257                            .dwattr $C$DW$T$196, DW_AT_name("SCnSCB_Type")
    2258                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$47)
    2259                            .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    2260                            .dwattr $C$DW$T$196, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2261                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x2c5)
    2262                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x03)
    2263                    
    2264                    
    2265                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2266                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x10)
    2267                    $C$DW$145       .dwtag  DW_TAG_member
    2268                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$30)
    2269                            .dwattr $C$DW$145, DW_AT_name("CTRL")
    2270                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("CTRL")
    2271                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2272                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2273                            .dwattr $C$DW$145, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2274                            .dwattr $C$DW$145, DW_AT_decl_line(0x2ea)
    2275                            .dwattr $C$DW$145, DW_AT_decl_column(0x12)
    2276                    
    2277                    $C$DW$146       .dwtag  DW_TAG_member
    2278                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$30)
    2279                            .dwattr $C$DW$146, DW_AT_name("LOAD")
    2280                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("LOAD")
    2281                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2282                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2283                            .dwattr $C$DW$146, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2284                            .dwattr $C$DW$146, DW_AT_decl_line(0x2eb)
    2285                            .dwattr $C$DW$146, DW_AT_decl_column(0x12)
    2286                    
    2287                    $C$DW$147       .dwtag  DW_TAG_member
    2288                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$30)
    2289                            .dwattr $C$DW$147, DW_AT_name("VAL")
    2290                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("VAL")
    2291                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2292                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2293                            .dwattr $C$DW$147, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2294                            .dwattr $C$DW$147, DW_AT_decl_line(0x2ec)
    2295                            .dwattr $C$DW$147, DW_AT_decl_column(0x12)
    2296                    
    2297                    $C$DW$148       .dwtag  DW_TAG_member
    2298                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$39)
    2299                            .dwattr $C$DW$148, DW_AT_name("CALIB")
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   43

    2300                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("CALIB")
    2301                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2302                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2303                            .dwattr $C$DW$148, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2304                            .dwattr $C$DW$148, DW_AT_decl_line(0x2ed)
    2305                            .dwattr $C$DW$148, DW_AT_decl_column(0x12)
    2306                    
    2307                            .dwattr $C$DW$T$48, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2308                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2e9)
    2309                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2310                            .dwendtag $C$DW$T$48
    2311                    
    2312                    $C$DW$T$197     .dwtag  DW_TAG_typedef
    2313                            .dwattr $C$DW$T$197, DW_AT_name("SysTick_Type")
    2314                            .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$48)
    2315                            .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    2316                            .dwattr $C$DW$T$197, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2317                            .dwattr $C$DW$T$197, DW_AT_decl_line(0x2ee)
    2318                            .dwattr $C$DW$T$197, DW_AT_decl_column(0x03)
    2319                    
    2320                    
    2321                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2322                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x1000)
    2323                    $C$DW$149       .dwtag  DW_TAG_member
    2324                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$50)
    2325                            .dwattr $C$DW$149, DW_AT_name("PORT")
    2326                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("PORT")
    2327                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2329                            .dwattr $C$DW$149, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2330                            .dwattr $C$DW$149, DW_AT_decl_line(0x323)
    2331                            .dwattr $C$DW$149, DW_AT_decl_column(0x06)
    2332                    
    2333                    $C$DW$150       .dwtag  DW_TAG_member
    2334                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$51)
    2335                            .dwattr $C$DW$150, DW_AT_name("RESERVED0")
    2336                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("RESERVED0")
    2337                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2338                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2339                            .dwattr $C$DW$150, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2340                            .dwattr $C$DW$150, DW_AT_decl_line(0x324)
    2341                            .dwattr $C$DW$150, DW_AT_decl_column(0x12)
    2342                    
    2343                    $C$DW$151       .dwtag  DW_TAG_member
    2344                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$30)
    2345                            .dwattr $C$DW$151, DW_AT_name("TER")
    2346                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("TER")
    2347                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    2348                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2349                            .dwattr $C$DW$151, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2350                            .dwattr $C$DW$151, DW_AT_decl_line(0x325)
    2351                            .dwattr $C$DW$151, DW_AT_decl_column(0x12)
    2352                    
    2353                    $C$DW$152       .dwtag  DW_TAG_member
    2354                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$52)
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   44

    2355                            .dwattr $C$DW$152, DW_AT_name("RESERVED1")
    2356                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("RESERVED1")
    2357                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
    2358                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2359                            .dwattr $C$DW$152, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2360                            .dwattr $C$DW$152, DW_AT_decl_line(0x326)
    2361                            .dwattr $C$DW$152, DW_AT_decl_column(0x12)
    2362                    
    2363                    $C$DW$153       .dwtag  DW_TAG_member
    2364                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$30)
    2365                            .dwattr $C$DW$153, DW_AT_name("TPR")
    2366                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("TPR")
    2367                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
    2368                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2369                            .dwattr $C$DW$153, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2370                            .dwattr $C$DW$153, DW_AT_decl_line(0x327)
    2371                            .dwattr $C$DW$153, DW_AT_decl_column(0x12)
    2372                    
    2373                    $C$DW$154       .dwtag  DW_TAG_member
    2374                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$52)
    2375                            .dwattr $C$DW$154, DW_AT_name("RESERVED2")
    2376                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("RESERVED2")
    2377                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
    2378                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2379                            .dwattr $C$DW$154, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2380                            .dwattr $C$DW$154, DW_AT_decl_line(0x328)
    2381                            .dwattr $C$DW$154, DW_AT_decl_column(0x12)
    2382                    
    2383                    $C$DW$155       .dwtag  DW_TAG_member
    2384                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$30)
    2385                            .dwattr $C$DW$155, DW_AT_name("TCR")
    2386                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("TCR")
    2387                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
    2388                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2389                            .dwattr $C$DW$155, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2390                            .dwattr $C$DW$155, DW_AT_decl_line(0x329)
    2391                            .dwattr $C$DW$155, DW_AT_decl_column(0x12)
    2392                    
    2393                    $C$DW$156       .dwtag  DW_TAG_member
    2394                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$53)
    2395                            .dwattr $C$DW$156, DW_AT_name("RESERVED3")
    2396                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("RESERVED3")
    2397                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
    2398                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2399                            .dwattr $C$DW$156, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2400                            .dwattr $C$DW$156, DW_AT_decl_line(0x32a)
    2401                            .dwattr $C$DW$156, DW_AT_decl_column(0x12)
    2402                    
    2403                    $C$DW$157       .dwtag  DW_TAG_member
    2404                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$30)
    2405                            .dwattr $C$DW$157, DW_AT_name("IWR")
    2406                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("IWR")
    2407                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
    2408                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2409                            .dwattr $C$DW$157, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   45

    2410                            .dwattr $C$DW$157, DW_AT_decl_line(0x32b)
    2411                            .dwattr $C$DW$157, DW_AT_decl_column(0x12)
    2412                    
    2413                    $C$DW$158       .dwtag  DW_TAG_member
    2414                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$39)
    2415                            .dwattr $C$DW$158, DW_AT_name("IRR")
    2416                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("IRR")
    2417                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
    2418                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2419                            .dwattr $C$DW$158, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2420                            .dwattr $C$DW$158, DW_AT_decl_line(0x32c)
    2421                            .dwattr $C$DW$158, DW_AT_decl_column(0x12)
    2422                    
    2423                    $C$DW$159       .dwtag  DW_TAG_member
    2424                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$30)
    2425                            .dwattr $C$DW$159, DW_AT_name("IMCR")
    2426                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("IMCR")
    2427                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
    2428                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2429                            .dwattr $C$DW$159, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2430                            .dwattr $C$DW$159, DW_AT_decl_line(0x32d)
    2431                            .dwattr $C$DW$159, DW_AT_decl_column(0x12)
    2432                    
    2433                    $C$DW$160       .dwtag  DW_TAG_member
    2434                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$54)
    2435                            .dwattr $C$DW$160, DW_AT_name("RESERVED4")
    2436                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("RESERVED4")
    2437                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
    2438                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2439                            .dwattr $C$DW$160, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2440                            .dwattr $C$DW$160, DW_AT_decl_line(0x32e)
    2441                            .dwattr $C$DW$160, DW_AT_decl_column(0x12)
    2442                    
    2443                    $C$DW$161       .dwtag  DW_TAG_member
    2444                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$30)
    2445                            .dwattr $C$DW$161, DW_AT_name("LAR")
    2446                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("LAR")
    2447                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
    2448                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2449                            .dwattr $C$DW$161, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2450                            .dwattr $C$DW$161, DW_AT_decl_line(0x32f)
    2451                            .dwattr $C$DW$161, DW_AT_decl_column(0x12)
    2452                    
    2453                    $C$DW$162       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$39)
    2455                            .dwattr $C$DW$162, DW_AT_name("LSR")
    2456                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("LSR")
    2457                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
    2458                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$162, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2460                            .dwattr $C$DW$162, DW_AT_decl_line(0x330)
    2461                            .dwattr $C$DW$162, DW_AT_decl_column(0x12)
    2462                    
    2463                    $C$DW$163       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$55)
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   46

    2465                            .dwattr $C$DW$163, DW_AT_name("RESERVED5")
    2466                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("RESERVED5")
    2467                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
    2468                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$163, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2470                            .dwattr $C$DW$163, DW_AT_decl_line(0x331)
    2471                            .dwattr $C$DW$163, DW_AT_decl_column(0x12)
    2472                    
    2473                    $C$DW$164       .dwtag  DW_TAG_member
    2474                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$39)
    2475                            .dwattr $C$DW$164, DW_AT_name("PID4")
    2476                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("PID4")
    2477                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
    2478                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2479                            .dwattr $C$DW$164, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2480                            .dwattr $C$DW$164, DW_AT_decl_line(0x332)
    2481                            .dwattr $C$DW$164, DW_AT_decl_column(0x12)
    2482                    
    2483                    $C$DW$165       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$39)
    2485                            .dwattr $C$DW$165, DW_AT_name("PID5")
    2486                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("PID5")
    2487                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
    2488                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$165, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2490                            .dwattr $C$DW$165, DW_AT_decl_line(0x333)
    2491                            .dwattr $C$DW$165, DW_AT_decl_column(0x12)
    2492                    
    2493                    $C$DW$166       .dwtag  DW_TAG_member
    2494                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$39)
    2495                            .dwattr $C$DW$166, DW_AT_name("PID6")
    2496                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("PID6")
    2497                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
    2498                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2499                            .dwattr $C$DW$166, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2500                            .dwattr $C$DW$166, DW_AT_decl_line(0x334)
    2501                            .dwattr $C$DW$166, DW_AT_decl_column(0x12)
    2502                    
    2503                    $C$DW$167       .dwtag  DW_TAG_member
    2504                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$39)
    2505                            .dwattr $C$DW$167, DW_AT_name("PID7")
    2506                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("PID7")
    2507                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
    2508                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$167, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2510                            .dwattr $C$DW$167, DW_AT_decl_line(0x335)
    2511                            .dwattr $C$DW$167, DW_AT_decl_column(0x12)
    2512                    
    2513                    $C$DW$168       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$39)
    2515                            .dwattr $C$DW$168, DW_AT_name("PID0")
    2516                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("PID0")
    2517                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
    2518                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$168, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Mon Apr  3 01:00:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3.asm                                                   PAGE   47

    2520                            .dwattr $C$DW$168, DW_AT_decl_line(0x336)
    2521                            .dwattr $C$DW$168, DW_AT_decl_column(0x12)
    2522                    
    2523                    $C$DW$169       .dwtag  DW_TAG_member
    2524                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$39)
    2525                            .dwattr $C$DW$169, DW_AT_name("PID1")
    2526                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("PID1")
    2527                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
    2528                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2529                            .dwattr $C$DW$169, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
