TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Fri Apr 28 21:57:24 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../joystick_draw3 (1).c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    2700 0000000c                   .sect   ".text:WDT_A_IRQHandler"
    2701                            .align  4
    2702 0000000c 02000804  ||$C$CON36||:   .bits   33556484,32
    2703                    ;******************************************************************************
    2704                    ;* CONSTANT TABLE                                                             *
    2705                    ;******************************************************************************
    2706 0000006a                   .sect   ".text:EUSCIA2_IRQHandler"
    2707                            .align  4
    2708 0000006a 180046C0  ||$C$CON37||:   .bits   1073747968,32
         0000006e 00004000 
    2709                            .align  4
    2710 0000006e 00004000! ||$C$CON38||:   .bits   receivedvalue,32
         00000072 00000000 
    2711                            .align  4
    2712 00000072 00000000! ||$C$CON39||:   .bits   receivedstate,32
         00000076 00000000 
    2713                            .align  4
    2714 00000076 00000000! ||$C$CON40||:   .bits   receivedy,32
         0000007a 00000000 
    2715                            .align  4
    2716 0000007a 00000000! ||$C$CON41||:   .bits   receivedx,32
         0000007e 00000000 
    2717                    ;******************************************************************************
    2718                    ;* CONSTANT TABLE                                                             *
    2719                    ;******************************************************************************
    2720 00000060                   .sect   ".text:ADC14_IRQHandler"
    2721                            .align  4
    2722 00000060 00000000! ||$C$CON42||:   .bits   resultsBuffer,32
    2723                            .align  4
    2724 00000064 00000000! ||$C$CON43||:   .bits   buttonPressed,32
    2725                            .align  4
    2726 00000068 40004C21  ||$C$CON44||:   .bits   1073761313,32
    2727                            .align  4
    2728 0000006c 00000000! ||$C$CON45||:   .bits   print_flag,32
    2729                    ;*****************************************************************************
    2730                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    2731                    ;*****************************************************************************
    2732                            .global CS_setDCOCenteredFrequency
    2733                            .global Graphics_fillCircle
    2734                            .global Graphics_initContext
    2735                            .global Graphics_drawString
    2736                            .global Graphics_setBackgroundColor
    2737                            .global Graphics_setFont
    2738                            .global Graphics_setForegroundColor
    2739                            .global Graphics_drawStringCentered
    2740                            .global Graphics_clearDisplay
    2741                            .global Crystalfontz128x128_Init
    2742                            .global Crystalfontz128x128_SetOrientation
    2743                            .global sprintf
    2744                            .global g_sFontFixed6x8
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   52

    2745                            .global g_sCrystalfontz128x128
    2746                            .global g_sCrystalfontz128x128_funcs
    2747                    
    2748                    ;******************************************************************************
    2749                    ;* BUILD ATTRIBUTES                                                           *
    2750                    ;******************************************************************************
    2751                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    2752                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    2753                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    2754                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    2755                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    2756                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
    2757                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
    2758                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    2759                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
    2760                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    2761                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    2762                    
    2763                    ;******************************************************************************
    2764                    ;* TYPE INFORMATION                                                           *
    2765                    ;******************************************************************************
    2766                    
    2767                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2768                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    2769                    $C$DW$163       .dwtag  DW_TAG_member
    2770                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2771                            .dwattr $C$DW$163, DW_AT_name("_reserved0")
    2772                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("_reserved0")
    2773                            .dwattr $C$DW$163, DW_AT_bit_offset(0x10)
    2774                            .dwattr $C$DW$163, DW_AT_bit_size(0x10)
    2775                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2777                            .dwattr $C$DW$163, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2778                            .dwattr $C$DW$163, DW_AT_decl_line(0x138)
    2779                            .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    2780                    
    2781                    $C$DW$164       .dwtag  DW_TAG_member
    2782                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2783                            .dwattr $C$DW$164, DW_AT_name("GE")
    2784                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("GE")
    2785                            .dwattr $C$DW$164, DW_AT_bit_offset(0x0c)
    2786                            .dwattr $C$DW$164, DW_AT_bit_size(0x04)
    2787                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2788                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2789                            .dwattr $C$DW$164, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2790                            .dwattr $C$DW$164, DW_AT_decl_line(0x139)
    2791                            .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    2792                    
    2793                    $C$DW$165       .dwtag  DW_TAG_member
    2794                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2795                            .dwattr $C$DW$165, DW_AT_name("_reserved1")
    2796                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("_reserved1")
    2797                            .dwattr $C$DW$165, DW_AT_bit_offset(0x05)
    2798                            .dwattr $C$DW$165, DW_AT_bit_size(0x07)
    2799                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   53

    2800                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2801                            .dwattr $C$DW$165, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2802                            .dwattr $C$DW$165, DW_AT_decl_line(0x13a)
    2803                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2804                    
    2805                    $C$DW$166       .dwtag  DW_TAG_member
    2806                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2807                            .dwattr $C$DW$166, DW_AT_name("Q")
    2808                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("Q")
    2809                            .dwattr $C$DW$166, DW_AT_bit_offset(0x04)
    2810                            .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2811                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2813                            .dwattr $C$DW$166, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2814                            .dwattr $C$DW$166, DW_AT_decl_line(0x13b)
    2815                            .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    2816                    
    2817                    $C$DW$167       .dwtag  DW_TAG_member
    2818                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2819                            .dwattr $C$DW$167, DW_AT_name("V")
    2820                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("V")
    2821                            .dwattr $C$DW$167, DW_AT_bit_offset(0x03)
    2822                            .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2823                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$167, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2826                            .dwattr $C$DW$167, DW_AT_decl_line(0x13c)
    2827                            .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    2828                    
    2829                    $C$DW$168       .dwtag  DW_TAG_member
    2830                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2831                            .dwattr $C$DW$168, DW_AT_name("C")
    2832                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("C")
    2833                            .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    2834                            .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2835                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2837                            .dwattr $C$DW$168, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2838                            .dwattr $C$DW$168, DW_AT_decl_line(0x13d)
    2839                            .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    2840                    
    2841                    $C$DW$169       .dwtag  DW_TAG_member
    2842                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2843                            .dwattr $C$DW$169, DW_AT_name("Z")
    2844                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("Z")
    2845                            .dwattr $C$DW$169, DW_AT_bit_offset(0x01)
    2846                            .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2847                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2848                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2849                            .dwattr $C$DW$169, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2850                            .dwattr $C$DW$169, DW_AT_decl_line(0x13e)
    2851                            .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    2852                    
    2853                    $C$DW$170       .dwtag  DW_TAG_member
    2854                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   54

    2855                            .dwattr $C$DW$170, DW_AT_name("N")
    2856                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("N")
    2857                            .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2858                            .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2859                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2861                            .dwattr $C$DW$170, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2862                            .dwattr $C$DW$170, DW_AT_decl_line(0x13f)
    2863                            .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    2864                    
    2865                            .dwattr $C$DW$T$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2866                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x137)
    2867                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x03)
    2868                            .dwendtag $C$DW$T$20
    2869                    
    2870                    
    2871                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2872                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    2873                    $C$DW$171       .dwtag  DW_TAG_member
    2874                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2875                            .dwattr $C$DW$171, DW_AT_name("ISR")
    2876                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ISR")
    2877                            .dwattr $C$DW$171, DW_AT_bit_offset(0x17)
    2878                            .dwattr $C$DW$171, DW_AT_bit_size(0x09)
    2879                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2880                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2881                            .dwattr $C$DW$171, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2882                            .dwattr $C$DW$171, DW_AT_decl_line(0x15f)
    2883                            .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    2884                    
    2885                    $C$DW$172       .dwtag  DW_TAG_member
    2886                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2887                            .dwattr $C$DW$172, DW_AT_name("_reserved0")
    2888                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("_reserved0")
    2889                            .dwattr $C$DW$172, DW_AT_bit_offset(0x00)
    2890                            .dwattr $C$DW$172, DW_AT_bit_size(0x17)
    2891                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2892                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2893                            .dwattr $C$DW$172, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2894                            .dwattr $C$DW$172, DW_AT_decl_line(0x160)
    2895                            .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    2896                    
    2897                            .dwattr $C$DW$T$21, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2898                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x15e)
    2899                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x03)
    2900                            .dwendtag $C$DW$T$21
    2901                    
    2902                    
    2903                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2904                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    2905                    $C$DW$173       .dwtag  DW_TAG_member
    2906                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2907                            .dwattr $C$DW$173, DW_AT_name("ISR")
    2908                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ISR")
    2909                            .dwattr $C$DW$173, DW_AT_bit_offset(0x17)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   55

    2910                            .dwattr $C$DW$173, DW_AT_bit_size(0x09)
    2911                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2912                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2913                            .dwattr $C$DW$173, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2914                            .dwattr $C$DW$173, DW_AT_decl_line(0x171)
    2915                            .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    2916                    
    2917                    $C$DW$174       .dwtag  DW_TAG_member
    2918                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2919                            .dwattr $C$DW$174, DW_AT_name("_reserved0")
    2920                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("_reserved0")
    2921                            .dwattr $C$DW$174, DW_AT_bit_offset(0x10)
    2922                            .dwattr $C$DW$174, DW_AT_bit_size(0x07)
    2923                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2924                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2925                            .dwattr $C$DW$174, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2926                            .dwattr $C$DW$174, DW_AT_decl_line(0x172)
    2927                            .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    2928                    
    2929                    $C$DW$175       .dwtag  DW_TAG_member
    2930                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2931                            .dwattr $C$DW$175, DW_AT_name("GE")
    2932                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("GE")
    2933                            .dwattr $C$DW$175, DW_AT_bit_offset(0x0c)
    2934                            .dwattr $C$DW$175, DW_AT_bit_size(0x04)
    2935                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2937                            .dwattr $C$DW$175, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2938                            .dwattr $C$DW$175, DW_AT_decl_line(0x173)
    2939                            .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    2940                    
    2941                    $C$DW$176       .dwtag  DW_TAG_member
    2942                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2943                            .dwattr $C$DW$176, DW_AT_name("_reserved1")
    2944                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("_reserved1")
    2945                            .dwattr $C$DW$176, DW_AT_bit_offset(0x08)
    2946                            .dwattr $C$DW$176, DW_AT_bit_size(0x04)
    2947                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2948                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2949                            .dwattr $C$DW$176, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2950                            .dwattr $C$DW$176, DW_AT_decl_line(0x174)
    2951                            .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    2952                    
    2953                    $C$DW$177       .dwtag  DW_TAG_member
    2954                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2955                            .dwattr $C$DW$177, DW_AT_name("T")
    2956                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("T")
    2957                            .dwattr $C$DW$177, DW_AT_bit_offset(0x07)
    2958                            .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2959                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2960                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2961                            .dwattr $C$DW$177, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2962                            .dwattr $C$DW$177, DW_AT_decl_line(0x175)
    2963                            .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    2964                    
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   56

    2965                    $C$DW$178       .dwtag  DW_TAG_member
    2966                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2967                            .dwattr $C$DW$178, DW_AT_name("IT")
    2968                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("IT")
    2969                            .dwattr $C$DW$178, DW_AT_bit_offset(0x05)
    2970                            .dwattr $C$DW$178, DW_AT_bit_size(0x02)
    2971                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2972                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2973                            .dwattr $C$DW$178, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2974                            .dwattr $C$DW$178, DW_AT_decl_line(0x176)
    2975                            .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2976                    
    2977                    $C$DW$179       .dwtag  DW_TAG_member
    2978                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2979                            .dwattr $C$DW$179, DW_AT_name("Q")
    2980                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("Q")
    2981                            .dwattr $C$DW$179, DW_AT_bit_offset(0x04)
    2982                            .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2983                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2984                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2985                            .dwattr $C$DW$179, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2986                            .dwattr $C$DW$179, DW_AT_decl_line(0x177)
    2987                            .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    2988                    
    2989                    $C$DW$180       .dwtag  DW_TAG_member
    2990                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2991                            .dwattr $C$DW$180, DW_AT_name("V")
    2992                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("V")
    2993                            .dwattr $C$DW$180, DW_AT_bit_offset(0x03)
    2994                            .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2995                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2996                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2997                            .dwattr $C$DW$180, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2998                            .dwattr $C$DW$180, DW_AT_decl_line(0x178)
    2999                            .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    3000                    
    3001                    $C$DW$181       .dwtag  DW_TAG_member
    3002                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3003                            .dwattr $C$DW$181, DW_AT_name("C")
    3004                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("C")
    3005                            .dwattr $C$DW$181, DW_AT_bit_offset(0x02)
    3006                            .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    3007                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3008                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3009                            .dwattr $C$DW$181, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3010                            .dwattr $C$DW$181, DW_AT_decl_line(0x179)
    3011                            .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    3012                    
    3013                    $C$DW$182       .dwtag  DW_TAG_member
    3014                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3015                            .dwattr $C$DW$182, DW_AT_name("Z")
    3016                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("Z")
    3017                            .dwattr $C$DW$182, DW_AT_bit_offset(0x01)
    3018                            .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    3019                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   57

    3020                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3021                            .dwattr $C$DW$182, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3022                            .dwattr $C$DW$182, DW_AT_decl_line(0x17a)
    3023                            .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    3024                    
    3025                    $C$DW$183       .dwtag  DW_TAG_member
    3026                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3027                            .dwattr $C$DW$183, DW_AT_name("N")
    3028                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("N")
    3029                            .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    3030                            .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    3031                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3033                            .dwattr $C$DW$183, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3034                            .dwattr $C$DW$183, DW_AT_decl_line(0x17b)
    3035                            .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    3036                    
    3037                            .dwattr $C$DW$T$22, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3038                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x170)
    3039                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x03)
    3040                            .dwendtag $C$DW$T$22
    3041                    
    3042                    
    3043                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3044                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    3045                    $C$DW$184       .dwtag  DW_TAG_member
    3046                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3047                            .dwattr $C$DW$184, DW_AT_name("nPRIV")
    3048                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("nPRIV")
    3049                            .dwattr $C$DW$184, DW_AT_bit_offset(0x1f)
    3050                            .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    3051                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3052                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3053                            .dwattr $C$DW$184, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3054                            .dwattr $C$DW$184, DW_AT_decl_line(0x1a4)
    3055                            .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    3056                    
    3057                    $C$DW$185       .dwtag  DW_TAG_member
    3058                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3059                            .dwattr $C$DW$185, DW_AT_name("SPSEL")
    3060                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("SPSEL")
    3061                            .dwattr $C$DW$185, DW_AT_bit_offset(0x1e)
    3062                            .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    3063                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3064                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3065                            .dwattr $C$DW$185, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3066                            .dwattr $C$DW$185, DW_AT_decl_line(0x1a5)
    3067                            .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    3068                    
    3069                    $C$DW$186       .dwtag  DW_TAG_member
    3070                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3071                            .dwattr $C$DW$186, DW_AT_name("FPCA")
    3072                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("FPCA")
    3073                            .dwattr $C$DW$186, DW_AT_bit_offset(0x1d)
    3074                            .dwattr $C$DW$186, DW_AT_bit_size(0x01)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   58

    3075                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3076                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3077                            .dwattr $C$DW$186, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3078                            .dwattr $C$DW$186, DW_AT_decl_line(0x1a6)
    3079                            .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    3080                    
    3081                    $C$DW$187       .dwtag  DW_TAG_member
    3082                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3083                            .dwattr $C$DW$187, DW_AT_name("_reserved0")
    3084                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("_reserved0")
    3085                            .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3086                            .dwattr $C$DW$187, DW_AT_bit_size(0x1d)
    3087                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3088                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3089                            .dwattr $C$DW$187, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3090                            .dwattr $C$DW$187, DW_AT_decl_line(0x1a7)
    3091                            .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    3092                    
    3093                            .dwattr $C$DW$T$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3094                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x1a3)
    3095                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    3096                            .dwendtag $C$DW$T$23
    3097                    
    3098                    
    3099                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3100                            .dwattr $C$DW$T$32, DW_AT_byte_size(0xe04)
    3101                    $C$DW$188       .dwtag  DW_TAG_member
    3102                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$25)
    3103                            .dwattr $C$DW$188, DW_AT_name("ISER")
    3104                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ISER")
    3105                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3106                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3107                            .dwattr $C$DW$188, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3108                            .dwattr $C$DW$188, DW_AT_decl_line(0x1c5)
    3109                            .dwattr $C$DW$188, DW_AT_decl_column(0x12)
    3110                    
    3111                    $C$DW$189       .dwtag  DW_TAG_member
    3112                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$26)
    3113                            .dwattr $C$DW$189, DW_AT_name("RESERVED0")
    3114                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("RESERVED0")
    3115                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3116                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3117                            .dwattr $C$DW$189, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3118                            .dwattr $C$DW$189, DW_AT_decl_line(0x1c6)
    3119                            .dwattr $C$DW$189, DW_AT_decl_column(0x12)
    3120                    
    3121                    $C$DW$190       .dwtag  DW_TAG_member
    3122                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$25)
    3123                            .dwattr $C$DW$190, DW_AT_name("ICER")
    3124                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ICER")
    3125                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3126                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3127                            .dwattr $C$DW$190, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3128                            .dwattr $C$DW$190, DW_AT_decl_line(0x1c7)
    3129                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   59

    3130                    
    3131                    $C$DW$191       .dwtag  DW_TAG_member
    3132                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$26)
    3133                            .dwattr $C$DW$191, DW_AT_name("RSERVED1")
    3134                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("RSERVED1")
    3135                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3136                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3137                            .dwattr $C$DW$191, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3138                            .dwattr $C$DW$191, DW_AT_decl_line(0x1c8)
    3139                            .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    3140                    
    3141                    $C$DW$192       .dwtag  DW_TAG_member
    3142                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$25)
    3143                            .dwattr $C$DW$192, DW_AT_name("ISPR")
    3144                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("ISPR")
    3145                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3146                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$192, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3148                            .dwattr $C$DW$192, DW_AT_decl_line(0x1c9)
    3149                            .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    3150                    
    3151                    $C$DW$193       .dwtag  DW_TAG_member
    3152                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$26)
    3153                            .dwattr $C$DW$193, DW_AT_name("RESERVED2")
    3154                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("RESERVED2")
    3155                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3156                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3157                            .dwattr $C$DW$193, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3158                            .dwattr $C$DW$193, DW_AT_decl_line(0x1ca)
    3159                            .dwattr $C$DW$193, DW_AT_decl_column(0x12)
    3160                    
    3161                    $C$DW$194       .dwtag  DW_TAG_member
    3162                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$25)
    3163                            .dwattr $C$DW$194, DW_AT_name("ICPR")
    3164                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("ICPR")
    3165                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    3166                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3167                            .dwattr $C$DW$194, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3168                            .dwattr $C$DW$194, DW_AT_decl_line(0x1cb)
    3169                            .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    3170                    
    3171                    $C$DW$195       .dwtag  DW_TAG_member
    3172                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$26)
    3173                            .dwattr $C$DW$195, DW_AT_name("RESERVED3")
    3174                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("RESERVED3")
    3175                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    3176                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3177                            .dwattr $C$DW$195, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3178                            .dwattr $C$DW$195, DW_AT_decl_line(0x1cc)
    3179                            .dwattr $C$DW$195, DW_AT_decl_column(0x12)
    3180                    
    3181                    $C$DW$196       .dwtag  DW_TAG_member
    3182                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$25)
    3183                            .dwattr $C$DW$196, DW_AT_name("IABR")
    3184                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("IABR")
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   60

    3185                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    3186                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3187                            .dwattr $C$DW$196, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3188                            .dwattr $C$DW$196, DW_AT_decl_line(0x1cd)
    3189                            .dwattr $C$DW$196, DW_AT_decl_column(0x12)
    3190                    
    3191                    $C$DW$197       .dwtag  DW_TAG_member
    3192                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3193                            .dwattr $C$DW$197, DW_AT_name("RESERVED4")
    3194                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("RESERVED4")
    3195                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    3196                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3197                            .dwattr $C$DW$197, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3198                            .dwattr $C$DW$197, DW_AT_decl_line(0x1ce)
    3199                            .dwattr $C$DW$197, DW_AT_decl_column(0x12)
    3200                    
    3201                    $C$DW$198       .dwtag  DW_TAG_member
    3202                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$30)
    3203                            .dwattr $C$DW$198, DW_AT_name("IP")
    3204                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("IP")
    3205                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    3206                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3207                            .dwattr $C$DW$198, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3208                            .dwattr $C$DW$198, DW_AT_decl_line(0x1cf)
    3209                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    3210                    
    3211                    $C$DW$199       .dwtag  DW_TAG_member
    3212                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$31)
    3213                            .dwattr $C$DW$199, DW_AT_name("RESERVED5")
    3214                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("RESERVED5")
    3215                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    3216                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3217                            .dwattr $C$DW$199, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3218                            .dwattr $C$DW$199, DW_AT_decl_line(0x1d0)
    3219                            .dwattr $C$DW$199, DW_AT_decl_column(0x12)
    3220                    
    3221                    $C$DW$200       .dwtag  DW_TAG_member
    3222                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$24)
    3223                            .dwattr $C$DW$200, DW_AT_name("STIR")
    3224                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("STIR")
    3225                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    3226                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3227                            .dwattr $C$DW$200, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3228                            .dwattr $C$DW$200, DW_AT_decl_line(0x1d1)
    3229                            .dwattr $C$DW$200, DW_AT_decl_column(0x12)
    3230                    
    3231                            .dwattr $C$DW$T$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3232                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x1c4)
    3233                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    3234                            .dwendtag $C$DW$T$32
    3235                    
    3236                    $C$DW$T$242     .dwtag  DW_TAG_typedef
    3237                            .dwattr $C$DW$T$242, DW_AT_name("NVIC_Type")
    3238                            .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$32)
    3239                            .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   61

    3240                            .dwattr $C$DW$T$242, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    3241                            .dwattr $C$DW$T$242, DW_AT_decl_line(0x1d2)
    3242                            .dwattr $C$DW$T$242, DW_AT_decl_column(0x04)
    3243                    
    3244                    
    3245                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3246                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x8c)
    3247                    $C$DW$201       .dwtag  DW_TAG_member
    3248                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$33)
    3249                            .dwattr $C$DW$201, DW_AT_name("CPUID")
    3250                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("CPUID")
    3251                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3252                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3253                            .dwattr $C$DW$201, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3254                            .dwattr $C$DW$201, DW_AT_decl_line(0x1e7)
    3255                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
    3256                    
    3257                    $C$DW$202       .dwtag  DW_TAG_member
    3258                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$24)
    3259                            .dwattr $C$DW$202, DW_AT_name("ICSR")
    3260                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ICSR")
    3261                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3262                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3263                            .dwattr $C$DW$202, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3264                            .dwattr $C$DW$202, DW_AT_decl_line(0x1e8)
    3265                            .dwattr $C$DW$202, DW_AT_decl_column(0x12)
    3266                    
    3267                    $C$DW$203       .dwtag  DW_TAG_member
    3268                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$24)
    3269                            .dwattr $C$DW$203, DW_AT_name("VTOR")
    3270                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("VTOR")
    3271                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3272                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3273                            .dwattr $C$DW$203, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3274                            .dwattr $C$DW$203, DW_AT_decl_line(0x1e9)
    3275                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    3276                    
    3277                    $C$DW$204       .dwtag  DW_TAG_member
    3278                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$24)
    3279                            .dwattr $C$DW$204, DW_AT_name("AIRCR")
    3280                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("AIRCR")
    3281                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3282                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3283                            .dwattr $C$DW$204, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3284                            .dwattr $C$DW$204, DW_AT_decl_line(0x1ea)
    3285                            .dwattr $C$DW$204, DW_AT_decl_column(0x12)
    3286                    
    3287                    $C$DW$205       .dwtag  DW_TAG_member
    3288                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$24)
    3289                            .dwattr $C$DW$205, DW_AT_name("SCR")
    3290                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("SCR")
    3291                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3292                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3293                            .dwattr $C$DW$205, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3294                            .dwattr $C$DW$205, DW_AT_decl_line(0x1eb)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   62

    3295                            .dwattr $C$DW$205, DW_AT_decl_column(0x12)
    3296                    
    3297                    $C$DW$206       .dwtag  DW_TAG_member
    3298                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$24)
    3299                            .dwattr $C$DW$206, DW_AT_name("CCR")
    3300                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("CCR")
    3301                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3302                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3303                            .dwattr $C$DW$206, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3304                            .dwattr $C$DW$206, DW_AT_decl_line(0x1ec)
    3305                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    3306                    
    3307                    $C$DW$207       .dwtag  DW_TAG_member
    3308                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$34)
    3309                            .dwattr $C$DW$207, DW_AT_name("SHP")
    3310                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("SHP")
    3311                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3312                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3313                            .dwattr $C$DW$207, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3314                            .dwattr $C$DW$207, DW_AT_decl_line(0x1ed)
    3315                            .dwattr $C$DW$207, DW_AT_decl_column(0x12)
    3316                    
    3317                    $C$DW$208       .dwtag  DW_TAG_member
    3318                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    3319                            .dwattr $C$DW$208, DW_AT_name("SHCSR")
    3320                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("SHCSR")
    3321                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3322                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3323                            .dwattr $C$DW$208, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3324                            .dwattr $C$DW$208, DW_AT_decl_line(0x1ee)
    3325                            .dwattr $C$DW$208, DW_AT_decl_column(0x12)
    3326                    
    3327                    $C$DW$209       .dwtag  DW_TAG_member
    3328                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$24)
    3329                            .dwattr $C$DW$209, DW_AT_name("CFSR")
    3330                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("CFSR")
    3331                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3332                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3333                            .dwattr $C$DW$209, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3334                            .dwattr $C$DW$209, DW_AT_decl_line(0x1ef)
    3335                            .dwattr $C$DW$209, DW_AT_decl_column(0x12)
    3336                    
    3337                    $C$DW$210       .dwtag  DW_TAG_member
    3338                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$24)
    3339                            .dwattr $C$DW$210, DW_AT_name("HFSR")
    3340                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("HFSR")
    3341                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3342                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3343                            .dwattr $C$DW$210, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3344                            .dwattr $C$DW$210, DW_AT_decl_line(0x1f0)
    3345                            .dwattr $C$DW$210, DW_AT_decl_column(0x12)
    3346                    
    3347                    $C$DW$211       .dwtag  DW_TAG_member
    3348                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$24)
    3349                            .dwattr $C$DW$211, DW_AT_name("DFSR")
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   63

    3350                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("DFSR")
    3351                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3352                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3353                            .dwattr $C$DW$211, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3354                            .dwattr $C$DW$211, DW_AT_decl_line(0x1f1)
    3355                            .dwattr $C$DW$211, DW_AT_decl_column(0x12)
    3356                    
    3357                    $C$DW$212       .dwtag  DW_TAG_member
    3358                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$24)
    3359                            .dwattr $C$DW$212, DW_AT_name("MMFAR")
    3360                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("MMFAR")
    3361                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3362                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3363                            .dwattr $C$DW$212, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3364                            .dwattr $C$DW$212, DW_AT_decl_line(0x1f2)
    3365                            .dwattr $C$DW$212, DW_AT_decl_column(0x12)
    3366                    
    3367                    $C$DW$213       .dwtag  DW_TAG_member
    3368                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$24)
    3369                            .dwattr $C$DW$213, DW_AT_name("BFAR")
    3370                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("BFAR")
    3371                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3372                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3373                            .dwattr $C$DW$213, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3374                            .dwattr $C$DW$213, DW_AT_decl_line(0x1f3)
    3375                            .dwattr $C$DW$213, DW_AT_decl_column(0x12)
    3376                    
    3377                    $C$DW$214       .dwtag  DW_TAG_member
    3378                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$24)
    3379                            .dwattr $C$DW$214, DW_AT_name("AFSR")
    3380                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("AFSR")
    3381                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3382                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3383                            .dwattr $C$DW$214, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3384                            .dwattr $C$DW$214, DW_AT_decl_line(0x1f4)
    3385                            .dwattr $C$DW$214, DW_AT_decl_column(0x12)
    3386                    
    3387                    $C$DW$215       .dwtag  DW_TAG_member
    3388                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$35)
    3389                            .dwattr $C$DW$215, DW_AT_name("PFR")
    3390                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("PFR")
    3391                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3392                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3393                            .dwattr $C$DW$215, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3394                            .dwattr $C$DW$215, DW_AT_decl_line(0x1f5)
    3395                            .dwattr $C$DW$215, DW_AT_decl_column(0x12)
    3396                    
    3397                    $C$DW$216       .dwtag  DW_TAG_member
    3398                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$33)
    3399                            .dwattr $C$DW$216, DW_AT_name("DFR")
    3400                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("DFR")
    3401                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3402                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3403                            .dwattr $C$DW$216, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3404                            .dwattr $C$DW$216, DW_AT_decl_line(0x1f6)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   64

    3405                            .dwattr $C$DW$216, DW_AT_decl_column(0x12)
    3406                    
    3407                    $C$DW$217       .dwtag  DW_TAG_member
    3408                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$33)
    3409                            .dwattr $C$DW$217, DW_AT_name("ADR")
    3410                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("ADR")
    3411                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3412                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3413                            .dwattr $C$DW$217, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3414                            .dwattr $C$DW$217, DW_AT_decl_line(0x1f7)
    3415                            .dwattr $C$DW$217, DW_AT_decl_column(0x12)
    3416                    
    3417                    $C$DW$218       .dwtag  DW_TAG_member
    3418                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$36)
    3419                            .dwattr $C$DW$218, DW_AT_name("MMFR")
    3420                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("MMFR")
    3421                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3422                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3423                            .dwattr $C$DW$218, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3424                            .dwattr $C$DW$218, DW_AT_decl_line(0x1f8)
    3425                            .dwattr $C$DW$218, DW_AT_decl_column(0x12)
    3426                    
    3427                    $C$DW$219       .dwtag  DW_TAG_member
    3428                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$37)
    3429                            .dwattr $C$DW$219, DW_AT_name("ISAR")
    3430                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("ISAR")
    3431                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3432                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3433                            .dwattr $C$DW$219, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3434                            .dwattr $C$DW$219, DW_AT_decl_line(0x1f9)
    3435                            .dwattr $C$DW$219, DW_AT_decl_column(0x12)
    3436                    
    3437                    $C$DW$220       .dwtag  DW_TAG_member
    3438                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$38)
    3439                            .dwattr $C$DW$220, DW_AT_name("RESERVED0")
    3440                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("RESERVED0")
    3441                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3442                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3443                            .dwattr $C$DW$220, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3444                            .dwattr $C$DW$220, DW_AT_decl_line(0x1fa)
    3445                            .dwattr $C$DW$220, DW_AT_decl_column(0x12)
    3446                    
    3447                    $C$DW$221       .dwtag  DW_TAG_member
    3448                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$24)
    3449                            .dwattr $C$DW$221, DW_AT_name("CPACR")
    3450                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("CPACR")
    3451                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3452                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3453                            .dwattr $C$DW$221, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3454                            .dwattr $C$DW$221, DW_AT_decl_line(0x1fb)
    3455                            .dwattr $C$DW$221, DW_AT_decl_column(0x12)
    3456                    
    3457                            .dwattr $C$DW$T$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3458                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1e6)
    3459                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   65

    3460                            .dwendtag $C$DW$T$39
    3461                    
    3462                    $C$DW$T$243     .dwtag  DW_TAG_typedef
    3463                            .dwattr $C$DW$T$243, DW_AT_name("SCB_Type")
    3464                            .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$39)
    3465                            .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    3466                            .dwattr $C$DW$T$243, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    3467                            .dwattr $C$DW$T$243, DW_AT_decl_line(0x1fc)
    3468                            .dwattr $C$DW$T$243, DW_AT_decl_column(0x03)
    3469                    
    3470                    
    3471                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3472                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    3473                    $C$DW$222       .dwtag  DW_TAG_member
    3474                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$40)
    3475                            .dwattr $C$DW$222, DW_AT_name("RESERVED0")
    3476                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("RESERVED0")
    3477                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3478                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3479                            .dwattr $C$DW$222, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3480                            .dwattr $C$DW$222, DW_AT_decl_line(0x2c2)
    3481                            .dwattr $C$DW$222, DW_AT_decl_column(0x12)
    3482                    
    3483                    $C$DW$223       .dwtag  DW_TAG_member
    3484                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$33)
    3485                            .dwattr $C$DW$223, DW_AT_name("ICTR")
    3486                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("ICTR")
    3487                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3488                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3489                            .dwattr $C$DW$223, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3490                            .dwattr $C$DW$223, DW_AT_decl_line(0x2c3)
    3491                            .dwattr $C$DW$223, DW_AT_decl_column(0x12)
    3492                    
    3493                    $C$DW$224       .dwtag  DW_TAG_member
    3494                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$24)
    3495                            .dwattr $C$DW$224, DW_AT_name("ACTLR")
    3496                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("ACTLR")
    3497                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3498                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$224, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3500                            .dwattr $C$DW$224, DW_AT_decl_line(0x2c4)
    3501                            .dwattr $C$DW$224, DW_AT_decl_column(0x12)
    3502                    
    3503                            .dwattr $C$DW$T$41, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3504                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2c1)
    3505                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    3506                            .dwendtag $C$DW$T$41
    3507                    
    3508                    $C$DW$T$244     .dwtag  DW_TAG_typedef
    3509                            .dwattr $C$DW$T$244, DW_AT_name("SCnSCB_Type")
    3510                            .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$41)
    3511                            .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    3512                            .dwattr $C$DW$T$244, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    3513                            .dwattr $C$DW$T$244, DW_AT_decl_line(0x2c5)
    3514                            .dwattr $C$DW$T$244, DW_AT_decl_column(0x03)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   66

    3515                    
    3516                    
    3517                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3518                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x10)
    3519                    $C$DW$225       .dwtag  DW_TAG_member
    3520                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$24)
    3521                            .dwattr $C$DW$225, DW_AT_name("CTRL")
    3522                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("CTRL")
    3523                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3525                            .dwattr $C$DW$225, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3526                            .dwattr $C$DW$225, DW_AT_decl_line(0x2ea)
    3527                            .dwattr $C$DW$225, DW_AT_decl_column(0x12)
    3528                    
    3529                    $C$DW$226       .dwtag  DW_TAG_member
    3530                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$24)
    3531                            .dwattr $C$DW$226, DW_AT_name("LOAD")
    3532                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("LOAD")
    3533                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3534                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3535                            .dwattr $C$DW$226, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3536                            .dwattr $C$DW$226, DW_AT_decl_line(0x2eb)
    3537                            .dwattr $C$DW$226, DW_AT_decl_column(0x12)
    3538                    
    3539                    $C$DW$227       .dwtag  DW_TAG_member
    3540                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$24)
    3541                            .dwattr $C$DW$227, DW_AT_name("VAL")
    3542                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("VAL")
    3543                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3544                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3545                            .dwattr $C$DW$227, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3546                            .dwattr $C$DW$227, DW_AT_decl_line(0x2ec)
    3547                            .dwattr $C$DW$227, DW_AT_decl_column(0x12)
    3548                    
    3549                    $C$DW$228       .dwtag  DW_TAG_member
    3550                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$33)
    3551                            .dwattr $C$DW$228, DW_AT_name("CALIB")
    3552                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("CALIB")
    3553                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3554                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3555                            .dwattr $C$DW$228, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3556                            .dwattr $C$DW$228, DW_AT_decl_line(0x2ed)
    3557                            .dwattr $C$DW$228, DW_AT_decl_column(0x12)
    3558                    
    3559                            .dwattr $C$DW$T$42, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3560                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2e9)
    3561                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    3562                            .dwendtag $C$DW$T$42
    3563                    
    3564                    $C$DW$T$245     .dwtag  DW_TAG_typedef
    3565                            .dwattr $C$DW$T$245, DW_AT_name("SysTick_Type")
    3566                            .dwattr $C$DW$T$245, DW_AT_type(*$C$DW$T$42)
    3567                            .dwattr $C$DW$T$245, DW_AT_language(DW_LANG_C)
    3568                            .dwattr $C$DW$T$245, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    3569                            .dwattr $C$DW$T$245, DW_AT_decl_line(0x2ee)
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   67

    3570                            .dwattr $C$DW$T$245, DW_AT_decl_column(0x03)
    3571                    
    3572                    
    3573                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3574                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x1000)
    3575                    $C$DW$229       .dwtag  DW_TAG_member
    3576                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$44)
    3577                            .dwattr $C$DW$229, DW_AT_name("PORT")
    3578                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("PORT")
    3579                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3580                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3581                            .dwattr $C$DW$229, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3582                            .dwattr $C$DW$229, DW_AT_decl_line(0x323)
    3583                            .dwattr $C$DW$229, DW_AT_decl_column(0x06)
    3584                    
    3585                    $C$DW$230       .dwtag  DW_TAG_member
    3586                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$45)
    3587                            .dwattr $C$DW$230, DW_AT_name("RESERVED0")
    3588                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("RESERVED0")
    3589                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3590                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3591                            .dwattr $C$DW$230, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3592                            .dwattr $C$DW$230, DW_AT_decl_line(0x324)
    3593                            .dwattr $C$DW$230, DW_AT_decl_column(0x12)
    3594                    
    3595                    $C$DW$231       .dwtag  DW_TAG_member
    3596                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$24)
    3597                            .dwattr $C$DW$231, DW_AT_name("TER")
    3598                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("TER")
    3599                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    3600                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3601                            .dwattr $C$DW$231, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3602                            .dwattr $C$DW$231, DW_AT_decl_line(0x325)
    3603                            .dwattr $C$DW$231, DW_AT_decl_column(0x12)
    3604                    
    3605                    $C$DW$232       .dwtag  DW_TAG_member
    3606                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$46)
    3607                            .dwattr $C$DW$232, DW_AT_name("RESERVED1")
    3608                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("RESERVED1")
    3609                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
    3610                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3611                            .dwattr $C$DW$232, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3612                            .dwattr $C$DW$232, DW_AT_decl_line(0x326)
    3613                            .dwattr $C$DW$232, DW_AT_decl_column(0x12)
    3614                    
    3615                    $C$DW$233       .dwtag  DW_TAG_member
    3616                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$24)
    3617                            .dwattr $C$DW$233, DW_AT_name("TPR")
    3618                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("TPR")
    3619                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
    3620                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3621                            .dwattr $C$DW$233, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3622                            .dwattr $C$DW$233, DW_AT_decl_line(0x327)
    3623                            .dwattr $C$DW$233, DW_AT_decl_column(0x12)
    3624                    
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   68

    3625                    $C$DW$234       .dwtag  DW_TAG_member
    3626                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$46)
    3627                            .dwattr $C$DW$234, DW_AT_name("RESERVED2")
    3628                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("RESERVED2")
    3629                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
    3630                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3631                            .dwattr $C$DW$234, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3632                            .dwattr $C$DW$234, DW_AT_decl_line(0x328)
    3633                            .dwattr $C$DW$234, DW_AT_decl_column(0x12)
    3634                    
    3635                    $C$DW$235       .dwtag  DW_TAG_member
    3636                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$24)
    3637                            .dwattr $C$DW$235, DW_AT_name("TCR")
    3638                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("TCR")
    3639                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
    3640                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3641                            .dwattr $C$DW$235, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3642                            .dwattr $C$DW$235, DW_AT_decl_line(0x329)
    3643                            .dwattr $C$DW$235, DW_AT_decl_column(0x12)
    3644                    
    3645                    $C$DW$236       .dwtag  DW_TAG_member
    3646                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$47)
    3647                            .dwattr $C$DW$236, DW_AT_name("RESERVED3")
    3648                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("RESERVED3")
    3649                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
    3650                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3651                            .dwattr $C$DW$236, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3652                            .dwattr $C$DW$236, DW_AT_decl_line(0x32a)
    3653                            .dwattr $C$DW$236, DW_AT_decl_column(0x12)
    3654                    
    3655                    $C$DW$237       .dwtag  DW_TAG_member
    3656                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$24)
    3657                            .dwattr $C$DW$237, DW_AT_name("IWR")
    3658                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("IWR")
    3659                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
    3660                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3661                            .dwattr $C$DW$237, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3662                            .dwattr $C$DW$237, DW_AT_decl_line(0x32b)
    3663                            .dwattr $C$DW$237, DW_AT_decl_column(0x12)
    3664                    
    3665                    $C$DW$238       .dwtag  DW_TAG_member
    3666                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$33)
    3667                            .dwattr $C$DW$238, DW_AT_name("IRR")
    3668                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("IRR")
    3669                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
    3670                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3671                            .dwattr $C$DW$238, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3672                            .dwattr $C$DW$238, DW_AT_decl_line(0x32c)
    3673                            .dwattr $C$DW$238, DW_AT_decl_column(0x12)
    3674                    
    3675                    $C$DW$239       .dwtag  DW_TAG_member
    3676                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$24)
    3677                            .dwattr $C$DW$239, DW_AT_name("IMCR")
    3678                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("IMCR")
    3679                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   69

    3680                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3681                            .dwattr $C$DW$239, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3682                            .dwattr $C$DW$239, DW_AT_decl_line(0x32d)
    3683                            .dwattr $C$DW$239, DW_AT_decl_column(0x12)
    3684                    
    3685                    $C$DW$240       .dwtag  DW_TAG_member
    3686                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$48)
    3687                            .dwattr $C$DW$240, DW_AT_name("RESERVED4")
    3688                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("RESERVED4")
    3689                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
    3690                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3691                            .dwattr $C$DW$240, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3692                            .dwattr $C$DW$240, DW_AT_decl_line(0x32e)
    3693                            .dwattr $C$DW$240, DW_AT_decl_column(0x12)
    3694                    
    3695                    $C$DW$241       .dwtag  DW_TAG_member
    3696                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$24)
    3697                            .dwattr $C$DW$241, DW_AT_name("LAR")
    3698                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("LAR")
    3699                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
    3700                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3701                            .dwattr $C$DW$241, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3702                            .dwattr $C$DW$241, DW_AT_decl_line(0x32f)
    3703                            .dwattr $C$DW$241, DW_AT_decl_column(0x12)
    3704                    
    3705                    $C$DW$242       .dwtag  DW_TAG_member
    3706                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$33)
    3707                            .dwattr $C$DW$242, DW_AT_name("LSR")
    3708                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("LSR")
    3709                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
    3710                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3711                            .dwattr $C$DW$242, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3712                            .dwattr $C$DW$242, DW_AT_decl_line(0x330)
    3713                            .dwattr $C$DW$242, DW_AT_decl_column(0x12)
    3714                    
    3715                    $C$DW$243       .dwtag  DW_TAG_member
    3716                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$49)
    3717                            .dwattr $C$DW$243, DW_AT_name("RESERVED5")
    3718                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("RESERVED5")
    3719                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
    3720                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3721                            .dwattr $C$DW$243, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3722                            .dwattr $C$DW$243, DW_AT_decl_line(0x331)
    3723                            .dwattr $C$DW$243, DW_AT_decl_column(0x12)
    3724                    
    3725                    $C$DW$244       .dwtag  DW_TAG_member
    3726                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$33)
    3727                            .dwattr $C$DW$244, DW_AT_name("PID4")
    3728                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("PID4")
    3729                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
    3730                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3731                            .dwattr $C$DW$244, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3732                            .dwattr $C$DW$244, DW_AT_decl_line(0x332)
    3733                            .dwattr $C$DW$244, DW_AT_decl_column(0x12)
    3734                    
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   70

    3735                    $C$DW$245       .dwtag  DW_TAG_member
    3736                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$33)
    3737                            .dwattr $C$DW$245, DW_AT_name("PID5")
    3738                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("PID5")
    3739                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
    3740                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3741                            .dwattr $C$DW$245, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3742                            .dwattr $C$DW$245, DW_AT_decl_line(0x333)
    3743                            .dwattr $C$DW$245, DW_AT_decl_column(0x12)
    3744                    
    3745                    $C$DW$246       .dwtag  DW_TAG_member
    3746                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$33)
    3747                            .dwattr $C$DW$246, DW_AT_name("PID6")
    3748                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("PID6")
    3749                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
    3750                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3751                            .dwattr $C$DW$246, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3752                            .dwattr $C$DW$246, DW_AT_decl_line(0x334)
    3753                            .dwattr $C$DW$246, DW_AT_decl_column(0x12)
    3754                    
    3755                    $C$DW$247       .dwtag  DW_TAG_member
    3756                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$33)
    3757                            .dwattr $C$DW$247, DW_AT_name("PID7")
    3758                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("PID7")
    3759                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
    3760                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3761                            .dwattr $C$DW$247, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3762                            .dwattr $C$DW$247, DW_AT_decl_line(0x335)
    3763                            .dwattr $C$DW$247, DW_AT_decl_column(0x12)
    3764                    
    3765                    $C$DW$248       .dwtag  DW_TAG_member
    3766                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$33)
    3767                            .dwattr $C$DW$248, DW_AT_name("PID0")
    3768                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("PID0")
    3769                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
    3770                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3771                            .dwattr $C$DW$248, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3772                            .dwattr $C$DW$248, DW_AT_decl_line(0x336)
    3773                            .dwattr $C$DW$248, DW_AT_decl_column(0x12)
    3774                    
    3775                    $C$DW$249       .dwtag  DW_TAG_member
    3776                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$33)
    3777                            .dwattr $C$DW$249, DW_AT_name("PID1")
    3778                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("PID1")
    3779                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
    3780                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3781                            .dwattr $C$DW$249, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3782                            .dwattr $C$DW$249, DW_AT_decl_line(0x337)
    3783                            .dwattr $C$DW$249, DW_AT_decl_column(0x12)
    3784                    
    3785                    $C$DW$250       .dwtag  DW_TAG_member
    3786                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$33)
    3787                            .dwattr $C$DW$250, DW_AT_name("PID2")
    3788                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("PID2")
    3789                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe8]
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   71

    3790                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3791                            .dwattr $C$DW$250, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3792                            .dwattr $C$DW$250, DW_AT_decl_line(0x338)
    3793                            .dwattr $C$DW$250, DW_AT_decl_column(0x12)
    3794                    
    3795                    $C$DW$251       .dwtag  DW_TAG_member
    3796                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$33)
    3797                            .dwattr $C$DW$251, DW_AT_name("PID3")
    3798                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("PID3")
    3799                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xfec]
    3800                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3801                            .dwattr $C$DW$251, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3802                            .dwattr $C$DW$251, DW_AT_decl_line(0x339)
    3803                            .dwattr $C$DW$251, DW_AT_decl_column(0x12)
    3804                    
    3805                    $C$DW$252       .dwtag  DW_TAG_member
    3806                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$33)
    3807                            .dwattr $C$DW$252, DW_AT_name("CID0")
    3808                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("CID0")
    3809                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xff0]
    3810                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3811                            .dwattr $C$DW$252, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3812                            .dwattr $C$DW$252, DW_AT_decl_line(0x33a)
    3813                            .dwattr $C$DW$252, DW_AT_decl_column(0x12)
    3814                    
    3815                    $C$DW$253       .dwtag  DW_TAG_member
    3816                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$33)
    3817                            .dwattr $C$DW$253, DW_AT_name("CID1")
    3818                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("CID1")
    3819                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xff4]
    3820                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3821                            .dwattr $C$DW$253, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3822                            .dwattr $C$DW$253, DW_AT_decl_line(0x33b)
    3823                            .dwattr $C$DW$253, DW_AT_decl_column(0x12)
    3824                    
    3825                    $C$DW$254       .dwtag  DW_TAG_member
    3826                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$33)
    3827                            .dwattr $C$DW$254, DW_AT_name("CID2")
    3828                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("CID2")
    3829                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xff8]
    3830                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3831                            .dwattr $C$DW$254, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3832                            .dwattr $C$DW$254, DW_AT_decl_line(0x33c)
    3833                            .dwattr $C$DW$254, DW_AT_decl_column(0x12)
    3834                    
    3835                    $C$DW$255       .dwtag  DW_TAG_member
    3836                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$33)
    3837                            .dwattr $C$DW$255, DW_AT_name("CID3")
    3838                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("CID3")
    3839                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xffc]
    3840                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3841                            .dwattr $C$DW$255, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3842                            .dwattr $C$DW$255, DW_AT_decl_line(0x33d)
    3843                            .dwattr $C$DW$255, DW_AT_decl_column(0x12)
    3844                    
TI ARM Assembler Unix v16.9.0 Fri Apr 28 21:57:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
joystick_draw3 (1).asm                                               PAGE   72

    3845                            .dwattr $C$DW$T$50, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3846                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x31d)
    3847                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    3848                            .dwendtag $C$DW$T$50
    3849                    
    3850                    $C$DW$T$246     .dwtag  DW_TAG_typedef
    3851                            .dwattr $C$DW$T$246, DW_AT_name("ITM_Type")
    3852                            .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$50)
    3853                            .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    3854                            .dwattr $C$DW$T$246, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    3855                            .dwattr $C$DW$T$246, DW_AT_decl_line(0x33e)
    3856                            .dwattr $C$DW$T$246, DW_AT_decl_column(0x03)
    3857                    
    3858                    
    3859                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3860                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x5c)
    3861                    $C$DW$256       .dwtag  DW_TAG_member
    3862                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$24)
    3863                            .dwattr $C$DW$256, DW_AT_name("CTRL")
    3864                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("CTRL")
    3865                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3866                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3867                            .dwattr $C$DW$256, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3868                            .dwattr $C$DW$256, DW_AT_decl_line(0x385)
