TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Tue May  2 00:29:59 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("_enable_interrupts")

    7599                            .global g_sCrystalfontz128x128_funcs
    7600                            .global eat14BPP_UNCOMP
    7601                            .global eat24BPP_UNCOMP
    7602                            .global eat34BPP_UNCOMP
    7603                            .global happy14BPP_UNCOMP
    7604                            .global happy24BPP_UNCOMP
    7605                            .global happy34BPP_UNCOMP
    7606                            .global normal14BPP_UNCOMP
    7607                            .global normal24BPP_UNCOMP
    7608                            .global normal34BPP_UNCOMP
    7609                            .global unhappy14BPP_UNCOMP
    7610                            .global unhappy24BPP_UNCOMP
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  145

    7611                            .global unhappy34BPP_UNCOMP
    7612                            .global walk14BPP_UNCOMP
    7613                            .global walk24BPP_UNCOMP
    7614                            .global walk34BPP_UNCOMP
    7615                            .global play14BPP_UNCOMP
    7616                            .global play24BPP_UNCOMP
    7617                            .global play34BPP_UNCOMP
    7618                            .global dizzy14BPP_UNCOMP
    7619                            .global dizzy24BPP_UNCOMP
    7620                            .global dead4BPP_UNCOMP
    7621                            .global sleep14BPP_UNCOMP
    7622                            .global sleep24BPP_UNCOMP
    7623                            .global sleep34BPP_UNCOMP
    7624                            .global poop14BPP_UNCOMP
    7625                            .global poop24BPP_UNCOMP
    7626                            .global pet1_eat14BPP_UNCOMP
    7627                            .global pet1_eat24BPP_UNCOMP
    7628                            .global pet1_eat34BPP_UNCOMP
    7629                            .global pet1_happy14BPP_UNCOMP
    7630                            .global pet1_happy24BPP_UNCOMP
    7631                            .global pet1_happy34BPP_UNCOMP
    7632                            .global pet1_normal14BPP_UNCOMP
    7633                            .global pet1_normal24BPP_UNCOMP
    7634                            .global pet1_normal34BPP_UNCOMP
    7635                            .global pet1_unhappy14BPP_UNCOMP
    7636                            .global pet1_unhappy24BPP_UNCOMP
    7637                            .global pet1_unhappy34BPP_UNCOMP
    7638                            .global pet1_walk14BPP_UNCOMP
    7639                            .global pet1_walk24BPP_UNCOMP
    7640                            .global pet1_walk34BPP_UNCOMP
    7641                            .global pet1_play14BPP_UNCOMP
    7642                            .global pet1_play24BPP_UNCOMP
    7643                            .global pet1_play34BPP_UNCOMP
    7644                            .global pet1_dizzy14BPP_UNCOMP
    7645                            .global pet1_dizzy24BPP_UNCOMP
    7646                            .global pet1_dead4BPP_UNCOMP
    7647                            .global pet1_sleep14BPP_UNCOMP
    7648                            .global pet1_sleep24BPP_UNCOMP
    7649                            .global pet1_sleep34BPP_UNCOMP
    7650                            .global pet1_poop14BPP_UNCOMP
    7651                            .global pet1_poop24BPP_UNCOMP
    7652                    
    7653                    ;******************************************************************************
    7654                    ;* BUILD ATTRIBUTES                                                           *
    7655                    ;******************************************************************************
    7656                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    7657                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    7658                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    7659                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    7660                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    7661                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
    7662                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
    7663                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    7664                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
    7665                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  146

    7666                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    7667                    
    7668                    ;******************************************************************************
    7669                    ;* TYPE INFORMATION                                                           *
    7670                    ;******************************************************************************
    7671                    
    7672                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7673                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
    7674                    $C$DW$306       .dwtag  DW_TAG_member
    7675                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    7676                            .dwattr $C$DW$306, DW_AT_name("IN")
    7677                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("IN")
    7678                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7679                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    7680                            .dwattr $C$DW$306, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7681                            .dwattr $C$DW$306, DW_AT_decl_line(0x27b)
    7682                            .dwattr $C$DW$306, DW_AT_decl_column(0x0f)
    7683                    
    7684                    $C$DW$307       .dwtag  DW_TAG_member
    7685                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    7686                            .dwattr $C$DW$307, DW_AT_name("RESERVED0")
    7687                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("RESERVED0")
    7688                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7689                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    7690                            .dwattr $C$DW$307, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7691                            .dwattr $C$DW$307, DW_AT_decl_line(0x27c)
    7692                            .dwattr $C$DW$307, DW_AT_decl_column(0x0b)
    7693                    
    7694                    $C$DW$308       .dwtag  DW_TAG_member
    7695                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    7696                            .dwattr $C$DW$308, DW_AT_name("OUT")
    7697                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("OUT")
    7698                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7699                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    7700                            .dwattr $C$DW$308, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7701                            .dwattr $C$DW$308, DW_AT_decl_line(0x27d)
    7702                            .dwattr $C$DW$308, DW_AT_decl_column(0x10)
    7703                    
    7704                    $C$DW$309       .dwtag  DW_TAG_member
    7705                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    7706                            .dwattr $C$DW$309, DW_AT_name("RESERVED1")
    7707                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("RESERVED1")
    7708                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7709                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    7710                            .dwattr $C$DW$309, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7711                            .dwattr $C$DW$309, DW_AT_decl_line(0x27e)
    7712                            .dwattr $C$DW$309, DW_AT_decl_column(0x0b)
    7713                    
    7714                    $C$DW$310       .dwtag  DW_TAG_member
    7715                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    7716                            .dwattr $C$DW$310, DW_AT_name("DIR")
    7717                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("DIR")
    7718                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7719                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    7720                            .dwattr $C$DW$310, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  147

    7721                            .dwattr $C$DW$310, DW_AT_decl_line(0x27f)
    7722                            .dwattr $C$DW$310, DW_AT_decl_column(0x10)
    7723                    
    7724                    $C$DW$311       .dwtag  DW_TAG_member
    7725                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    7726                            .dwattr $C$DW$311, DW_AT_name("RESERVED2")
    7727                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("RESERVED2")
    7728                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7729                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    7730                            .dwattr $C$DW$311, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7731                            .dwattr $C$DW$311, DW_AT_decl_line(0x280)
    7732                            .dwattr $C$DW$311, DW_AT_decl_column(0x0b)
    7733                    
    7734                    $C$DW$312       .dwtag  DW_TAG_member
    7735                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    7736                            .dwattr $C$DW$312, DW_AT_name("REN")
    7737                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("REN")
    7738                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7739                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    7740                            .dwattr $C$DW$312, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7741                            .dwattr $C$DW$312, DW_AT_decl_line(0x281)
    7742                            .dwattr $C$DW$312, DW_AT_decl_column(0x10)
    7743                    
    7744                    $C$DW$313       .dwtag  DW_TAG_member
    7745                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    7746                            .dwattr $C$DW$313, DW_AT_name("RESERVED3")
    7747                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("RESERVED3")
    7748                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7749                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    7750                            .dwattr $C$DW$313, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7751                            .dwattr $C$DW$313, DW_AT_decl_line(0x282)
    7752                            .dwattr $C$DW$313, DW_AT_decl_column(0x0b)
    7753                    
    7754                    $C$DW$314       .dwtag  DW_TAG_member
    7755                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    7756                            .dwattr $C$DW$314, DW_AT_name("DS")
    7757                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("DS")
    7758                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7759                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    7760                            .dwattr $C$DW$314, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7761                            .dwattr $C$DW$314, DW_AT_decl_line(0x283)
    7762                            .dwattr $C$DW$314, DW_AT_decl_column(0x10)
    7763                    
    7764                    $C$DW$315       .dwtag  DW_TAG_member
    7765                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    7766                            .dwattr $C$DW$315, DW_AT_name("RESERVED4")
    7767                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("RESERVED4")
    7768                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7769                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    7770                            .dwattr $C$DW$315, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7771                            .dwattr $C$DW$315, DW_AT_decl_line(0x284)
    7772                            .dwattr $C$DW$315, DW_AT_decl_column(0x0b)
    7773                    
    7774                    $C$DW$316       .dwtag  DW_TAG_member
    7775                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  148

    7776                            .dwattr $C$DW$316, DW_AT_name("SEL0")
    7777                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("SEL0")
    7778                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7779                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    7780                            .dwattr $C$DW$316, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7781                            .dwattr $C$DW$316, DW_AT_decl_line(0x285)
    7782                            .dwattr $C$DW$316, DW_AT_decl_column(0x10)
    7783                    
    7784                    $C$DW$317       .dwtag  DW_TAG_member
    7785                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    7786                            .dwattr $C$DW$317, DW_AT_name("RESERVED5")
    7787                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("RESERVED5")
    7788                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7789                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    7790                            .dwattr $C$DW$317, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7791                            .dwattr $C$DW$317, DW_AT_decl_line(0x286)
    7792                            .dwattr $C$DW$317, DW_AT_decl_column(0x0b)
    7793                    
    7794                    $C$DW$318       .dwtag  DW_TAG_member
    7795                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
    7796                            .dwattr $C$DW$318, DW_AT_name("SEL1")
    7797                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("SEL1")
    7798                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7799                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    7800                            .dwattr $C$DW$318, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7801                            .dwattr $C$DW$318, DW_AT_decl_line(0x287)
    7802                            .dwattr $C$DW$318, DW_AT_decl_column(0x10)
    7803                    
    7804                    $C$DW$319       .dwtag  DW_TAG_member
    7805                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    7806                            .dwattr $C$DW$319, DW_AT_name("RESERVED6")
    7807                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("RESERVED6")
    7808                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7809                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    7810                            .dwattr $C$DW$319, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7811                            .dwattr $C$DW$319, DW_AT_decl_line(0x288)
    7812                            .dwattr $C$DW$319, DW_AT_decl_column(0x0b)
    7813                    
    7814                    $C$DW$320       .dwtag  DW_TAG_member
    7815                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$23)
    7816                            .dwattr $C$DW$320, DW_AT_name("IV")
    7817                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("IV")
    7818                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7819                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    7820                            .dwattr $C$DW$320, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7821                            .dwattr $C$DW$320, DW_AT_decl_line(0x289)
    7822                            .dwattr $C$DW$320, DW_AT_decl_column(0x11)
    7823                    
    7824                    $C$DW$321       .dwtag  DW_TAG_member
    7825                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$24)
    7826                            .dwattr $C$DW$321, DW_AT_name("RESERVED7")
    7827                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("RESERVED7")
    7828                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7829                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    7830                            .dwattr $C$DW$321, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  149

    7831                            .dwattr $C$DW$321, DW_AT_decl_line(0x28a)
    7832                            .dwattr $C$DW$321, DW_AT_decl_column(0x0b)
    7833                    
    7834                    $C$DW$322       .dwtag  DW_TAG_member
    7835                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    7836                            .dwattr $C$DW$322, DW_AT_name("SELC")
    7837                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("SELC")
    7838                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7839                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    7840                            .dwattr $C$DW$322, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7841                            .dwattr $C$DW$322, DW_AT_decl_line(0x28b)
    7842                            .dwattr $C$DW$322, DW_AT_decl_column(0x10)
    7843                    
    7844                    $C$DW$323       .dwtag  DW_TAG_member
    7845                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    7846                            .dwattr $C$DW$323, DW_AT_name("RESERVED8")
    7847                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("RESERVED8")
    7848                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7849                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    7850                            .dwattr $C$DW$323, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7851                            .dwattr $C$DW$323, DW_AT_decl_line(0x28c)
    7852                            .dwattr $C$DW$323, DW_AT_decl_column(0x0b)
    7853                    
    7854                    $C$DW$324       .dwtag  DW_TAG_member
    7855                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    7856                            .dwattr $C$DW$324, DW_AT_name("IES")
    7857                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("IES")
    7858                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7859                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    7860                            .dwattr $C$DW$324, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7861                            .dwattr $C$DW$324, DW_AT_decl_line(0x28d)
    7862                            .dwattr $C$DW$324, DW_AT_decl_column(0x10)
    7863                    
    7864                    $C$DW$325       .dwtag  DW_TAG_member
    7865                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    7866                            .dwattr $C$DW$325, DW_AT_name("RESERVED9")
    7867                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("RESERVED9")
    7868                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    7869                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    7870                            .dwattr $C$DW$325, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7871                            .dwattr $C$DW$325, DW_AT_decl_line(0x28e)
    7872                            .dwattr $C$DW$325, DW_AT_decl_column(0x0b)
    7873                    
    7874                    $C$DW$326       .dwtag  DW_TAG_member
    7875                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    7876                            .dwattr $C$DW$326, DW_AT_name("IE")
    7877                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("IE")
    7878                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7879                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    7880                            .dwattr $C$DW$326, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7881                            .dwattr $C$DW$326, DW_AT_decl_line(0x28f)
    7882                            .dwattr $C$DW$326, DW_AT_decl_column(0x10)
    7883                    
    7884                    $C$DW$327       .dwtag  DW_TAG_member
    7885                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  150

    7886                            .dwattr $C$DW$327, DW_AT_name("RESERVED10")
    7887                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("RESERVED10")
    7888                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    7889                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    7890                            .dwattr $C$DW$327, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7891                            .dwattr $C$DW$327, DW_AT_decl_line(0x290)
    7892                            .dwattr $C$DW$327, DW_AT_decl_column(0x0b)
    7893                    
    7894                    $C$DW$328       .dwtag  DW_TAG_member
    7895                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    7896                            .dwattr $C$DW$328, DW_AT_name("IFG")
    7897                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("IFG")
    7898                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7899                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    7900                            .dwattr $C$DW$328, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7901                            .dwattr $C$DW$328, DW_AT_decl_line(0x291)
    7902                            .dwattr $C$DW$328, DW_AT_decl_column(0x10)
    7903                    
    7904                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    7905                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x27a)
    7906                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    7907                            .dwendtag $C$DW$T$25
    7908                    
    7909                    $C$DW$T$242     .dwtag  DW_TAG_typedef
    7910                            .dwattr $C$DW$T$242, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    7911                            .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$25)
    7912                            .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    7913                            .dwattr $C$DW$T$242, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    7914                            .dwattr $C$DW$T$242, DW_AT_decl_line(0x292)
    7915                            .dwattr $C$DW$T$242, DW_AT_decl_column(0x03)
    7916                    
    7917                    
    7918                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7919                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    7920                    $C$DW$329       .dwtag  DW_TAG_member
    7921                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$26)
    7922                            .dwattr $C$DW$329, DW_AT_name("KEYID")
    7923                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("KEYID")
    7924                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7925                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    7926                            .dwattr $C$DW$329, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7927                            .dwattr $C$DW$329, DW_AT_decl_line(0x3e5)
    7928                            .dwattr $C$DW$329, DW_AT_decl_column(0x11)
    7929                    
    7930                    $C$DW$330       .dwtag  DW_TAG_member
    7931                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$26)
    7932                            .dwattr $C$DW$330, DW_AT_name("CTL")
    7933                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("CTL")
    7934                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7935                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    7936                            .dwattr $C$DW$330, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7937                            .dwattr $C$DW$330, DW_AT_decl_line(0x3e6)
    7938                            .dwattr $C$DW$330, DW_AT_decl_column(0x11)
    7939                    
    7940                            .dwattr $C$DW$T$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  151

    7941                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3e4)
    7942                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    7943                            .dwendtag $C$DW$T$27
    7944                    
    7945                    $C$DW$T$244     .dwtag  DW_TAG_typedef
    7946                            .dwattr $C$DW$T$244, DW_AT_name("PMAP_COMMON_Type")
    7947                            .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$27)
    7948                            .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    7949                            .dwattr $C$DW$T$244, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    7950                            .dwattr $C$DW$T$244, DW_AT_decl_line(0x3e7)
    7951                            .dwattr $C$DW$T$244, DW_AT_decl_column(0x03)
    7952                    
    7953                    
    7954                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7955                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    7956                    $C$DW$331       .dwtag  DW_TAG_member
    7957                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    7958                            .dwattr $C$DW$331, DW_AT_name("PMAP_REGISTER0")
    7959                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("PMAP_REGISTER0")
    7960                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7961                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    7962                            .dwattr $C$DW$331, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7963                            .dwattr $C$DW$331, DW_AT_decl_line(0x3ed)
    7964                            .dwattr $C$DW$331, DW_AT_decl_column(0x14)
    7965                    
    7966                    $C$DW$332       .dwtag  DW_TAG_member
    7967                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
    7968                            .dwattr $C$DW$332, DW_AT_name("PMAP_REGISTER1")
    7969                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("PMAP_REGISTER1")
    7970                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7971                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    7972                            .dwattr $C$DW$332, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7973                            .dwattr $C$DW$332, DW_AT_decl_line(0x3ee)
    7974                            .dwattr $C$DW$332, DW_AT_decl_column(0x14)
    7975                    
    7976                    $C$DW$333       .dwtag  DW_TAG_member
    7977                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
    7978                            .dwattr $C$DW$333, DW_AT_name("PMAP_REGISTER2")
    7979                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("PMAP_REGISTER2")
    7980                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7981                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    7982                            .dwattr $C$DW$333, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7983                            .dwattr $C$DW$333, DW_AT_decl_line(0x3ef)
    7984                            .dwattr $C$DW$333, DW_AT_decl_column(0x14)
    7985                    
    7986                    $C$DW$334       .dwtag  DW_TAG_member
    7987                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
    7988                            .dwattr $C$DW$334, DW_AT_name("PMAP_REGISTER3")
    7989                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("PMAP_REGISTER3")
    7990                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7991                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    7992                            .dwattr $C$DW$334, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    7993                            .dwattr $C$DW$334, DW_AT_decl_line(0x3f0)
    7994                            .dwattr $C$DW$334, DW_AT_decl_column(0x14)
    7995                    
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  152

    7996                    $C$DW$335       .dwtag  DW_TAG_member
    7997                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
    7998                            .dwattr $C$DW$335, DW_AT_name("PMAP_REGISTER4")
    7999                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("PMAP_REGISTER4")
    8000                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8001                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    8002                            .dwattr $C$DW$335, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8003                            .dwattr $C$DW$335, DW_AT_decl_line(0x3f1)
    8004                            .dwattr $C$DW$335, DW_AT_decl_column(0x14)
    8005                    
    8006                    $C$DW$336       .dwtag  DW_TAG_member
    8007                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$21)
    8008                            .dwattr $C$DW$336, DW_AT_name("PMAP_REGISTER5")
    8009                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("PMAP_REGISTER5")
    8010                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8011                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    8012                            .dwattr $C$DW$336, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8013                            .dwattr $C$DW$336, DW_AT_decl_line(0x3f2)
    8014                            .dwattr $C$DW$336, DW_AT_decl_column(0x14)
    8015                    
    8016                    $C$DW$337       .dwtag  DW_TAG_member
    8017                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    8018                            .dwattr $C$DW$337, DW_AT_name("PMAP_REGISTER6")
    8019                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("PMAP_REGISTER6")
    8020                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8021                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    8022                            .dwattr $C$DW$337, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8023                            .dwattr $C$DW$337, DW_AT_decl_line(0x3f3)
    8024                            .dwattr $C$DW$337, DW_AT_decl_column(0x14)
    8025                    
    8026                    $C$DW$338       .dwtag  DW_TAG_member
    8027                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$21)
    8028                            .dwattr $C$DW$338, DW_AT_name("PMAP_REGISTER7")
    8029                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("PMAP_REGISTER7")
    8030                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8031                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    8032                            .dwattr $C$DW$338, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8033                            .dwattr $C$DW$338, DW_AT_decl_line(0x3f4)
    8034                            .dwattr $C$DW$338, DW_AT_decl_column(0x14)
    8035                    
    8036                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8037                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3ec)
    8038                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0c)
    8039                            .dwendtag $C$DW$T$28
    8040                    
    8041                    
    8042                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    8043                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    8044                    $C$DW$339       .dwtag  DW_TAG_member
    8045                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$152)
    8046                            .dwattr $C$DW$339, DW_AT_name("$P$T1")
    8047                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("$P$T1")
    8048                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8049                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    8050                            .dwattr $C$DW$339, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  153

    8051                            .dwattr $C$DW$339, DW_AT_decl_line(0x3ea)
    8052                            .dwattr $C$DW$339, DW_AT_decl_column(0x03)
    8053                    
    8054                            .dwattr $C$DW$T$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8055                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e9)
    8056                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    8057                            .dwendtag $C$DW$T$29
    8058                    
    8059                    $C$DW$T$246     .dwtag  DW_TAG_typedef
    8060                            .dwattr $C$DW$T$246, DW_AT_name("PMAP_REGISTER_Type")
    8061                            .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$29)
    8062                            .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    8063                            .dwattr $C$DW$T$246, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    8064                            .dwattr $C$DW$T$246, DW_AT_decl_line(0x3f7)
    8065                            .dwattr $C$DW$T$246, DW_AT_decl_column(0x03)
    8066                    
    8067                    
    8068                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    8069                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    8070                    $C$DW$340       .dwtag  DW_TAG_member
    8071                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$30)
    8072                            .dwattr $C$DW$340, DW_AT_name("RESERVED0")
    8073                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("RESERVED0")
    8074                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8075                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    8076                            .dwattr $C$DW$340, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8077                            .dwattr $C$DW$340, DW_AT_decl_line(0x513)
    8078                            .dwattr $C$DW$340, DW_AT_decl_column(0x11)
    8079                    
    8080                    $C$DW$341       .dwtag  DW_TAG_member
    8081                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$26)
    8082                            .dwattr $C$DW$341, DW_AT_name("CTL")
    8083                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("CTL")
    8084                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8085                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    8086                            .dwattr $C$DW$341, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8087                            .dwattr $C$DW$341, DW_AT_decl_line(0x514)
    8088                            .dwattr $C$DW$341, DW_AT_decl_column(0x11)
    8089                    
    8090                            .dwattr $C$DW$T$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8091                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x512)
    8092                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    8093                            .dwendtag $C$DW$T$31
    8094                    
    8095                    $C$DW$T$247     .dwtag  DW_TAG_typedef
    8096                            .dwattr $C$DW$T$247, DW_AT_name("WDT_A_Type")
    8097                            .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$31)
    8098                            .dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C)
    8099                            .dwattr $C$DW$T$247, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    8100                            .dwattr $C$DW$T$247, DW_AT_decl_line(0x515)
    8101                            .dwattr $C$DW$T$247, DW_AT_decl_column(0x03)
    8102                    
    8103                    
    8104                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8105                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x8c)
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  154

    8106                    $C$DW$342       .dwtag  DW_TAG_member
    8107                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$33)
    8108                            .dwattr $C$DW$342, DW_AT_name("CPUID")
    8109                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("CPUID")
    8110                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8111                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    8112                            .dwattr $C$DW$342, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8113                            .dwattr $C$DW$342, DW_AT_decl_line(0x1e7)
    8114                            .dwattr $C$DW$342, DW_AT_decl_column(0x12)
    8115                    
    8116                    $C$DW$343       .dwtag  DW_TAG_member
    8117                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$34)
    8118                            .dwattr $C$DW$343, DW_AT_name("ICSR")
    8119                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("ICSR")
    8120                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8121                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    8122                            .dwattr $C$DW$343, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8123                            .dwattr $C$DW$343, DW_AT_decl_line(0x1e8)
    8124                            .dwattr $C$DW$343, DW_AT_decl_column(0x12)
    8125                    
    8126                    $C$DW$344       .dwtag  DW_TAG_member
    8127                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$34)
    8128                            .dwattr $C$DW$344, DW_AT_name("VTOR")
    8129                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("VTOR")
    8130                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8131                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    8132                            .dwattr $C$DW$344, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8133                            .dwattr $C$DW$344, DW_AT_decl_line(0x1e9)
    8134                            .dwattr $C$DW$344, DW_AT_decl_column(0x12)
    8135                    
    8136                    $C$DW$345       .dwtag  DW_TAG_member
    8137                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$34)
    8138                            .dwattr $C$DW$345, DW_AT_name("AIRCR")
    8139                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("AIRCR")
    8140                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8141                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    8142                            .dwattr $C$DW$345, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8143                            .dwattr $C$DW$345, DW_AT_decl_line(0x1ea)
    8144                            .dwattr $C$DW$345, DW_AT_decl_column(0x12)
    8145                    
    8146                    $C$DW$346       .dwtag  DW_TAG_member
    8147                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$34)
    8148                            .dwattr $C$DW$346, DW_AT_name("SCR")
    8149                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("SCR")
    8150                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8151                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    8152                            .dwattr $C$DW$346, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8153                            .dwattr $C$DW$346, DW_AT_decl_line(0x1eb)
    8154                            .dwattr $C$DW$346, DW_AT_decl_column(0x12)
    8155                    
    8156                    $C$DW$347       .dwtag  DW_TAG_member
    8157                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$34)
    8158                            .dwattr $C$DW$347, DW_AT_name("CCR")
    8159                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("CCR")
    8160                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  155

    8161                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    8162                            .dwattr $C$DW$347, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8163                            .dwattr $C$DW$347, DW_AT_decl_line(0x1ec)
    8164                            .dwattr $C$DW$347, DW_AT_decl_column(0x12)
    8165                    
    8166                    $C$DW$348       .dwtag  DW_TAG_member
    8167                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$35)
    8168                            .dwattr $C$DW$348, DW_AT_name("SHP")
    8169                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("SHP")
    8170                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8171                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    8172                            .dwattr $C$DW$348, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8173                            .dwattr $C$DW$348, DW_AT_decl_line(0x1ed)
    8174                            .dwattr $C$DW$348, DW_AT_decl_column(0x12)
    8175                    
    8176                    $C$DW$349       .dwtag  DW_TAG_member
    8177                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$34)
    8178                            .dwattr $C$DW$349, DW_AT_name("SHCSR")
    8179                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("SHCSR")
    8180                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8181                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    8182                            .dwattr $C$DW$349, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8183                            .dwattr $C$DW$349, DW_AT_decl_line(0x1ee)
    8184                            .dwattr $C$DW$349, DW_AT_decl_column(0x12)
    8185                    
    8186                    $C$DW$350       .dwtag  DW_TAG_member
    8187                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$34)
    8188                            .dwattr $C$DW$350, DW_AT_name("CFSR")
    8189                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("CFSR")
    8190                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8191                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    8192                            .dwattr $C$DW$350, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8193                            .dwattr $C$DW$350, DW_AT_decl_line(0x1ef)
    8194                            .dwattr $C$DW$350, DW_AT_decl_column(0x12)
    8195                    
    8196                    $C$DW$351       .dwtag  DW_TAG_member
    8197                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$34)
    8198                            .dwattr $C$DW$351, DW_AT_name("HFSR")
    8199                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("HFSR")
    8200                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8201                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    8202                            .dwattr $C$DW$351, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8203                            .dwattr $C$DW$351, DW_AT_decl_line(0x1f0)
    8204                            .dwattr $C$DW$351, DW_AT_decl_column(0x12)
    8205                    
    8206                    $C$DW$352       .dwtag  DW_TAG_member
    8207                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$34)
    8208                            .dwattr $C$DW$352, DW_AT_name("DFSR")
    8209                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("DFSR")
    8210                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8211                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    8212                            .dwattr $C$DW$352, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8213                            .dwattr $C$DW$352, DW_AT_decl_line(0x1f1)
    8214                            .dwattr $C$DW$352, DW_AT_decl_column(0x12)
    8215                    
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  156

    8216                    $C$DW$353       .dwtag  DW_TAG_member
    8217                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$34)
    8218                            .dwattr $C$DW$353, DW_AT_name("MMFAR")
    8219                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("MMFAR")
    8220                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8221                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    8222                            .dwattr $C$DW$353, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8223                            .dwattr $C$DW$353, DW_AT_decl_line(0x1f2)
    8224                            .dwattr $C$DW$353, DW_AT_decl_column(0x12)
    8225                    
    8226                    $C$DW$354       .dwtag  DW_TAG_member
    8227                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$34)
    8228                            .dwattr $C$DW$354, DW_AT_name("BFAR")
    8229                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("BFAR")
    8230                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8231                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    8232                            .dwattr $C$DW$354, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8233                            .dwattr $C$DW$354, DW_AT_decl_line(0x1f3)
    8234                            .dwattr $C$DW$354, DW_AT_decl_column(0x12)
    8235                    
    8236                    $C$DW$355       .dwtag  DW_TAG_member
    8237                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$34)
    8238                            .dwattr $C$DW$355, DW_AT_name("AFSR")
    8239                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("AFSR")
    8240                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8241                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    8242                            .dwattr $C$DW$355, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8243                            .dwattr $C$DW$355, DW_AT_decl_line(0x1f4)
    8244                            .dwattr $C$DW$355, DW_AT_decl_column(0x12)
    8245                    
    8246                    $C$DW$356       .dwtag  DW_TAG_member
    8247                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$36)
    8248                            .dwattr $C$DW$356, DW_AT_name("PFR")
    8249                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("PFR")
    8250                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8251                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    8252                            .dwattr $C$DW$356, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8253                            .dwattr $C$DW$356, DW_AT_decl_line(0x1f5)
    8254                            .dwattr $C$DW$356, DW_AT_decl_column(0x12)
    8255                    
    8256                    $C$DW$357       .dwtag  DW_TAG_member
    8257                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$33)
    8258                            .dwattr $C$DW$357, DW_AT_name("DFR")
    8259                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("DFR")
    8260                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8261                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    8262                            .dwattr $C$DW$357, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8263                            .dwattr $C$DW$357, DW_AT_decl_line(0x1f6)
    8264                            .dwattr $C$DW$357, DW_AT_decl_column(0x12)
    8265                    
    8266                    $C$DW$358       .dwtag  DW_TAG_member
    8267                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$33)
    8268                            .dwattr $C$DW$358, DW_AT_name("ADR")
    8269                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("ADR")
    8270                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  157

    8271                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    8272                            .dwattr $C$DW$358, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8273                            .dwattr $C$DW$358, DW_AT_decl_line(0x1f7)
    8274                            .dwattr $C$DW$358, DW_AT_decl_column(0x12)
    8275                    
    8276                    $C$DW$359       .dwtag  DW_TAG_member
    8277                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$37)
    8278                            .dwattr $C$DW$359, DW_AT_name("MMFR")
    8279                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("MMFR")
    8280                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8281                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    8282                            .dwattr $C$DW$359, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8283                            .dwattr $C$DW$359, DW_AT_decl_line(0x1f8)
    8284                            .dwattr $C$DW$359, DW_AT_decl_column(0x12)
    8285                    
    8286                    $C$DW$360       .dwtag  DW_TAG_member
    8287                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$38)
    8288                            .dwattr $C$DW$360, DW_AT_name("ISAR")
    8289                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("ISAR")
    8290                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8291                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    8292                            .dwattr $C$DW$360, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8293                            .dwattr $C$DW$360, DW_AT_decl_line(0x1f9)
    8294                            .dwattr $C$DW$360, DW_AT_decl_column(0x12)
    8295                    
    8296                    $C$DW$361       .dwtag  DW_TAG_member
    8297                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$39)
    8298                            .dwattr $C$DW$361, DW_AT_name("RESERVED0")
    8299                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("RESERVED0")
    8300                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    8301                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    8302                            .dwattr $C$DW$361, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8303                            .dwattr $C$DW$361, DW_AT_decl_line(0x1fa)
    8304                            .dwattr $C$DW$361, DW_AT_decl_column(0x12)
    8305                    
    8306                    $C$DW$362       .dwtag  DW_TAG_member
    8307                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$34)
    8308                            .dwattr $C$DW$362, DW_AT_name("CPACR")
    8309                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("CPACR")
    8310                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    8311                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    8312                            .dwattr $C$DW$362, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8313                            .dwattr $C$DW$362, DW_AT_decl_line(0x1fb)
    8314                            .dwattr $C$DW$362, DW_AT_decl_column(0x12)
    8315                    
    8316                            .dwattr $C$DW$T$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8317                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1e6)
    8318                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    8319                            .dwendtag $C$DW$T$40
    8320                    
    8321                    $C$DW$T$248     .dwtag  DW_TAG_typedef
    8322                            .dwattr $C$DW$T$248, DW_AT_name("SCB_Type")
    8323                            .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$40)
    8324                            .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    8325                            .dwattr $C$DW$T$248, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  158

    8326                            .dwattr $C$DW$T$248, DW_AT_decl_line(0x1fc)
    8327                            .dwattr $C$DW$T$248, DW_AT_decl_column(0x03)
    8328                    
    8329                    
    8330                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    8331                            .dwattr $C$DW$T$46, DW_AT_byte_size(0xe04)
    8332                    $C$DW$363       .dwtag  DW_TAG_member
    8333                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$41)
    8334                            .dwattr $C$DW$363, DW_AT_name("ISER")
    8335                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("ISER")
    8336                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8337                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    8338                            .dwattr $C$DW$363, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8339                            .dwattr $C$DW$363, DW_AT_decl_line(0x1c5)
    8340                            .dwattr $C$DW$363, DW_AT_decl_column(0x12)
    8341                    
    8342                    $C$DW$364       .dwtag  DW_TAG_member
    8343                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$42)
    8344                            .dwattr $C$DW$364, DW_AT_name("RESERVED0")
    8345                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("RESERVED0")
    8346                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8347                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    8348                            .dwattr $C$DW$364, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8349                            .dwattr $C$DW$364, DW_AT_decl_line(0x1c6)
    8350                            .dwattr $C$DW$364, DW_AT_decl_column(0x12)
    8351                    
    8352                    $C$DW$365       .dwtag  DW_TAG_member
    8353                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$41)
    8354                            .dwattr $C$DW$365, DW_AT_name("ICER")
    8355                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("ICER")
    8356                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    8357                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    8358                            .dwattr $C$DW$365, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8359                            .dwattr $C$DW$365, DW_AT_decl_line(0x1c7)
    8360                            .dwattr $C$DW$365, DW_AT_decl_column(0x12)
    8361                    
    8362                    $C$DW$366       .dwtag  DW_TAG_member
    8363                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$42)
    8364                            .dwattr $C$DW$366, DW_AT_name("RSERVED1")
    8365                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("RSERVED1")
    8366                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8367                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    8368                            .dwattr $C$DW$366, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8369                            .dwattr $C$DW$366, DW_AT_decl_line(0x1c8)
    8370                            .dwattr $C$DW$366, DW_AT_decl_column(0x12)
    8371                    
    8372                    $C$DW$367       .dwtag  DW_TAG_member
    8373                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$41)
    8374                            .dwattr $C$DW$367, DW_AT_name("ISPR")
    8375                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("ISPR")
    8376                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8377                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    8378                            .dwattr $C$DW$367, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8379                            .dwattr $C$DW$367, DW_AT_decl_line(0x1c9)
    8380                            .dwattr $C$DW$367, DW_AT_decl_column(0x12)
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  159

    8381                    
    8382                    $C$DW$368       .dwtag  DW_TAG_member
    8383                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$42)
    8384                            .dwattr $C$DW$368, DW_AT_name("RESERVED2")
    8385                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("RESERVED2")
    8386                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    8387                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    8388                            .dwattr $C$DW$368, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8389                            .dwattr $C$DW$368, DW_AT_decl_line(0x1ca)
    8390                            .dwattr $C$DW$368, DW_AT_decl_column(0x12)
    8391                    
    8392                    $C$DW$369       .dwtag  DW_TAG_member
    8393                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$41)
    8394                            .dwattr $C$DW$369, DW_AT_name("ICPR")
    8395                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("ICPR")
    8396                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    8397                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    8398                            .dwattr $C$DW$369, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8399                            .dwattr $C$DW$369, DW_AT_decl_line(0x1cb)
    8400                            .dwattr $C$DW$369, DW_AT_decl_column(0x12)
    8401                    
    8402                    $C$DW$370       .dwtag  DW_TAG_member
    8403                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$42)
    8404                            .dwattr $C$DW$370, DW_AT_name("RESERVED3")
    8405                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("RESERVED3")
    8406                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    8407                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    8408                            .dwattr $C$DW$370, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8409                            .dwattr $C$DW$370, DW_AT_decl_line(0x1cc)
    8410                            .dwattr $C$DW$370, DW_AT_decl_column(0x12)
    8411                    
    8412                    $C$DW$371       .dwtag  DW_TAG_member
    8413                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$41)
    8414                            .dwattr $C$DW$371, DW_AT_name("IABR")
    8415                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("IABR")
    8416                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    8417                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    8418                            .dwattr $C$DW$371, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8419                            .dwattr $C$DW$371, DW_AT_decl_line(0x1cd)
    8420                            .dwattr $C$DW$371, DW_AT_decl_column(0x12)
    8421                    
    8422                    $C$DW$372       .dwtag  DW_TAG_member
    8423                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$43)
    8424                            .dwattr $C$DW$372, DW_AT_name("RESERVED4")
    8425                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("RESERVED4")
    8426                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    8427                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    8428                            .dwattr $C$DW$372, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8429                            .dwattr $C$DW$372, DW_AT_decl_line(0x1ce)
    8430                            .dwattr $C$DW$372, DW_AT_decl_column(0x12)
    8431                    
    8432                    $C$DW$373       .dwtag  DW_TAG_member
    8433                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$44)
    8434                            .dwattr $C$DW$373, DW_AT_name("IP")
    8435                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("IP")
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  160

    8436                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    8437                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    8438                            .dwattr $C$DW$373, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8439                            .dwattr $C$DW$373, DW_AT_decl_line(0x1cf)
    8440                            .dwattr $C$DW$373, DW_AT_decl_column(0x12)
    8441                    
    8442                    $C$DW$374       .dwtag  DW_TAG_member
    8443                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$45)
    8444                            .dwattr $C$DW$374, DW_AT_name("RESERVED5")
    8445                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("RESERVED5")
    8446                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    8447                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    8448                            .dwattr $C$DW$374, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8449                            .dwattr $C$DW$374, DW_AT_decl_line(0x1d0)
    8450                            .dwattr $C$DW$374, DW_AT_decl_column(0x12)
    8451                    
    8452                    $C$DW$375       .dwtag  DW_TAG_member
    8453                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$34)
    8454                            .dwattr $C$DW$375, DW_AT_name("STIR")
    8455                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("STIR")
    8456                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    8457                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    8458                            .dwattr $C$DW$375, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8459                            .dwattr $C$DW$375, DW_AT_decl_line(0x1d1)
    8460                            .dwattr $C$DW$375, DW_AT_decl_column(0x12)
    8461                    
    8462                            .dwattr $C$DW$T$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8463                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x1c4)
    8464                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    8465                            .dwendtag $C$DW$T$46
    8466                    
    8467                    $C$DW$T$249     .dwtag  DW_TAG_typedef
    8468                            .dwattr $C$DW$T$249, DW_AT_name("NVIC_Type")
    8469                            .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$46)
    8470                            .dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
    8471                            .dwattr $C$DW$T$249, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    8472                            .dwattr $C$DW$T$249, DW_AT_decl_line(0x1d2)
    8473                            .dwattr $C$DW$T$249, DW_AT_decl_column(0x04)
    8474                    
    8475                    
    8476                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8477                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    8478                    $C$DW$376       .dwtag  DW_TAG_member
    8479                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$32)
    8480                            .dwattr $C$DW$376, DW_AT_name("_reserved0")
    8481                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("_reserved0")
    8482                            .dwattr $C$DW$376, DW_AT_bit_offset(0x10)
    8483                            .dwattr $C$DW$376, DW_AT_bit_size(0x10)
    8484                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8485                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    8486                            .dwattr $C$DW$376, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8487                            .dwattr $C$DW$376, DW_AT_decl_line(0x138)
    8488                            .dwattr $C$DW$376, DW_AT_decl_column(0x0e)
    8489                    
    8490                    $C$DW$377       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  161

    8491                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$32)
    8492                            .dwattr $C$DW$377, DW_AT_name("GE")
    8493                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("GE")
    8494                            .dwattr $C$DW$377, DW_AT_bit_offset(0x0c)
    8495                            .dwattr $C$DW$377, DW_AT_bit_size(0x04)
    8496                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8497                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    8498                            .dwattr $C$DW$377, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8499                            .dwattr $C$DW$377, DW_AT_decl_line(0x139)
    8500                            .dwattr $C$DW$377, DW_AT_decl_column(0x0e)
    8501                    
    8502                    $C$DW$378       .dwtag  DW_TAG_member
    8503                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$32)
    8504                            .dwattr $C$DW$378, DW_AT_name("_reserved1")
    8505                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("_reserved1")
    8506                            .dwattr $C$DW$378, DW_AT_bit_offset(0x05)
    8507                            .dwattr $C$DW$378, DW_AT_bit_size(0x07)
    8508                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8509                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    8510                            .dwattr $C$DW$378, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8511                            .dwattr $C$DW$378, DW_AT_decl_line(0x13a)
    8512                            .dwattr $C$DW$378, DW_AT_decl_column(0x0e)
    8513                    
    8514                    $C$DW$379       .dwtag  DW_TAG_member
    8515                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$32)
    8516                            .dwattr $C$DW$379, DW_AT_name("Q")
    8517                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("Q")
    8518                            .dwattr $C$DW$379, DW_AT_bit_offset(0x04)
    8519                            .dwattr $C$DW$379, DW_AT_bit_size(0x01)
    8520                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8521                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    8522                            .dwattr $C$DW$379, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8523                            .dwattr $C$DW$379, DW_AT_decl_line(0x13b)
    8524                            .dwattr $C$DW$379, DW_AT_decl_column(0x0e)
    8525                    
    8526                    $C$DW$380       .dwtag  DW_TAG_member
    8527                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$32)
    8528                            .dwattr $C$DW$380, DW_AT_name("V")
    8529                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("V")
    8530                            .dwattr $C$DW$380, DW_AT_bit_offset(0x03)
    8531                            .dwattr $C$DW$380, DW_AT_bit_size(0x01)
    8532                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8533                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    8534                            .dwattr $C$DW$380, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8535                            .dwattr $C$DW$380, DW_AT_decl_line(0x13c)
    8536                            .dwattr $C$DW$380, DW_AT_decl_column(0x0e)
    8537                    
    8538                    $C$DW$381       .dwtag  DW_TAG_member
    8539                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$32)
    8540                            .dwattr $C$DW$381, DW_AT_name("C")
    8541                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("C")
    8542                            .dwattr $C$DW$381, DW_AT_bit_offset(0x02)
    8543                            .dwattr $C$DW$381, DW_AT_bit_size(0x01)
    8544                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8545                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  162

    8546                            .dwattr $C$DW$381, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8547                            .dwattr $C$DW$381, DW_AT_decl_line(0x13d)
    8548                            .dwattr $C$DW$381, DW_AT_decl_column(0x0e)
    8549                    
    8550                    $C$DW$382       .dwtag  DW_TAG_member
    8551                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$32)
    8552                            .dwattr $C$DW$382, DW_AT_name("Z")
    8553                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("Z")
    8554                            .dwattr $C$DW$382, DW_AT_bit_offset(0x01)
    8555                            .dwattr $C$DW$382, DW_AT_bit_size(0x01)
    8556                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8557                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    8558                            .dwattr $C$DW$382, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8559                            .dwattr $C$DW$382, DW_AT_decl_line(0x13e)
    8560                            .dwattr $C$DW$382, DW_AT_decl_column(0x0e)
    8561                    
    8562                    $C$DW$383       .dwtag  DW_TAG_member
    8563                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$32)
    8564                            .dwattr $C$DW$383, DW_AT_name("N")
    8565                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("N")
    8566                            .dwattr $C$DW$383, DW_AT_bit_offset(0x00)
    8567                            .dwattr $C$DW$383, DW_AT_bit_size(0x01)
    8568                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8569                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    8570                            .dwattr $C$DW$383, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8571                            .dwattr $C$DW$383, DW_AT_decl_line(0x13f)
    8572                            .dwattr $C$DW$383, DW_AT_decl_column(0x0e)
    8573                    
    8574                            .dwattr $C$DW$T$47, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8575                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x137)
    8576                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    8577                            .dwendtag $C$DW$T$47
    8578                    
    8579                    
    8580                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    8581                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    8582                    $C$DW$384       .dwtag  DW_TAG_member
    8583                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$32)
    8584                            .dwattr $C$DW$384, DW_AT_name("ISR")
    8585                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("ISR")
    8586                            .dwattr $C$DW$384, DW_AT_bit_offset(0x17)
    8587                            .dwattr $C$DW$384, DW_AT_bit_size(0x09)
    8588                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8589                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    8590                            .dwattr $C$DW$384, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8591                            .dwattr $C$DW$384, DW_AT_decl_line(0x15f)
    8592                            .dwattr $C$DW$384, DW_AT_decl_column(0x0e)
    8593                    
    8594                    $C$DW$385       .dwtag  DW_TAG_member
    8595                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$32)
    8596                            .dwattr $C$DW$385, DW_AT_name("_reserved0")
    8597                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("_reserved0")
    8598                            .dwattr $C$DW$385, DW_AT_bit_offset(0x00)
    8599                            .dwattr $C$DW$385, DW_AT_bit_size(0x17)
    8600                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  163

    8601                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    8602                            .dwattr $C$DW$385, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8603                            .dwattr $C$DW$385, DW_AT_decl_line(0x160)
    8604                            .dwattr $C$DW$385, DW_AT_decl_column(0x0e)
    8605                    
    8606                            .dwattr $C$DW$T$48, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8607                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x15e)
    8608                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    8609                            .dwendtag $C$DW$T$48
    8610                    
    8611                    
    8612                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    8613                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    8614                    $C$DW$386       .dwtag  DW_TAG_member
    8615                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$32)
    8616                            .dwattr $C$DW$386, DW_AT_name("ISR")
    8617                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("ISR")
    8618                            .dwattr $C$DW$386, DW_AT_bit_offset(0x17)
    8619                            .dwattr $C$DW$386, DW_AT_bit_size(0x09)
    8620                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8621                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    8622                            .dwattr $C$DW$386, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8623                            .dwattr $C$DW$386, DW_AT_decl_line(0x171)
    8624                            .dwattr $C$DW$386, DW_AT_decl_column(0x0e)
    8625                    
    8626                    $C$DW$387       .dwtag  DW_TAG_member
    8627                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$32)
    8628                            .dwattr $C$DW$387, DW_AT_name("_reserved0")
    8629                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("_reserved0")
    8630                            .dwattr $C$DW$387, DW_AT_bit_offset(0x10)
    8631                            .dwattr $C$DW$387, DW_AT_bit_size(0x07)
    8632                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8633                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    8634                            .dwattr $C$DW$387, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8635                            .dwattr $C$DW$387, DW_AT_decl_line(0x172)
    8636                            .dwattr $C$DW$387, DW_AT_decl_column(0x0e)
    8637                    
    8638                    $C$DW$388       .dwtag  DW_TAG_member
    8639                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$32)
    8640                            .dwattr $C$DW$388, DW_AT_name("GE")
    8641                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("GE")
    8642                            .dwattr $C$DW$388, DW_AT_bit_offset(0x0c)
    8643                            .dwattr $C$DW$388, DW_AT_bit_size(0x04)
    8644                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8645                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    8646                            .dwattr $C$DW$388, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8647                            .dwattr $C$DW$388, DW_AT_decl_line(0x173)
    8648                            .dwattr $C$DW$388, DW_AT_decl_column(0x0e)
    8649                    
    8650                    $C$DW$389       .dwtag  DW_TAG_member
    8651                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$32)
    8652                            .dwattr $C$DW$389, DW_AT_name("_reserved1")
    8653                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("_reserved1")
    8654                            .dwattr $C$DW$389, DW_AT_bit_offset(0x08)
    8655                            .dwattr $C$DW$389, DW_AT_bit_size(0x04)
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  164

    8656                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8657                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    8658                            .dwattr $C$DW$389, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8659                            .dwattr $C$DW$389, DW_AT_decl_line(0x174)
    8660                            .dwattr $C$DW$389, DW_AT_decl_column(0x0e)
    8661                    
    8662                    $C$DW$390       .dwtag  DW_TAG_member
    8663                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$32)
    8664                            .dwattr $C$DW$390, DW_AT_name("T")
    8665                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("T")
    8666                            .dwattr $C$DW$390, DW_AT_bit_offset(0x07)
    8667                            .dwattr $C$DW$390, DW_AT_bit_size(0x01)
    8668                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8669                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    8670                            .dwattr $C$DW$390, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8671                            .dwattr $C$DW$390, DW_AT_decl_line(0x175)
    8672                            .dwattr $C$DW$390, DW_AT_decl_column(0x0e)
    8673                    
    8674                    $C$DW$391       .dwtag  DW_TAG_member
    8675                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$32)
    8676                            .dwattr $C$DW$391, DW_AT_name("IT")
    8677                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("IT")
    8678                            .dwattr $C$DW$391, DW_AT_bit_offset(0x05)
    8679                            .dwattr $C$DW$391, DW_AT_bit_size(0x02)
    8680                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8681                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    8682                            .dwattr $C$DW$391, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8683                            .dwattr $C$DW$391, DW_AT_decl_line(0x176)
    8684                            .dwattr $C$DW$391, DW_AT_decl_column(0x0e)
    8685                    
    8686                    $C$DW$392       .dwtag  DW_TAG_member
    8687                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$32)
    8688                            .dwattr $C$DW$392, DW_AT_name("Q")
    8689                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("Q")
    8690                            .dwattr $C$DW$392, DW_AT_bit_offset(0x04)
    8691                            .dwattr $C$DW$392, DW_AT_bit_size(0x01)
    8692                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8693                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    8694                            .dwattr $C$DW$392, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8695                            .dwattr $C$DW$392, DW_AT_decl_line(0x177)
    8696                            .dwattr $C$DW$392, DW_AT_decl_column(0x0e)
    8697                    
    8698                    $C$DW$393       .dwtag  DW_TAG_member
    8699                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$32)
    8700                            .dwattr $C$DW$393, DW_AT_name("V")
    8701                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("V")
    8702                            .dwattr $C$DW$393, DW_AT_bit_offset(0x03)
    8703                            .dwattr $C$DW$393, DW_AT_bit_size(0x01)
    8704                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8705                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    8706                            .dwattr $C$DW$393, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8707                            .dwattr $C$DW$393, DW_AT_decl_line(0x178)
    8708                            .dwattr $C$DW$393, DW_AT_decl_column(0x0e)
    8709                    
    8710                    $C$DW$394       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  165

    8711                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$32)
    8712                            .dwattr $C$DW$394, DW_AT_name("C")
    8713                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("C")
    8714                            .dwattr $C$DW$394, DW_AT_bit_offset(0x02)
    8715                            .dwattr $C$DW$394, DW_AT_bit_size(0x01)
    8716                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8717                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    8718                            .dwattr $C$DW$394, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8719                            .dwattr $C$DW$394, DW_AT_decl_line(0x179)
    8720                            .dwattr $C$DW$394, DW_AT_decl_column(0x0e)
    8721                    
    8722                    $C$DW$395       .dwtag  DW_TAG_member
    8723                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$32)
    8724                            .dwattr $C$DW$395, DW_AT_name("Z")
    8725                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("Z")
    8726                            .dwattr $C$DW$395, DW_AT_bit_offset(0x01)
    8727                            .dwattr $C$DW$395, DW_AT_bit_size(0x01)
    8728                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8729                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    8730                            .dwattr $C$DW$395, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8731                            .dwattr $C$DW$395, DW_AT_decl_line(0x17a)
    8732                            .dwattr $C$DW$395, DW_AT_decl_column(0x0e)
    8733                    
    8734                    $C$DW$396       .dwtag  DW_TAG_member
    8735                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$32)
    8736                            .dwattr $C$DW$396, DW_AT_name("N")
    8737                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("N")
    8738                            .dwattr $C$DW$396, DW_AT_bit_offset(0x00)
    8739                            .dwattr $C$DW$396, DW_AT_bit_size(0x01)
    8740                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8741                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    8742                            .dwattr $C$DW$396, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8743                            .dwattr $C$DW$396, DW_AT_decl_line(0x17b)
    8744                            .dwattr $C$DW$396, DW_AT_decl_column(0x0e)
    8745                    
    8746                            .dwattr $C$DW$T$49, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    8747                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x170)
    8748                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    8749                            .dwendtag $C$DW$T$49
    8750                    
    8751                    
    8752                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    8753                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    8754                    $C$DW$397       .dwtag  DW_TAG_member
    8755                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$32)
    8756                            .dwattr $C$DW$397, DW_AT_name("nPRIV")
    8757                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("nPRIV")
    8758                            .dwattr $C$DW$397, DW_AT_bit_offset(0x1f)
    8759                            .dwattr $C$DW$397, DW_AT_bit_size(0x01)
    8760                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8761                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    8762                            .dwattr $C$DW$397, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    8763                            .dwattr $C$DW$397, DW_AT_decl_line(0x1a4)
    8764                            .dwattr $C$DW$397, DW_AT_decl_column(0x0e)
    8765                    
TI ARM Assembler Unix v16.9.0 Tue May  2 00:30:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE  166

    8766                    $C$DW$398       .dwtag  DW_TAG_member
    8767                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$32)
    8768                            .dwattr $C$DW$398, DW_AT_name("SPSEL")
    8769                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("SPSEL")
    8770                            .dwattr $C$DW$398, DW_AT_bit_offset(0x1e)
    8771                            .dwattr $C$DW$398, DW_AT_bit_size(0x01)
