;******************************************************************************
;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
;* Date/Time created: Tue May  2 00:29:59 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("_enable_interrupts")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_enable_interrupts")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwendtag $C$DW$1


$C$DW$2	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$2, DW_AT_name("ADC14_getResult")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("ADC14_getResult")
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$226)
	.dwattr $C$DW$2, DW_AT_declaration
	.dwattr $C$DW$2, DW_AT_external

;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:WDT_A_IRQHandler"
	.align	4
||$C$SL10||:	.string	"Choose pet 1 or 2",0
	.align	4
||$C$SL11||:	.string	"Doggy or Mametchi",0
	.align	4
||$C$SL12||:	.string	"Game Over: Reset",0
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:WDT_A_IRQHandler"
	.align	4
||$C$CON116||:	.bits	check,32
	.align	4
||$C$CON117||:	.bits	g_sContext,32
	.align	4
||$C$CON118||:	.bits	normal14BPP_UNCOMP,32
	.align	4
||$C$CON119||:	.bits	pet1_normal14BPP_UNCOMP,32
	.align	4
||$C$CON120||:	.bits	1073761344,32
	.align	4
||$C$CON121||:	.bits	choose_pet,32
	.align	4
||$C$CON122||:	.bits	dizzy,32
	.align	4
||$C$CON123||:	.bits	health,32
	.align	4
||$C$CON124||:	.bits	state,32
	.align	4
||$C$CON125||:	.bits	pet1_dead4BPP_UNCOMP,32
	.align	4
||$C$CON126||:	.bits	dead4BPP_UNCOMP,32
;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".text:PORT3_IRQHandler"
	.align	4
||$C$SL13||:	.string	"Option: poop",0
	.align	4
||$C$SL14||:	.string	"Option:sleep",0
	.align	4
||$C$SL15||:	.string	"Option: walk",0
	.align	4
||$C$SL16||:	.string	"Option: play",0
	.align	4
||$C$SL17||:	.string	"Option:  eat",0
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:PORT3_IRQHandler"
	.align	4
||$C$CON127||:	.bits	1073761312,32
	.align	4
||$C$CON128||:	.bits	selectScreenDebounce,32
	.align	4
||$C$CON129||:	.bits	state,32
	.align	4
||$C$CON130||:	.bits	g_sContext,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:ADC14_IRQHandler"
	.align	4
||$C$CON131||:	.bits	resultsBuffer,32
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	ADC14_getResult
	.global	CS_setDCOCenteredFrequency
	.global	Graphics_initContext
	.global	Graphics_drawImage
	.global	Graphics_drawString
	.global	Graphics_setBackgroundColor
	.global	Graphics_setFont
	.global	Graphics_setForegroundColor
	.global	Graphics_drawStringCentered
	.global	Graphics_clearDisplay
	.global	Crystalfontz128x128_Init
	.global	Crystalfontz128x128_SetOrientation
	.global	sprintf
	.global	g_sFontFixed6x8
	.global	g_sCrystalfontz128x128
	.global	g_sCrystalfontz128x128_funcs
	.global	eat14BPP_UNCOMP
	.global	eat24BPP_UNCOMP
	.global	eat34BPP_UNCOMP
	.global	happy14BPP_UNCOMP
	.global	happy24BPP_UNCOMP
	.global	happy34BPP_UNCOMP
	.global	normal14BPP_UNCOMP
	.global	normal24BPP_UNCOMP
	.global	normal34BPP_UNCOMP
	.global	unhappy14BPP_UNCOMP
	.global	unhappy24BPP_UNCOMP
	.global	unhappy34BPP_UNCOMP
	.global	walk14BPP_UNCOMP
	.global	walk24BPP_UNCOMP
	.global	walk34BPP_UNCOMP
	.global	play14BPP_UNCOMP
	.global	play24BPP_UNCOMP
	.global	play34BPP_UNCOMP
	.global	dizzy14BPP_UNCOMP
	.global	dizzy24BPP_UNCOMP
	.global	dead4BPP_UNCOMP
	.global	sleep14BPP_UNCOMP
	.global	sleep24BPP_UNCOMP
	.global	sleep34BPP_UNCOMP
	.global	poop14BPP_UNCOMP
	.global	poop24BPP_UNCOMP
	.global	pet1_eat14BPP_UNCOMP
	.global	pet1_eat24BPP_UNCOMP
	.global	pet1_eat34BPP_UNCOMP
	.global	pet1_happy14BPP_UNCOMP
	.global	pet1_happy24BPP_UNCOMP
	.global	pet1_happy34BPP_UNCOMP
	.global	pet1_normal14BPP_UNCOMP
	.global	pet1_normal24BPP_UNCOMP
	.global	pet1_normal34BPP_UNCOMP
	.global	pet1_unhappy14BPP_UNCOMP
	.global	pet1_unhappy24BPP_UNCOMP
	.global	pet1_unhappy34BPP_UNCOMP
	.global	pet1_walk14BPP_UNCOMP
	.global	pet1_walk24BPP_UNCOMP
	.global	pet1_walk34BPP_UNCOMP
	.global	pet1_play14BPP_UNCOMP
	.global	pet1_play24BPP_UNCOMP
	.global	pet1_play34BPP_UNCOMP
	.global	pet1_dizzy14BPP_UNCOMP
	.global	pet1_dizzy24BPP_UNCOMP
	.global	pet1_dead4BPP_UNCOMP
	.global	pet1_sleep14BPP_UNCOMP
	.global	pet1_sleep24BPP_UNCOMP
	.global	pet1_sleep34BPP_UNCOMP
	.global	pet1_poop14BPP_UNCOMP
	.global	pet1_poop24BPP_UNCOMP

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$306, DW_AT_name("IN")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("IN")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x27b)
	.dwattr $C$DW$306, DW_AT_decl_column(0x0f)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$307, DW_AT_name("RESERVED0")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x27c)
	.dwattr $C$DW$307, DW_AT_decl_column(0x0b)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$308, DW_AT_name("OUT")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("OUT")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x27d)
	.dwattr $C$DW$308, DW_AT_decl_column(0x10)

$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$309, DW_AT_name("RESERVED1")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x27e)
	.dwattr $C$DW$309, DW_AT_decl_column(0x0b)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$310, DW_AT_name("DIR")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("DIR")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x27f)
	.dwattr $C$DW$310, DW_AT_decl_column(0x10)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$311, DW_AT_name("RESERVED2")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x280)
	.dwattr $C$DW$311, DW_AT_decl_column(0x0b)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$312, DW_AT_name("REN")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("REN")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x281)
	.dwattr $C$DW$312, DW_AT_decl_column(0x10)

$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$313, DW_AT_name("RESERVED3")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x282)
	.dwattr $C$DW$313, DW_AT_decl_column(0x0b)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$314, DW_AT_name("DS")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("DS")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x283)
	.dwattr $C$DW$314, DW_AT_decl_column(0x10)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$315, DW_AT_name("RESERVED4")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x284)
	.dwattr $C$DW$315, DW_AT_decl_column(0x0b)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$316, DW_AT_name("SEL0")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("SEL0")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x285)
	.dwattr $C$DW$316, DW_AT_decl_column(0x10)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$317, DW_AT_name("RESERVED5")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x286)
	.dwattr $C$DW$317, DW_AT_decl_column(0x0b)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$318, DW_AT_name("SEL1")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("SEL1")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x287)
	.dwattr $C$DW$318, DW_AT_decl_column(0x10)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$319, DW_AT_name("RESERVED6")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("RESERVED6")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x288)
	.dwattr $C$DW$319, DW_AT_decl_column(0x0b)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$320, DW_AT_name("IV")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("IV")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x289)
	.dwattr $C$DW$320, DW_AT_decl_column(0x11)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$321, DW_AT_name("RESERVED7")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("RESERVED7")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x28a)
	.dwattr $C$DW$321, DW_AT_decl_column(0x0b)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$322, DW_AT_name("SELC")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("SELC")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x28b)
	.dwattr $C$DW$322, DW_AT_decl_column(0x10)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$323, DW_AT_name("RESERVED8")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("RESERVED8")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x28c)
	.dwattr $C$DW$323, DW_AT_decl_column(0x0b)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$324, DW_AT_name("IES")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("IES")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x28d)
	.dwattr $C$DW$324, DW_AT_decl_column(0x10)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$325, DW_AT_name("RESERVED9")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("RESERVED9")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x28e)
	.dwattr $C$DW$325, DW_AT_decl_column(0x0b)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$326, DW_AT_name("IE")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("IE")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x28f)
	.dwattr $C$DW$326, DW_AT_decl_column(0x10)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$327, DW_AT_name("RESERVED10")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("RESERVED10")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x290)
	.dwattr $C$DW$327, DW_AT_decl_column(0x0b)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$328, DW_AT_name("IFG")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("IFG")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x291)
	.dwattr $C$DW$328, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x27a)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$25

$C$DW$T$242	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$242, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
	.dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$242, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$242, DW_AT_decl_line(0x292)
	.dwattr $C$DW$T$242, DW_AT_decl_column(0x03)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$329, DW_AT_name("KEYID")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("KEYID")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x3e5)
	.dwattr $C$DW$329, DW_AT_decl_column(0x11)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$330, DW_AT_name("CTL")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("CTL")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x3e6)
	.dwattr $C$DW$330, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x3e4)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$27

$C$DW$T$244	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$244, DW_AT_name("PMAP_COMMON_Type")
	.dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$244, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$244, DW_AT_decl_line(0x3e7)
	.dwattr $C$DW$T$244, DW_AT_decl_column(0x03)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$331, DW_AT_name("PMAP_REGISTER0")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("PMAP_REGISTER0")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x3ed)
	.dwattr $C$DW$331, DW_AT_decl_column(0x14)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$332, DW_AT_name("PMAP_REGISTER1")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("PMAP_REGISTER1")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x3ee)
	.dwattr $C$DW$332, DW_AT_decl_column(0x14)

$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$333, DW_AT_name("PMAP_REGISTER2")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("PMAP_REGISTER2")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x3ef)
	.dwattr $C$DW$333, DW_AT_decl_column(0x14)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$334, DW_AT_name("PMAP_REGISTER3")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("PMAP_REGISTER3")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x3f0)
	.dwattr $C$DW$334, DW_AT_decl_column(0x14)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$335, DW_AT_name("PMAP_REGISTER4")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("PMAP_REGISTER4")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x3f1)
	.dwattr $C$DW$335, DW_AT_decl_column(0x14)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$336, DW_AT_name("PMAP_REGISTER5")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("PMAP_REGISTER5")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x3f2)
	.dwattr $C$DW$336, DW_AT_decl_column(0x14)

$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$337, DW_AT_name("PMAP_REGISTER6")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("PMAP_REGISTER6")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x3f3)
	.dwattr $C$DW$337, DW_AT_decl_column(0x14)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$338, DW_AT_name("PMAP_REGISTER7")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("PMAP_REGISTER7")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x3f4)
	.dwattr $C$DW$338, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x3ec)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$28


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$339, DW_AT_name("$P$T1")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("$P$T1")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x3ea)
	.dwattr $C$DW$339, DW_AT_decl_column(0x03)

	.dwattr $C$DW$T$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x3e9)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$29

$C$DW$T$246	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$246, DW_AT_name("PMAP_REGISTER_Type")
	.dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$246, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$246, DW_AT_decl_line(0x3f7)
	.dwattr $C$DW$T$246, DW_AT_decl_column(0x03)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$340, DW_AT_name("RESERVED0")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x513)
	.dwattr $C$DW$340, DW_AT_decl_column(0x11)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$341, DW_AT_name("CTL")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("CTL")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x514)
	.dwattr $C$DW$341, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x512)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

$C$DW$T$247	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$247, DW_AT_name("WDT_A_Type")
	.dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$247, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$247, DW_AT_decl_line(0x515)
	.dwattr $C$DW$T$247, DW_AT_decl_column(0x03)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x8c)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$342, DW_AT_name("CPUID")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("CPUID")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$342, DW_AT_decl_column(0x12)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$343, DW_AT_name("ICSR")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("ICSR")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$343, DW_AT_decl_column(0x12)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$344, DW_AT_name("VTOR")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("VTOR")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$344, DW_AT_decl_column(0x12)

$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$345, DW_AT_name("AIRCR")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("AIRCR")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$345, DW_AT_decl_column(0x12)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$346, DW_AT_name("SCR")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$346, DW_AT_decl_column(0x12)

$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$347, DW_AT_name("CCR")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("CCR")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$347, DW_AT_decl_column(0x12)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$348, DW_AT_name("SHP")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("SHP")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$348, DW_AT_decl_column(0x12)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$349, DW_AT_name("SHCSR")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("SHCSR")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$349, DW_AT_decl_column(0x12)

$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$350, DW_AT_name("CFSR")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("CFSR")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$350, DW_AT_decl_column(0x12)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$351, DW_AT_name("HFSR")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("HFSR")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$351, DW_AT_decl_column(0x12)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$352, DW_AT_name("DFSR")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("DFSR")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$352, DW_AT_decl_column(0x12)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$353, DW_AT_name("MMFAR")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("MMFAR")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$353, DW_AT_decl_column(0x12)

$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$354, DW_AT_name("BFAR")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("BFAR")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$354, DW_AT_decl_column(0x12)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$355, DW_AT_name("AFSR")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("AFSR")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$355, DW_AT_decl_column(0x12)

$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$356, DW_AT_name("PFR")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("PFR")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$356, DW_AT_decl_column(0x12)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$357, DW_AT_name("DFR")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("DFR")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$357, DW_AT_decl_column(0x12)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$358, DW_AT_name("ADR")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("ADR")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$358, DW_AT_decl_column(0x12)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$359, DW_AT_name("MMFR")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("MMFR")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$359, DW_AT_decl_column(0x12)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$360, DW_AT_name("ISAR")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("ISAR")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$360, DW_AT_decl_column(0x12)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$361, DW_AT_name("RESERVED0")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$361, DW_AT_decl_column(0x12)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$362, DW_AT_name("CPACR")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("CPACR")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$362, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$40

$C$DW$T$248	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$248, DW_AT_name("SCB_Type")
	.dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$248, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$248, DW_AT_decl_line(0x1fc)
	.dwattr $C$DW$T$248, DW_AT_decl_column(0x03)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0xe04)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$363, DW_AT_name("ISER")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("ISER")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$363, DW_AT_decl_column(0x12)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$364, DW_AT_name("RESERVED0")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$364, DW_AT_decl_column(0x12)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$365, DW_AT_name("ICER")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("ICER")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$365, DW_AT_decl_column(0x12)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$366, DW_AT_name("RSERVED1")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("RSERVED1")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$366, DW_AT_decl_column(0x12)

$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$367, DW_AT_name("ISPR")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("ISPR")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$367, DW_AT_decl_column(0x12)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$368, DW_AT_name("RESERVED2")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$368, DW_AT_decl_column(0x12)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$369, DW_AT_name("ICPR")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("ICPR")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$369, DW_AT_decl_column(0x12)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$370, DW_AT_name("RESERVED3")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$370, DW_AT_decl_column(0x12)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$371, DW_AT_name("IABR")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("IABR")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$371, DW_AT_decl_column(0x12)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$372, DW_AT_name("RESERVED4")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$372, DW_AT_decl_column(0x12)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$373, DW_AT_name("IP")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("IP")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$373, DW_AT_decl_column(0x12)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$374, DW_AT_name("RESERVED5")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$374, DW_AT_decl_column(0x12)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$375, DW_AT_name("STIR")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("STIR")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x1d1)
	.dwattr $C$DW$375, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

$C$DW$T$249	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$249, DW_AT_name("NVIC_Type")
	.dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$249, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$249, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$T$249, DW_AT_decl_column(0x04)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$376, DW_AT_name("_reserved0")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$376, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$376, DW_AT_bit_size(0x10)
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x138)
	.dwattr $C$DW$376, DW_AT_decl_column(0x0e)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$377, DW_AT_name("GE")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$377, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$377, DW_AT_bit_size(0x04)
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x139)
	.dwattr $C$DW$377, DW_AT_decl_column(0x0e)

$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$378, DW_AT_name("_reserved1")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$378, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$378, DW_AT_bit_size(0x07)
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$378, DW_AT_decl_column(0x0e)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$379, DW_AT_name("Q")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$379, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$379, DW_AT_bit_size(0x01)
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x13b)
	.dwattr $C$DW$379, DW_AT_decl_column(0x0e)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$380, DW_AT_name("V")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$380, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$380, DW_AT_bit_size(0x01)
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$380, DW_AT_decl_column(0x0e)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$381, DW_AT_name("C")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$381, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$381, DW_AT_bit_size(0x01)
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$381, DW_AT_decl_column(0x0e)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$382, DW_AT_name("Z")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$382, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$382, DW_AT_bit_size(0x01)
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$382, DW_AT_decl_column(0x0e)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$383, DW_AT_name("N")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$383, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$383, DW_AT_bit_size(0x01)
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$383, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$47, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x137)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$47


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$384, DW_AT_name("ISR")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$384, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$384, DW_AT_bit_size(0x09)
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$384, DW_AT_decl_column(0x0e)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$385, DW_AT_name("_reserved0")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$385, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$385, DW_AT_bit_size(0x17)
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x160)
	.dwattr $C$DW$385, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$48, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$48


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$386, DW_AT_name("ISR")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("ISR")
	.dwattr $C$DW$386, DW_AT_bit_offset(0x17)
	.dwattr $C$DW$386, DW_AT_bit_size(0x09)
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x171)
	.dwattr $C$DW$386, DW_AT_decl_column(0x0e)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$387, DW_AT_name("_reserved0")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$387, DW_AT_bit_offset(0x10)
	.dwattr $C$DW$387, DW_AT_bit_size(0x07)
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x172)
	.dwattr $C$DW$387, DW_AT_decl_column(0x0e)

$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$388, DW_AT_name("GE")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("GE")
	.dwattr $C$DW$388, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$388, DW_AT_bit_size(0x04)
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x173)
	.dwattr $C$DW$388, DW_AT_decl_column(0x0e)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$389, DW_AT_name("_reserved1")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_reserved1")
	.dwattr $C$DW$389, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$389, DW_AT_bit_size(0x04)
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x174)
	.dwattr $C$DW$389, DW_AT_decl_column(0x0e)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$390, DW_AT_name("T")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("T")
	.dwattr $C$DW$390, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$390, DW_AT_bit_size(0x01)
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x175)
	.dwattr $C$DW$390, DW_AT_decl_column(0x0e)

$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$391, DW_AT_name("IT")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("IT")
	.dwattr $C$DW$391, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$391, DW_AT_bit_size(0x02)
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x176)
	.dwattr $C$DW$391, DW_AT_decl_column(0x0e)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$392, DW_AT_name("Q")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("Q")
	.dwattr $C$DW$392, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$392, DW_AT_bit_size(0x01)
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x177)
	.dwattr $C$DW$392, DW_AT_decl_column(0x0e)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$393, DW_AT_name("V")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("V")
	.dwattr $C$DW$393, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$393, DW_AT_bit_size(0x01)
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x178)
	.dwattr $C$DW$393, DW_AT_decl_column(0x0e)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$394, DW_AT_name("C")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("C")
	.dwattr $C$DW$394, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$394, DW_AT_bit_size(0x01)
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x179)
	.dwattr $C$DW$394, DW_AT_decl_column(0x0e)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$395, DW_AT_name("Z")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("Z")
	.dwattr $C$DW$395, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$395, DW_AT_bit_size(0x01)
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$395, DW_AT_decl_column(0x0e)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$396, DW_AT_name("N")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$396, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$396, DW_AT_bit_size(0x01)
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$396, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$49, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x170)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$49


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$397, DW_AT_name("nPRIV")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("nPRIV")
	.dwattr $C$DW$397, DW_AT_bit_offset(0x1f)
	.dwattr $C$DW$397, DW_AT_bit_size(0x01)
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$397, DW_AT_decl_column(0x0e)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$398, DW_AT_name("SPSEL")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("SPSEL")
	.dwattr $C$DW$398, DW_AT_bit_offset(0x1e)
	.dwattr $C$DW$398, DW_AT_bit_size(0x01)
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$398, DW_AT_decl_column(0x0e)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$399, DW_AT_name("FPCA")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("FPCA")
	.dwattr $C$DW$399, DW_AT_bit_offset(0x1d)
	.dwattr $C$DW$399, DW_AT_bit_size(0x01)
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x1a6)
	.dwattr $C$DW$399, DW_AT_decl_column(0x0e)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$400, DW_AT_name("_reserved0")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_reserved0")
	.dwattr $C$DW$400, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$400, DW_AT_bit_size(0x1d)
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$400, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$50, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$50


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x0c)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$401, DW_AT_name("RESERVED0")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x2c2)
	.dwattr $C$DW$401, DW_AT_decl_column(0x12)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$402, DW_AT_name("ICTR")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("ICTR")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x2c3)
	.dwattr $C$DW$402, DW_AT_decl_column(0x12)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$403, DW_AT_name("ACTLR")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("ACTLR")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x2c4)
	.dwattr $C$DW$403, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$52, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x2c1)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$52

$C$DW$T$250	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$250, DW_AT_name("SCnSCB_Type")
	.dwattr $C$DW$T$250, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$250, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$250, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$250, DW_AT_decl_line(0x2c5)
	.dwattr $C$DW$T$250, DW_AT_decl_column(0x03)


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$404, DW_AT_name("CTRL")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x2ea)
	.dwattr $C$DW$404, DW_AT_decl_column(0x12)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$405, DW_AT_name("LOAD")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("LOAD")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x2eb)
	.dwattr $C$DW$405, DW_AT_decl_column(0x12)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$406, DW_AT_name("VAL")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("VAL")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x2ec)
	.dwattr $C$DW$406, DW_AT_decl_column(0x12)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$407, DW_AT_name("CALIB")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("CALIB")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x2ed)
	.dwattr $C$DW$407, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$53, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x2e9)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$53

$C$DW$T$251	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$251, DW_AT_name("SysTick_Type")
	.dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$251, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$251, DW_AT_decl_line(0x2ee)
	.dwattr $C$DW$T$251, DW_AT_decl_column(0x03)


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x1000)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$408, DW_AT_name("PORT")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("PORT")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x323)
	.dwattr $C$DW$408, DW_AT_decl_column(0x06)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$409, DW_AT_name("RESERVED0")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x324)
	.dwattr $C$DW$409, DW_AT_decl_column(0x12)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$410, DW_AT_name("TER")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("TER")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x325)
	.dwattr $C$DW$410, DW_AT_decl_column(0x12)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$411, DW_AT_name("RESERVED1")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x326)
	.dwattr $C$DW$411, DW_AT_decl_column(0x12)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$412, DW_AT_name("TPR")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("TPR")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x327)
	.dwattr $C$DW$412, DW_AT_decl_column(0x12)

$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$413, DW_AT_name("RESERVED2")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x328)
	.dwattr $C$DW$413, DW_AT_decl_column(0x12)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$414, DW_AT_name("TCR")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("TCR")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x329)
	.dwattr $C$DW$414, DW_AT_decl_column(0x12)

$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$415, DW_AT_name("RESERVED3")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x32a)
	.dwattr $C$DW$415, DW_AT_decl_column(0x12)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$416, DW_AT_name("IWR")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("IWR")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x32b)
	.dwattr $C$DW$416, DW_AT_decl_column(0x12)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$417, DW_AT_name("IRR")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("IRR")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x32c)
	.dwattr $C$DW$417, DW_AT_decl_column(0x12)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$418, DW_AT_name("IMCR")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("IMCR")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x32d)
	.dwattr $C$DW$418, DW_AT_decl_column(0x12)

$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$419, DW_AT_name("RESERVED4")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x32e)
	.dwattr $C$DW$419, DW_AT_decl_column(0x12)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$420, DW_AT_name("LAR")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("LAR")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x32f)
	.dwattr $C$DW$420, DW_AT_decl_column(0x12)

$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$421, DW_AT_name("LSR")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("LSR")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x330)
	.dwattr $C$DW$421, DW_AT_decl_column(0x12)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$422, DW_AT_name("RESERVED5")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb8]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x331)
	.dwattr $C$DW$422, DW_AT_decl_column(0x12)

$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$423, DW_AT_name("PID4")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("PID4")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd0]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x332)
	.dwattr $C$DW$423, DW_AT_decl_column(0x12)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$424, DW_AT_name("PID5")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("PID5")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd4]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0x333)
	.dwattr $C$DW$424, DW_AT_decl_column(0x12)

$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$425, DW_AT_name("PID6")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("PID6")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xfd8]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0x334)
	.dwattr $C$DW$425, DW_AT_decl_column(0x12)

$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$426, DW_AT_name("PID7")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("PID7")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xfdc]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0x335)
	.dwattr $C$DW$426, DW_AT_decl_column(0x12)

$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$427, DW_AT_name("PID0")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("PID0")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe0]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0x336)
	.dwattr $C$DW$427, DW_AT_decl_column(0x12)

$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$428, DW_AT_name("PID1")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("PID1")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe4]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0x337)
	.dwattr $C$DW$428, DW_AT_decl_column(0x12)

$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$429, DW_AT_name("PID2")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("PID2")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe8]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0x338)
	.dwattr $C$DW$429, DW_AT_decl_column(0x12)

$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$430, DW_AT_name("PID3")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("PID3")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xfec]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$430, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$430, DW_AT_decl_line(0x339)
	.dwattr $C$DW$430, DW_AT_decl_column(0x12)

$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$431, DW_AT_name("CID0")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("CID0")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xff0]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0x33a)
	.dwattr $C$DW$431, DW_AT_decl_column(0x12)

$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$432, DW_AT_name("CID1")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("CID1")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xff4]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0x33b)
	.dwattr $C$DW$432, DW_AT_decl_column(0x12)

$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$433, DW_AT_name("CID2")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("CID2")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xff8]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0x33c)
	.dwattr $C$DW$433, DW_AT_decl_column(0x12)

$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$434, DW_AT_name("CID3")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("CID3")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xffc]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0x33d)
	.dwattr $C$DW$434, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$61, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x31d)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$61

$C$DW$T$252	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$252, DW_AT_name("ITM_Type")
	.dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$252, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$252, DW_AT_decl_line(0x33e)
	.dwattr $C$DW$T$252, DW_AT_decl_column(0x03)


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x5c)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$435, DW_AT_name("CTRL")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("CTRL")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0x385)
	.dwattr $C$DW$435, DW_AT_decl_column(0x12)

$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$436, DW_AT_name("CYCCNT")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("CYCCNT")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0x386)
	.dwattr $C$DW$436, DW_AT_decl_column(0x12)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$437, DW_AT_name("CPICNT")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("CPICNT")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0x387)
	.dwattr $C$DW$437, DW_AT_decl_column(0x12)

$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$438, DW_AT_name("EXCCNT")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("EXCCNT")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0x388)
	.dwattr $C$DW$438, DW_AT_decl_column(0x12)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$439, DW_AT_name("SLEEPCNT")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("SLEEPCNT")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0x389)
	.dwattr $C$DW$439, DW_AT_decl_column(0x12)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$440, DW_AT_name("LSUCNT")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("LSUCNT")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x38a)
	.dwattr $C$DW$440, DW_AT_decl_column(0x12)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$441, DW_AT_name("FOLDCNT")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("FOLDCNT")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0x38b)
	.dwattr $C$DW$441, DW_AT_decl_column(0x12)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$442, DW_AT_name("PCSR")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("PCSR")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0x38c)
	.dwattr $C$DW$442, DW_AT_decl_column(0x12)

$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$443, DW_AT_name("COMP0")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("COMP0")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$443, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$443, DW_AT_decl_line(0x38d)
	.dwattr $C$DW$443, DW_AT_decl_column(0x12)

$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$444, DW_AT_name("MASK0")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("MASK0")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0x38e)
	.dwattr $C$DW$444, DW_AT_decl_column(0x12)

$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$445, DW_AT_name("FUNCTION0")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("FUNCTION0")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0x38f)
	.dwattr $C$DW$445, DW_AT_decl_column(0x12)

$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$446, DW_AT_name("RESERVED0")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0x390)
	.dwattr $C$DW$446, DW_AT_decl_column(0x12)

$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$447, DW_AT_name("COMP1")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("COMP1")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0x391)
	.dwattr $C$DW$447, DW_AT_decl_column(0x12)

$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$448, DW_AT_name("MASK1")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("MASK1")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0x392)
	.dwattr $C$DW$448, DW_AT_decl_column(0x12)

$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$449, DW_AT_name("FUNCTION1")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("FUNCTION1")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$449, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$449, DW_AT_decl_line(0x393)
	.dwattr $C$DW$449, DW_AT_decl_column(0x12)

$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$450, DW_AT_name("RESERVED1")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0x394)
	.dwattr $C$DW$450, DW_AT_decl_column(0x12)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$451, DW_AT_name("COMP2")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("COMP2")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0x395)
	.dwattr $C$DW$451, DW_AT_decl_column(0x12)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$452, DW_AT_name("MASK2")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("MASK2")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0x396)
	.dwattr $C$DW$452, DW_AT_decl_column(0x12)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$453, DW_AT_name("FUNCTION2")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("FUNCTION2")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0x397)
	.dwattr $C$DW$453, DW_AT_decl_column(0x12)

$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$454, DW_AT_name("RESERVED2")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0x398)
	.dwattr $C$DW$454, DW_AT_decl_column(0x12)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$455, DW_AT_name("COMP3")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("COMP3")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0x399)
	.dwattr $C$DW$455, DW_AT_decl_column(0x12)

$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$456, DW_AT_name("MASK3")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("MASK3")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x39a)
	.dwattr $C$DW$456, DW_AT_decl_column(0x12)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$457, DW_AT_name("FUNCTION3")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("FUNCTION3")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x39b)
	.dwattr $C$DW$457, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$62, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x384)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$62

$C$DW$T$253	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$253, DW_AT_name("DWT_Type")
	.dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$253, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$253, DW_AT_decl_line(0x39c)
	.dwattr $C$DW$T$253, DW_AT_decl_column(0x03)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0xfd0)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$458, DW_AT_name("SSPSR")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("SSPSR")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
