TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Sat Apr 29 07:00:42 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("_enable_interrupts")

    1975                    ;******************************************************************************
    1976                    ;* CONSTANT TABLE                                                             *
    1977                    ;******************************************************************************
    1978 00000088                   .sect   ".text:PORT3_IRQHandler"
    1979                            .align  4
    1980 00000086 00000074! ||$C$CON33||:   .bits   g_sContext,32
         0000008a 00000000 
    1981                            .align  4
    1982 0000008a 4C400000  ||$C$CON34||:   .bits   1073761344,32
         0000008e 00004000 
    1983                            .align  4
    1984 0000008e 00004000! ||$C$CON35||:   .bits   state,32
         00000092 00000000 
    1985                    ;******************************************************************************
    1986                    ;* CONSTANT TABLE                                                             *
    1987                    ;******************************************************************************
    1988 0000003a                   .sect   ".text:Display_happy"
    1989                            .align  4
    1990 0000003a 000046C0! ||$C$CON36||:   .bits   loop,32
         0000003e 00000000 
    1991                            .align  4
    1992 0000003e 00000000! ||$C$CON37||:   .bits   g_sContext,32
         00000042 00000000 
    1993                            .align  4
    1994 00000042 00000000! ||$C$CON38||:   .bits   happy34BPP_UNCOMP,32
         00000046 00000000 
    1995                            .align  4
    1996 00000046 00000000! ||$C$CON39||:   .bits   happy24BPP_UNCOMP,32
         0000004a 00000000 
    1997                            .align  4
    1998 0000004a 00000000! ||$C$CON40||:   .bits   happy14BPP_UNCOMP,32
         0000004e 00000000 
    1999                    ;*****************************************************************************
    2000                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    2001                    ;*****************************************************************************
    2002                            .global Graphics_initContext
    2003                            .global Graphics_drawImage
    2004                            .global Graphics_drawString
    2005                            .global Graphics_setBackgroundColor
    2006                            .global Graphics_setFont
    2007                            .global Graphics_setForegroundColor
    2008                            .global Graphics_drawStringCentered
    2009                            .global Graphics_clearDisplay
    2010                            .global Crystalfontz128x128_Init
    2011                            .global Crystalfontz128x128_SetOrientation
    2012                            .global sprintf
    2013                            .global g_sFontFixed6x8
    2014                            .global g_sCrystalfontz128x128
    2015                            .global g_sCrystalfontz128x128_funcs
    2016                            .global eat14BPP_UNCOMP
    2017                            .global happy14BPP_UNCOMP
    2018                            .global happy24BPP_UNCOMP
    2019                            .global happy34BPP_UNCOMP
    2020                            .global normal14BPP_UNCOMP
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   39

    2021                            .global unhappy14BPP_UNCOMP
    2022                            .global walk14BPP_UNCOMP
    2023                            .global play14BPP_UNCOMP
    2024                    
    2025                    ;******************************************************************************
    2026                    ;* BUILD ATTRIBUTES                                                           *
    2027                    ;******************************************************************************
    2028                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    2029                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    2030                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    2031                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    2032                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    2033                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
    2034                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
    2035                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    2036                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
    2037                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    2038                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    2039                    
    2040                    ;******************************************************************************
    2041                    ;* TYPE INFORMATION                                                           *
    2042                    ;******************************************************************************
    2043                    
    2044                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2045                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
    2046                    $C$DW$106       .dwtag  DW_TAG_member
    2047                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    2048                            .dwattr $C$DW$106, DW_AT_name("IN")
    2049                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("IN")
    2050                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2052                            .dwattr $C$DW$106, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2053                            .dwattr $C$DW$106, DW_AT_decl_line(0x27b)
    2054                            .dwattr $C$DW$106, DW_AT_decl_column(0x0f)
    2055                    
    2056                    $C$DW$107       .dwtag  DW_TAG_member
    2057                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2058                            .dwattr $C$DW$107, DW_AT_name("RESERVED0")
    2059                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RESERVED0")
    2060                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2061                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2062                            .dwattr $C$DW$107, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2063                            .dwattr $C$DW$107, DW_AT_decl_line(0x27c)
    2064                            .dwattr $C$DW$107, DW_AT_decl_column(0x0b)
    2065                    
    2066                    $C$DW$108       .dwtag  DW_TAG_member
    2067                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    2068                            .dwattr $C$DW$108, DW_AT_name("OUT")
    2069                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("OUT")
    2070                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2071                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2072                            .dwattr $C$DW$108, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2073                            .dwattr $C$DW$108, DW_AT_decl_line(0x27d)
    2074                            .dwattr $C$DW$108, DW_AT_decl_column(0x10)
    2075                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    2076                    $C$DW$109       .dwtag  DW_TAG_member
    2077                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2078                            .dwattr $C$DW$109, DW_AT_name("RESERVED1")
    2079                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("RESERVED1")
    2080                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2081                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2082                            .dwattr $C$DW$109, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2083                            .dwattr $C$DW$109, DW_AT_decl_line(0x27e)
    2084                            .dwattr $C$DW$109, DW_AT_decl_column(0x0b)
    2085                    
    2086                    $C$DW$110       .dwtag  DW_TAG_member
    2087                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    2088                            .dwattr $C$DW$110, DW_AT_name("DIR")
    2089                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("DIR")
    2090                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2091                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2092                            .dwattr $C$DW$110, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2093                            .dwattr $C$DW$110, DW_AT_decl_line(0x27f)
    2094                            .dwattr $C$DW$110, DW_AT_decl_column(0x10)
    2095                    
    2096                    $C$DW$111       .dwtag  DW_TAG_member
    2097                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2098                            .dwattr $C$DW$111, DW_AT_name("RESERVED2")
    2099                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("RESERVED2")
    2100                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2101                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2102                            .dwattr $C$DW$111, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2103                            .dwattr $C$DW$111, DW_AT_decl_line(0x280)
    2104                            .dwattr $C$DW$111, DW_AT_decl_column(0x0b)
    2105                    
    2106                    $C$DW$112       .dwtag  DW_TAG_member
    2107                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    2108                            .dwattr $C$DW$112, DW_AT_name("REN")
    2109                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("REN")
    2110                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2111                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2112                            .dwattr $C$DW$112, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2113                            .dwattr $C$DW$112, DW_AT_decl_line(0x281)
    2114                            .dwattr $C$DW$112, DW_AT_decl_column(0x10)
    2115                    
    2116                    $C$DW$113       .dwtag  DW_TAG_member
    2117                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2118                            .dwattr $C$DW$113, DW_AT_name("RESERVED3")
    2119                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("RESERVED3")
    2120                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2121                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2122                            .dwattr $C$DW$113, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2123                            .dwattr $C$DW$113, DW_AT_decl_line(0x282)
    2124                            .dwattr $C$DW$113, DW_AT_decl_column(0x0b)
    2125                    
    2126                    $C$DW$114       .dwtag  DW_TAG_member
    2127                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    2128                            .dwattr $C$DW$114, DW_AT_name("DS")
    2129                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("DS")
    2130                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    2131                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2132                            .dwattr $C$DW$114, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2133                            .dwattr $C$DW$114, DW_AT_decl_line(0x283)
    2134                            .dwattr $C$DW$114, DW_AT_decl_column(0x10)
    2135                    
    2136                    $C$DW$115       .dwtag  DW_TAG_member
    2137                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2138                            .dwattr $C$DW$115, DW_AT_name("RESERVED4")
    2139                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("RESERVED4")
    2140                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2141                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2142                            .dwattr $C$DW$115, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2143                            .dwattr $C$DW$115, DW_AT_decl_line(0x284)
    2144                            .dwattr $C$DW$115, DW_AT_decl_column(0x0b)
    2145                    
    2146                    $C$DW$116       .dwtag  DW_TAG_member
    2147                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    2148                            .dwattr $C$DW$116, DW_AT_name("SEL0")
    2149                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("SEL0")
    2150                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2151                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2152                            .dwattr $C$DW$116, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2153                            .dwattr $C$DW$116, DW_AT_decl_line(0x285)
    2154                            .dwattr $C$DW$116, DW_AT_decl_column(0x10)
    2155                    
    2156                    $C$DW$117       .dwtag  DW_TAG_member
    2157                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2158                            .dwattr $C$DW$117, DW_AT_name("RESERVED5")
    2159                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("RESERVED5")
    2160                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2161                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2162                            .dwattr $C$DW$117, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2163                            .dwattr $C$DW$117, DW_AT_decl_line(0x286)
    2164                            .dwattr $C$DW$117, DW_AT_decl_column(0x0b)
    2165                    
    2166                    $C$DW$118       .dwtag  DW_TAG_member
    2167                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    2168                            .dwattr $C$DW$118, DW_AT_name("SEL1")
    2169                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("SEL1")
    2170                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2171                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2172                            .dwattr $C$DW$118, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2173                            .dwattr $C$DW$118, DW_AT_decl_line(0x287)
    2174                            .dwattr $C$DW$118, DW_AT_decl_column(0x10)
    2175                    
    2176                    $C$DW$119       .dwtag  DW_TAG_member
    2177                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2178                            .dwattr $C$DW$119, DW_AT_name("RESERVED6")
    2179                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("RESERVED6")
    2180                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2181                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2182                            .dwattr $C$DW$119, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2183                            .dwattr $C$DW$119, DW_AT_decl_line(0x288)
    2184                            .dwattr $C$DW$119, DW_AT_decl_column(0x0b)
    2185                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    2186                    $C$DW$120       .dwtag  DW_TAG_member
    2187                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$23)
    2188                            .dwattr $C$DW$120, DW_AT_name("IV")
    2189                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("IV")
    2190                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2191                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2192                            .dwattr $C$DW$120, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2193                            .dwattr $C$DW$120, DW_AT_decl_line(0x289)
    2194                            .dwattr $C$DW$120, DW_AT_decl_column(0x11)
    2195                    
    2196                    $C$DW$121       .dwtag  DW_TAG_member
    2197                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$24)
    2198                            .dwattr $C$DW$121, DW_AT_name("RESERVED7")
    2199                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("RESERVED7")
    2200                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2201                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2202                            .dwattr $C$DW$121, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2203                            .dwattr $C$DW$121, DW_AT_decl_line(0x28a)
    2204                            .dwattr $C$DW$121, DW_AT_decl_column(0x0b)
    2205                    
    2206                    $C$DW$122       .dwtag  DW_TAG_member
    2207                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    2208                            .dwattr $C$DW$122, DW_AT_name("SELC")
    2209                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("SELC")
    2210                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2211                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2212                            .dwattr $C$DW$122, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2213                            .dwattr $C$DW$122, DW_AT_decl_line(0x28b)
    2214                            .dwattr $C$DW$122, DW_AT_decl_column(0x10)
    2215                    
    2216                    $C$DW$123       .dwtag  DW_TAG_member
    2217                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2218                            .dwattr $C$DW$123, DW_AT_name("RESERVED8")
    2219                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("RESERVED8")
    2220                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2221                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2222                            .dwattr $C$DW$123, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2223                            .dwattr $C$DW$123, DW_AT_decl_line(0x28c)
    2224                            .dwattr $C$DW$123, DW_AT_decl_column(0x0b)
    2225                    
    2226                    $C$DW$124       .dwtag  DW_TAG_member
    2227                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    2228                            .dwattr $C$DW$124, DW_AT_name("IES")
    2229                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("IES")
    2230                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2231                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2232                            .dwattr $C$DW$124, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2233                            .dwattr $C$DW$124, DW_AT_decl_line(0x28d)
    2234                            .dwattr $C$DW$124, DW_AT_decl_column(0x10)
    2235                    
    2236                    $C$DW$125       .dwtag  DW_TAG_member
    2237                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2238                            .dwattr $C$DW$125, DW_AT_name("RESERVED9")
    2239                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("RESERVED9")
    2240                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2241                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2242                            .dwattr $C$DW$125, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2243                            .dwattr $C$DW$125, DW_AT_decl_line(0x28e)
    2244                            .dwattr $C$DW$125, DW_AT_decl_column(0x0b)
    2245                    
    2246                    $C$DW$126       .dwtag  DW_TAG_member
    2247                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    2248                            .dwattr $C$DW$126, DW_AT_name("IE")
    2249                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("IE")
    2250                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2251                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2252                            .dwattr $C$DW$126, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2253                            .dwattr $C$DW$126, DW_AT_decl_line(0x28f)
    2254                            .dwattr $C$DW$126, DW_AT_decl_column(0x10)
    2255                    
    2256                    $C$DW$127       .dwtag  DW_TAG_member
    2257                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2258                            .dwattr $C$DW$127, DW_AT_name("RESERVED10")
    2259                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("RESERVED10")
    2260                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2261                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2262                            .dwattr $C$DW$127, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2263                            .dwattr $C$DW$127, DW_AT_decl_line(0x290)
    2264                            .dwattr $C$DW$127, DW_AT_decl_column(0x0b)
    2265                    
    2266                    $C$DW$128       .dwtag  DW_TAG_member
    2267                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    2268                            .dwattr $C$DW$128, DW_AT_name("IFG")
    2269                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("IFG")
    2270                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2271                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2272                            .dwattr $C$DW$128, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2273                            .dwattr $C$DW$128, DW_AT_decl_line(0x291)
    2274                            .dwattr $C$DW$128, DW_AT_decl_column(0x10)
    2275                    
    2276                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2277                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x27a)
    2278                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2279                            .dwendtag $C$DW$T$25
    2280                    
    2281                    $C$DW$T$242     .dwtag  DW_TAG_typedef
    2282                            .dwattr $C$DW$T$242, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    2283                            .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$25)
    2284                            .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    2285                            .dwattr $C$DW$T$242, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2286                            .dwattr $C$DW$T$242, DW_AT_decl_line(0x292)
    2287                            .dwattr $C$DW$T$242, DW_AT_decl_column(0x03)
    2288                    
    2289                    
    2290                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2291                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2292                    $C$DW$129       .dwtag  DW_TAG_member
    2293                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$26)
    2294                            .dwattr $C$DW$129, DW_AT_name("KEYID")
    2295                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("KEYID")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2296                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2297                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2298                            .dwattr $C$DW$129, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2299                            .dwattr $C$DW$129, DW_AT_decl_line(0x3e5)
    2300                            .dwattr $C$DW$129, DW_AT_decl_column(0x11)
    2301                    
    2302                    $C$DW$130       .dwtag  DW_TAG_member
    2303                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$26)
    2304                            .dwattr $C$DW$130, DW_AT_name("CTL")
    2305                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("CTL")
    2306                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2307                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2308                            .dwattr $C$DW$130, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2309                            .dwattr $C$DW$130, DW_AT_decl_line(0x3e6)
    2310                            .dwattr $C$DW$130, DW_AT_decl_column(0x11)
    2311                    
    2312                            .dwattr $C$DW$T$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2313                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3e4)
    2314                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2315                            .dwendtag $C$DW$T$27
    2316                    
    2317                    $C$DW$T$244     .dwtag  DW_TAG_typedef
    2318                            .dwattr $C$DW$T$244, DW_AT_name("PMAP_COMMON_Type")
    2319                            .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$27)
    2320                            .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    2321                            .dwattr $C$DW$T$244, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2322                            .dwattr $C$DW$T$244, DW_AT_decl_line(0x3e7)
    2323                            .dwattr $C$DW$T$244, DW_AT_decl_column(0x03)
    2324                    
    2325                    
    2326                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2327                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    2328                    $C$DW$131       .dwtag  DW_TAG_member
    2329                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
    2330                            .dwattr $C$DW$131, DW_AT_name("PMAP_REGISTER0")
    2331                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("PMAP_REGISTER0")
    2332                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2333                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2334                            .dwattr $C$DW$131, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2335                            .dwattr $C$DW$131, DW_AT_decl_line(0x3ed)
    2336                            .dwattr $C$DW$131, DW_AT_decl_column(0x14)
    2337                    
    2338                    $C$DW$132       .dwtag  DW_TAG_member
    2339                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
    2340                            .dwattr $C$DW$132, DW_AT_name("PMAP_REGISTER1")
    2341                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("PMAP_REGISTER1")
    2342                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2343                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2344                            .dwattr $C$DW$132, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2345                            .dwattr $C$DW$132, DW_AT_decl_line(0x3ee)
    2346                            .dwattr $C$DW$132, DW_AT_decl_column(0x14)
    2347                    
    2348                    $C$DW$133       .dwtag  DW_TAG_member
    2349                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    2350                            .dwattr $C$DW$133, DW_AT_name("PMAP_REGISTER2")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2351                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("PMAP_REGISTER2")
    2352                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2353                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2354                            .dwattr $C$DW$133, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2355                            .dwattr $C$DW$133, DW_AT_decl_line(0x3ef)
    2356                            .dwattr $C$DW$133, DW_AT_decl_column(0x14)
    2357                    
    2358                    $C$DW$134       .dwtag  DW_TAG_member
    2359                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    2360                            .dwattr $C$DW$134, DW_AT_name("PMAP_REGISTER3")
    2361                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("PMAP_REGISTER3")
    2362                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2363                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2364                            .dwattr $C$DW$134, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2365                            .dwattr $C$DW$134, DW_AT_decl_line(0x3f0)
    2366                            .dwattr $C$DW$134, DW_AT_decl_column(0x14)
    2367                    
    2368                    $C$DW$135       .dwtag  DW_TAG_member
    2369                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    2370                            .dwattr $C$DW$135, DW_AT_name("PMAP_REGISTER4")
    2371                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("PMAP_REGISTER4")
    2372                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2373                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2374                            .dwattr $C$DW$135, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2375                            .dwattr $C$DW$135, DW_AT_decl_line(0x3f1)
    2376                            .dwattr $C$DW$135, DW_AT_decl_column(0x14)
    2377                    
    2378                    $C$DW$136       .dwtag  DW_TAG_member
    2379                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2380                            .dwattr $C$DW$136, DW_AT_name("PMAP_REGISTER5")
    2381                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("PMAP_REGISTER5")
    2382                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2383                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$136, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2385                            .dwattr $C$DW$136, DW_AT_decl_line(0x3f2)
    2386                            .dwattr $C$DW$136, DW_AT_decl_column(0x14)
    2387                    
    2388                    $C$DW$137       .dwtag  DW_TAG_member
    2389                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    2390                            .dwattr $C$DW$137, DW_AT_name("PMAP_REGISTER6")
    2391                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("PMAP_REGISTER6")
    2392                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2393                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2394                            .dwattr $C$DW$137, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2395                            .dwattr $C$DW$137, DW_AT_decl_line(0x3f3)
    2396                            .dwattr $C$DW$137, DW_AT_decl_column(0x14)
    2397                    
    2398                    $C$DW$138       .dwtag  DW_TAG_member
    2399                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    2400                            .dwattr $C$DW$138, DW_AT_name("PMAP_REGISTER7")
    2401                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("PMAP_REGISTER7")
    2402                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2403                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$138, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2405                            .dwattr $C$DW$138, DW_AT_decl_line(0x3f4)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2406                            .dwattr $C$DW$138, DW_AT_decl_column(0x14)
    2407                    
    2408                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2409                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3ec)
    2410                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0c)
    2411                            .dwendtag $C$DW$T$28
    2412                    
    2413                    
    2414                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2415                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2416                    $C$DW$139       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$152)
    2418                            .dwattr $C$DW$139, DW_AT_name("$P$T1")
    2419                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("$P$T1")
    2420                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$139, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2423                            .dwattr $C$DW$139, DW_AT_decl_line(0x3ea)
    2424                            .dwattr $C$DW$139, DW_AT_decl_column(0x03)
    2425                    
    2426                            .dwattr $C$DW$T$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2427                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e9)
    2428                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2429                            .dwendtag $C$DW$T$29
    2430                    
    2431                    $C$DW$T$246     .dwtag  DW_TAG_typedef
    2432                            .dwattr $C$DW$T$246, DW_AT_name("PMAP_REGISTER_Type")
    2433                            .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$29)
    2434                            .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    2435                            .dwattr $C$DW$T$246, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2436                            .dwattr $C$DW$T$246, DW_AT_decl_line(0x3f7)
    2437                            .dwattr $C$DW$T$246, DW_AT_decl_column(0x03)
    2438                    
    2439                    
    2440                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2441                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x30)
    2442                    $C$DW$140       .dwtag  DW_TAG_member
    2443                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$26)
    2444                            .dwattr $C$DW$140, DW_AT_name("CTL")
    2445                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("CTL")
    2446                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2448                            .dwattr $C$DW$140, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2449                            .dwattr $C$DW$140, DW_AT_decl_line(0x4a1)
    2450                            .dwattr $C$DW$140, DW_AT_decl_column(0x11)
    2451                    
    2452                    $C$DW$141       .dwtag  DW_TAG_member
    2453                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$30)
    2454                            .dwattr $C$DW$141, DW_AT_name("CCTL")
    2455                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("CCTL")
    2456                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2457                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2458                            .dwattr $C$DW$141, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2459                            .dwattr $C$DW$141, DW_AT_decl_line(0x4a2)
    2460                            .dwattr $C$DW$141, DW_AT_decl_column(0x11)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2461                    
    2462                    $C$DW$142       .dwtag  DW_TAG_member
    2463                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$26)
    2464                            .dwattr $C$DW$142, DW_AT_name("R")
    2465                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("R")
    2466                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2467                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2468                            .dwattr $C$DW$142, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2469                            .dwattr $C$DW$142, DW_AT_decl_line(0x4a3)
    2470                            .dwattr $C$DW$142, DW_AT_decl_column(0x11)
    2471                    
    2472                    $C$DW$143       .dwtag  DW_TAG_member
    2473                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$30)
    2474                            .dwattr $C$DW$143, DW_AT_name("CCR")
    2475                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("CCR")
    2476                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2477                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2478                            .dwattr $C$DW$143, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2479                            .dwattr $C$DW$143, DW_AT_decl_line(0x4a4)
    2480                            .dwattr $C$DW$143, DW_AT_decl_column(0x11)
    2481                    
    2482                    $C$DW$144       .dwtag  DW_TAG_member
    2483                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$26)
    2484                            .dwattr $C$DW$144, DW_AT_name("EX0")
    2485                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("EX0")
    2486                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2487                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2488                            .dwattr $C$DW$144, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2489                            .dwattr $C$DW$144, DW_AT_decl_line(0x4a5)
    2490                            .dwattr $C$DW$144, DW_AT_decl_column(0x11)
    2491                    
    2492                    $C$DW$145       .dwtag  DW_TAG_member
    2493                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
    2494                            .dwattr $C$DW$145, DW_AT_name("RESERVED0")
    2495                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("RESERVED0")
    2496                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2497                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2498                            .dwattr $C$DW$145, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2499                            .dwattr $C$DW$145, DW_AT_decl_line(0x4a6)
    2500                            .dwattr $C$DW$145, DW_AT_decl_column(0x11)
    2501                    
    2502                    $C$DW$146       .dwtag  DW_TAG_member
    2503                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$23)
    2504                            .dwattr $C$DW$146, DW_AT_name("IV")
    2505                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("IV")
    2506                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2507                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2508                            .dwattr $C$DW$146, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2509                            .dwattr $C$DW$146, DW_AT_decl_line(0x4a7)
    2510                            .dwattr $C$DW$146, DW_AT_decl_column(0x11)
    2511                    
    2512                            .dwattr $C$DW$T$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2513                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x4a0)
    2514                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2515                            .dwendtag $C$DW$T$32
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   48

    2516                    
    2517                    $C$DW$T$247     .dwtag  DW_TAG_typedef
    2518                            .dwattr $C$DW$T$247, DW_AT_name("Timer_A_Type")
    2519                            .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$32)
    2520                            .dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C)
    2521                            .dwattr $C$DW$T$247, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2522                            .dwattr $C$DW$T$247, DW_AT_decl_line(0x4a8)
    2523                            .dwattr $C$DW$T$247, DW_AT_decl_column(0x03)
    2524                    
    2525                    
    2526                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2527                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x20)
    2528                    $C$DW$147       .dwtag  DW_TAG_member
    2529                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2530                            .dwattr $C$DW$147, DW_AT_name("RESERVED0")
    2531                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("RESERVED0")
    2532                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2534                            .dwattr $C$DW$147, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2535                            .dwattr $C$DW$147, DW_AT_decl_line(0x295)
    2536                            .dwattr $C$DW$147, DW_AT_decl_column(0x0b)
    2537                    
    2538                    $C$DW$148       .dwtag  DW_TAG_member
    2539                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    2540                            .dwattr $C$DW$148, DW_AT_name("IN")
    2541                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("IN")
    2542                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2543                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2544                            .dwattr $C$DW$148, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2545                            .dwattr $C$DW$148, DW_AT_decl_line(0x296)
    2546                            .dwattr $C$DW$148, DW_AT_decl_column(0x0f)
    2547                    
    2548                    $C$DW$149       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2550                            .dwattr $C$DW$149, DW_AT_name("RESERVED1")
    2551                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("RESERVED1")
    2552                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2553                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2554                            .dwattr $C$DW$149, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2555                            .dwattr $C$DW$149, DW_AT_decl_line(0x297)
    2556                            .dwattr $C$DW$149, DW_AT_decl_column(0x0b)
    2557                    
    2558                    $C$DW$150       .dwtag  DW_TAG_member
    2559                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    2560                            .dwattr $C$DW$150, DW_AT_name("OUT")
    2561                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("OUT")
    2562                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2563                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2564                            .dwattr $C$DW$150, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2565                            .dwattr $C$DW$150, DW_AT_decl_line(0x298)
    2566                            .dwattr $C$DW$150, DW_AT_decl_column(0x10)
    2567                    
    2568                    $C$DW$151       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2570                            .dwattr $C$DW$151, DW_AT_name("RESERVED2")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   49

    2571                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("RESERVED2")
    2572                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2573                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$151, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2575                            .dwattr $C$DW$151, DW_AT_decl_line(0x299)
    2576                            .dwattr $C$DW$151, DW_AT_decl_column(0x0b)
    2577                    
    2578                    $C$DW$152       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    2580                            .dwattr $C$DW$152, DW_AT_name("DIR")
    2581                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("DIR")
    2582                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2583                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2584                            .dwattr $C$DW$152, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2585                            .dwattr $C$DW$152, DW_AT_decl_line(0x29a)
    2586                            .dwattr $C$DW$152, DW_AT_decl_column(0x10)
    2587                    
    2588                    $C$DW$153       .dwtag  DW_TAG_member
    2589                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2590                            .dwattr $C$DW$153, DW_AT_name("RESERVED3")
    2591                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("RESERVED3")
    2592                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2593                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$153, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2595                            .dwattr $C$DW$153, DW_AT_decl_line(0x29b)
    2596                            .dwattr $C$DW$153, DW_AT_decl_column(0x0b)
    2597                    
    2598                    $C$DW$154       .dwtag  DW_TAG_member
    2599                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    2600                            .dwattr $C$DW$154, DW_AT_name("REN")
    2601                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("REN")
    2602                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2603                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2604                            .dwattr $C$DW$154, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2605                            .dwattr $C$DW$154, DW_AT_decl_line(0x29c)
    2606                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2607                    
    2608                    $C$DW$155       .dwtag  DW_TAG_member
    2609                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2610                            .dwattr $C$DW$155, DW_AT_name("RESERVED4")
    2611                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("RESERVED4")
    2612                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2613                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2614                            .dwattr $C$DW$155, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2615                            .dwattr $C$DW$155, DW_AT_decl_line(0x29d)
    2616                            .dwattr $C$DW$155, DW_AT_decl_column(0x0b)
    2617                    
    2618                    $C$DW$156       .dwtag  DW_TAG_member
    2619                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    2620                            .dwattr $C$DW$156, DW_AT_name("DS")
    2621                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("DS")
    2622                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2623                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2624                            .dwattr $C$DW$156, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2625                            .dwattr $C$DW$156, DW_AT_decl_line(0x29e)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   50

    2626                            .dwattr $C$DW$156, DW_AT_decl_column(0x10)
    2627                    
    2628                    $C$DW$157       .dwtag  DW_TAG_member
    2629                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2630                            .dwattr $C$DW$157, DW_AT_name("RESERVED5")
    2631                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("RESERVED5")
    2632                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2633                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2634                            .dwattr $C$DW$157, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2635                            .dwattr $C$DW$157, DW_AT_decl_line(0x29f)
    2636                            .dwattr $C$DW$157, DW_AT_decl_column(0x0b)
    2637                    
    2638                    $C$DW$158       .dwtag  DW_TAG_member
    2639                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    2640                            .dwattr $C$DW$158, DW_AT_name("SEL0")
    2641                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("SEL0")
    2642                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2643                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2644                            .dwattr $C$DW$158, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2645                            .dwattr $C$DW$158, DW_AT_decl_line(0x2a0)
    2646                            .dwattr $C$DW$158, DW_AT_decl_column(0x10)
    2647                    
    2648                    $C$DW$159       .dwtag  DW_TAG_member
    2649                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2650                            .dwattr $C$DW$159, DW_AT_name("RESERVED6")
    2651                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("RESERVED6")
    2652                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2653                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2654                            .dwattr $C$DW$159, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2655                            .dwattr $C$DW$159, DW_AT_decl_line(0x2a1)
    2656                            .dwattr $C$DW$159, DW_AT_decl_column(0x0b)
    2657                    
    2658                    $C$DW$160       .dwtag  DW_TAG_member
    2659                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    2660                            .dwattr $C$DW$160, DW_AT_name("SEL1")
    2661                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("SEL1")
    2662                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2663                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2664                            .dwattr $C$DW$160, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2665                            .dwattr $C$DW$160, DW_AT_decl_line(0x2a2)
    2666                            .dwattr $C$DW$160, DW_AT_decl_column(0x10)
    2667                    
    2668                    $C$DW$161       .dwtag  DW_TAG_member
    2669                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$33)
    2670                            .dwattr $C$DW$161, DW_AT_name("RESERVED7")
    2671                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("RESERVED7")
    2672                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2673                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2674                            .dwattr $C$DW$161, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2675                            .dwattr $C$DW$161, DW_AT_decl_line(0x2a3)
    2676                            .dwattr $C$DW$161, DW_AT_decl_column(0x0b)
    2677                    
    2678                    $C$DW$162       .dwtag  DW_TAG_member
    2679                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    2680                            .dwattr $C$DW$162, DW_AT_name("SELC")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   51

    2681                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("SELC")
    2682                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2683                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2684                            .dwattr $C$DW$162, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2685                            .dwattr $C$DW$162, DW_AT_decl_line(0x2a4)
    2686                            .dwattr $C$DW$162, DW_AT_decl_column(0x10)
    2687                    
    2688                    $C$DW$163       .dwtag  DW_TAG_member
    2689                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2690                            .dwattr $C$DW$163, DW_AT_name("RESERVED8")
    2691                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("RESERVED8")
    2692                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2693                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2694                            .dwattr $C$DW$163, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2695                            .dwattr $C$DW$163, DW_AT_decl_line(0x2a5)
    2696                            .dwattr $C$DW$163, DW_AT_decl_column(0x0b)
    2697                    
    2698                    $C$DW$164       .dwtag  DW_TAG_member
    2699                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    2700                            .dwattr $C$DW$164, DW_AT_name("IES")
    2701                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("IES")
    2702                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2703                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2704                            .dwattr $C$DW$164, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2705                            .dwattr $C$DW$164, DW_AT_decl_line(0x2a6)
    2706                            .dwattr $C$DW$164, DW_AT_decl_column(0x10)
    2707                    
    2708                    $C$DW$165       .dwtag  DW_TAG_member
    2709                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2710                            .dwattr $C$DW$165, DW_AT_name("RESERVED9")
    2711                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("RESERVED9")
    2712                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2713                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2714                            .dwattr $C$DW$165, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2715                            .dwattr $C$DW$165, DW_AT_decl_line(0x2a7)
    2716                            .dwattr $C$DW$165, DW_AT_decl_column(0x0b)
    2717                    
    2718                    $C$DW$166       .dwtag  DW_TAG_member
    2719                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    2720                            .dwattr $C$DW$166, DW_AT_name("IE")
    2721                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("IE")
    2722                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2723                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2724                            .dwattr $C$DW$166, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2725                            .dwattr $C$DW$166, DW_AT_decl_line(0x2a8)
    2726                            .dwattr $C$DW$166, DW_AT_decl_column(0x10)
    2727                    
    2728                    $C$DW$167       .dwtag  DW_TAG_member
    2729                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2730                            .dwattr $C$DW$167, DW_AT_name("RESERVED10")
    2731                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("RESERVED10")
    2732                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2733                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2734                            .dwattr $C$DW$167, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2735                            .dwattr $C$DW$167, DW_AT_decl_line(0x2a9)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   52

    2736                            .dwattr $C$DW$167, DW_AT_decl_column(0x0b)
    2737                    
    2738                    $C$DW$168       .dwtag  DW_TAG_member
    2739                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    2740                            .dwattr $C$DW$168, DW_AT_name("IFG")
    2741                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("IFG")
    2742                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2743                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2744                            .dwattr $C$DW$168, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2745                            .dwattr $C$DW$168, DW_AT_decl_line(0x2aa)
    2746                            .dwattr $C$DW$168, DW_AT_decl_column(0x10)
    2747                    
    2748                    $C$DW$169       .dwtag  DW_TAG_member
    2749                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    2750                            .dwattr $C$DW$169, DW_AT_name("IV")
    2751                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("IV")
    2752                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2753                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2754                            .dwattr $C$DW$169, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2755                            .dwattr $C$DW$169, DW_AT_decl_line(0x2ab)
    2756                            .dwattr $C$DW$169, DW_AT_decl_column(0x10)
    2757                    
    2758                            .dwattr $C$DW$T$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2759                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x294)
    2760                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    2761                            .dwendtag $C$DW$T$34
    2762                    
    2763                    $C$DW$T$249     .dwtag  DW_TAG_typedef
    2764                            .dwattr $C$DW$T$249, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    2765                            .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$34)
    2766                            .dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
    2767                            .dwattr $C$DW$T$249, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2768                            .dwattr $C$DW$T$249, DW_AT_decl_line(0x2ac)
    2769                            .dwattr $C$DW$T$249, DW_AT_decl_column(0x03)
    2770                    
    2771                    
    2772                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2773                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x0e)
    2774                    $C$DW$170       .dwtag  DW_TAG_member
    2775                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$31)
    2776                            .dwattr $C$DW$170, DW_AT_name("RESERVED0")
    2777                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("RESERVED0")
    2778                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2779                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2780                            .dwattr $C$DW$170, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2781                            .dwattr $C$DW$170, DW_AT_decl_line(0x513)
    2782                            .dwattr $C$DW$170, DW_AT_decl_column(0x11)
    2783                    
    2784                    $C$DW$171       .dwtag  DW_TAG_member
    2785                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$26)
    2786                            .dwattr $C$DW$171, DW_AT_name("CTL")
    2787                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("CTL")
    2788                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2789                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2790                            .dwattr $C$DW$171, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   53

    2791                            .dwattr $C$DW$171, DW_AT_decl_line(0x514)
    2792                            .dwattr $C$DW$171, DW_AT_decl_column(0x11)
    2793                    
    2794                            .dwattr $C$DW$T$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2795                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x512)
    2796                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2797                            .dwendtag $C$DW$T$35
    2798                    
    2799                    $C$DW$T$251     .dwtag  DW_TAG_typedef
    2800                            .dwattr $C$DW$T$251, DW_AT_name("WDT_A_Type")
    2801                            .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$35)
    2802                            .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    2803                            .dwattr $C$DW$T$251, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2804                            .dwattr $C$DW$T$251, DW_AT_decl_line(0x515)
    2805                            .dwattr $C$DW$T$251, DW_AT_decl_column(0x03)
    2806                    
    2807                    
    2808                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2809                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x8c)
    2810                    $C$DW$172       .dwtag  DW_TAG_member
    2811                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$37)
    2812                            .dwattr $C$DW$172, DW_AT_name("CPUID")
    2813                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("CPUID")
    2814                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2815                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2816                            .dwattr $C$DW$172, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2817                            .dwattr $C$DW$172, DW_AT_decl_line(0x1e7)
    2818                            .dwattr $C$DW$172, DW_AT_decl_column(0x12)
    2819                    
    2820                    $C$DW$173       .dwtag  DW_TAG_member
    2821                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$38)
    2822                            .dwattr $C$DW$173, DW_AT_name("ICSR")
    2823                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ICSR")
    2824                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2825                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2826                            .dwattr $C$DW$173, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2827                            .dwattr $C$DW$173, DW_AT_decl_line(0x1e8)
    2828                            .dwattr $C$DW$173, DW_AT_decl_column(0x12)
    2829                    
    2830                    $C$DW$174       .dwtag  DW_TAG_member
    2831                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$38)
    2832                            .dwattr $C$DW$174, DW_AT_name("VTOR")
    2833                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("VTOR")
    2834                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2835                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2836                            .dwattr $C$DW$174, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2837                            .dwattr $C$DW$174, DW_AT_decl_line(0x1e9)
    2838                            .dwattr $C$DW$174, DW_AT_decl_column(0x12)
    2839                    
    2840                    $C$DW$175       .dwtag  DW_TAG_member
    2841                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$38)
    2842                            .dwattr $C$DW$175, DW_AT_name("AIRCR")
    2843                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("AIRCR")
    2844                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2845                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   54

    2846                            .dwattr $C$DW$175, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2847                            .dwattr $C$DW$175, DW_AT_decl_line(0x1ea)
    2848                            .dwattr $C$DW$175, DW_AT_decl_column(0x12)
    2849                    
    2850                    $C$DW$176       .dwtag  DW_TAG_member
    2851                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$38)
    2852                            .dwattr $C$DW$176, DW_AT_name("SCR")
    2853                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("SCR")
    2854                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2855                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2856                            .dwattr $C$DW$176, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2857                            .dwattr $C$DW$176, DW_AT_decl_line(0x1eb)
    2858                            .dwattr $C$DW$176, DW_AT_decl_column(0x12)
    2859                    
    2860                    $C$DW$177       .dwtag  DW_TAG_member
    2861                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$38)
    2862                            .dwattr $C$DW$177, DW_AT_name("CCR")
    2863                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("CCR")
    2864                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2865                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2866                            .dwattr $C$DW$177, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2867                            .dwattr $C$DW$177, DW_AT_decl_line(0x1ec)
    2868                            .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    2869                    
    2870                    $C$DW$178       .dwtag  DW_TAG_member
    2871                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$39)
    2872                            .dwattr $C$DW$178, DW_AT_name("SHP")
    2873                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("SHP")
    2874                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2875                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2876                            .dwattr $C$DW$178, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2877                            .dwattr $C$DW$178, DW_AT_decl_line(0x1ed)
    2878                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    2879                    
    2880                    $C$DW$179       .dwtag  DW_TAG_member
    2881                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$38)
    2882                            .dwattr $C$DW$179, DW_AT_name("SHCSR")
    2883                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("SHCSR")
    2884                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2885                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2886                            .dwattr $C$DW$179, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2887                            .dwattr $C$DW$179, DW_AT_decl_line(0x1ee)
    2888                            .dwattr $C$DW$179, DW_AT_decl_column(0x12)
    2889                    
    2890                    $C$DW$180       .dwtag  DW_TAG_member
    2891                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$38)
    2892                            .dwattr $C$DW$180, DW_AT_name("CFSR")
    2893                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("CFSR")
    2894                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2895                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2896                            .dwattr $C$DW$180, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2897                            .dwattr $C$DW$180, DW_AT_decl_line(0x1ef)
    2898                            .dwattr $C$DW$180, DW_AT_decl_column(0x12)
    2899                    
    2900                    $C$DW$181       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   55

    2901                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$38)
    2902                            .dwattr $C$DW$181, DW_AT_name("HFSR")
    2903                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("HFSR")
    2904                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2905                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2906                            .dwattr $C$DW$181, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2907                            .dwattr $C$DW$181, DW_AT_decl_line(0x1f0)
    2908                            .dwattr $C$DW$181, DW_AT_decl_column(0x12)
    2909                    
    2910                    $C$DW$182       .dwtag  DW_TAG_member
    2911                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$38)
    2912                            .dwattr $C$DW$182, DW_AT_name("DFSR")
    2913                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("DFSR")
    2914                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2915                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2916                            .dwattr $C$DW$182, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2917                            .dwattr $C$DW$182, DW_AT_decl_line(0x1f1)
    2918                            .dwattr $C$DW$182, DW_AT_decl_column(0x12)
    2919                    
    2920                    $C$DW$183       .dwtag  DW_TAG_member
    2921                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$38)
    2922                            .dwattr $C$DW$183, DW_AT_name("MMFAR")
    2923                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("MMFAR")
    2924                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2925                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2926                            .dwattr $C$DW$183, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2927                            .dwattr $C$DW$183, DW_AT_decl_line(0x1f2)
    2928                            .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    2929                    
    2930                    $C$DW$184       .dwtag  DW_TAG_member
    2931                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$38)
    2932                            .dwattr $C$DW$184, DW_AT_name("BFAR")
    2933                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("BFAR")
    2934                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2935                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2936                            .dwattr $C$DW$184, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2937                            .dwattr $C$DW$184, DW_AT_decl_line(0x1f3)
    2938                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    2939                    
    2940                    $C$DW$185       .dwtag  DW_TAG_member
    2941                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$38)
    2942                            .dwattr $C$DW$185, DW_AT_name("AFSR")
    2943                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("AFSR")
    2944                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2945                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2946                            .dwattr $C$DW$185, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2947                            .dwattr $C$DW$185, DW_AT_decl_line(0x1f4)
    2948                            .dwattr $C$DW$185, DW_AT_decl_column(0x12)
    2949                    
    2950                    $C$DW$186       .dwtag  DW_TAG_member
    2951                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    2952                            .dwattr $C$DW$186, DW_AT_name("PFR")
    2953                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("PFR")
    2954                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2955                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   56

    2956                            .dwattr $C$DW$186, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2957                            .dwattr $C$DW$186, DW_AT_decl_line(0x1f5)
    2958                            .dwattr $C$DW$186, DW_AT_decl_column(0x12)
    2959                    
    2960                    $C$DW$187       .dwtag  DW_TAG_member
    2961                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$37)
    2962                            .dwattr $C$DW$187, DW_AT_name("DFR")
    2963                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("DFR")
    2964                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2965                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2966                            .dwattr $C$DW$187, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2967                            .dwattr $C$DW$187, DW_AT_decl_line(0x1f6)
    2968                            .dwattr $C$DW$187, DW_AT_decl_column(0x12)
    2969                    
    2970                    $C$DW$188       .dwtag  DW_TAG_member
    2971                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$37)
    2972                            .dwattr $C$DW$188, DW_AT_name("ADR")
    2973                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ADR")
    2974                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2975                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2976                            .dwattr $C$DW$188, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2977                            .dwattr $C$DW$188, DW_AT_decl_line(0x1f7)
    2978                            .dwattr $C$DW$188, DW_AT_decl_column(0x12)
    2979                    
    2980                    $C$DW$189       .dwtag  DW_TAG_member
    2981                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$41)
    2982                            .dwattr $C$DW$189, DW_AT_name("MMFR")
    2983                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("MMFR")
    2984                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2985                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2986                            .dwattr $C$DW$189, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2987                            .dwattr $C$DW$189, DW_AT_decl_line(0x1f8)
    2988                            .dwattr $C$DW$189, DW_AT_decl_column(0x12)
    2989                    
    2990                    $C$DW$190       .dwtag  DW_TAG_member
    2991                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$42)
    2992                            .dwattr $C$DW$190, DW_AT_name("ISAR")
    2993                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ISAR")
    2994                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2995                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2996                            .dwattr $C$DW$190, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2997                            .dwattr $C$DW$190, DW_AT_decl_line(0x1f9)
    2998                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    2999                    
    3000                    $C$DW$191       .dwtag  DW_TAG_member
    3001                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$43)
    3002                            .dwattr $C$DW$191, DW_AT_name("RESERVED0")
    3003                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("RESERVED0")
    3004                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3005                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3006                            .dwattr $C$DW$191, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3007                            .dwattr $C$DW$191, DW_AT_decl_line(0x1fa)
    3008                            .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    3009                    
    3010                    $C$DW$192       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   57

    3011                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$38)
    3012                            .dwattr $C$DW$192, DW_AT_name("CPACR")
    3013                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("CPACR")
    3014                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3015                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3016                            .dwattr $C$DW$192, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3017                            .dwattr $C$DW$192, DW_AT_decl_line(0x1fb)
    3018                            .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    3019                    
    3020                            .dwattr $C$DW$T$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3021                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x1e6)
    3022                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    3023                            .dwendtag $C$DW$T$44
    3024                    
    3025                    $C$DW$T$253     .dwtag  DW_TAG_typedef
    3026                            .dwattr $C$DW$T$253, DW_AT_name("SCB_Type")
    3027                            .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$44)
    3028                            .dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
    3029                            .dwattr $C$DW$T$253, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    3030                            .dwattr $C$DW$T$253, DW_AT_decl_line(0x1fc)
    3031                            .dwattr $C$DW$T$253, DW_AT_decl_column(0x03)
    3032                    
    3033                    
    3034                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3035                            .dwattr $C$DW$T$50, DW_AT_byte_size(0xe04)
    3036                    $C$DW$193       .dwtag  DW_TAG_member
    3037                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$45)
    3038                            .dwattr $C$DW$193, DW_AT_name("ISER")
    3039                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("ISER")
    3040                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3042                            .dwattr $C$DW$193, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3043                            .dwattr $C$DW$193, DW_AT_decl_line(0x1c5)
    3044                            .dwattr $C$DW$193, DW_AT_decl_column(0x12)
    3045                    
    3046                    $C$DW$194       .dwtag  DW_TAG_member
    3047                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$46)
    3048                            .dwattr $C$DW$194, DW_AT_name("RESERVED0")
    3049                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("RESERVED0")
    3050                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3051                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3052                            .dwattr $C$DW$194, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3053                            .dwattr $C$DW$194, DW_AT_decl_line(0x1c6)
    3054                            .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    3055                    
    3056                    $C$DW$195       .dwtag  DW_TAG_member
    3057                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$45)
    3058                            .dwattr $C$DW$195, DW_AT_name("ICER")
    3059                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ICER")
    3060                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3061                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3062                            .dwattr $C$DW$195, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3063                            .dwattr $C$DW$195, DW_AT_decl_line(0x1c7)
    3064                            .dwattr $C$DW$195, DW_AT_decl_column(0x12)
    3065                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   58

    3066                    $C$DW$196       .dwtag  DW_TAG_member
    3067                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$46)
    3068                            .dwattr $C$DW$196, DW_AT_name("RSERVED1")
    3069                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("RSERVED1")
    3070                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3071                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3072                            .dwattr $C$DW$196, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3073                            .dwattr $C$DW$196, DW_AT_decl_line(0x1c8)
    3074                            .dwattr $C$DW$196, DW_AT_decl_column(0x12)
    3075                    
    3076                    $C$DW$197       .dwtag  DW_TAG_member
    3077                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$45)
    3078                            .dwattr $C$DW$197, DW_AT_name("ISPR")
    3079                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("ISPR")
    3080                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3081                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3082                            .dwattr $C$DW$197, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3083                            .dwattr $C$DW$197, DW_AT_decl_line(0x1c9)
    3084                            .dwattr $C$DW$197, DW_AT_decl_column(0x12)
    3085                    
    3086                    $C$DW$198       .dwtag  DW_TAG_member
    3087                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$46)
    3088                            .dwattr $C$DW$198, DW_AT_name("RESERVED2")
    3089                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("RESERVED2")
    3090                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3091                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3092                            .dwattr $C$DW$198, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3093                            .dwattr $C$DW$198, DW_AT_decl_line(0x1ca)
    3094                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    3095                    
    3096                    $C$DW$199       .dwtag  DW_TAG_member
    3097                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$45)
    3098                            .dwattr $C$DW$199, DW_AT_name("ICPR")
    3099                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("ICPR")
    3100                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    3101                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3102                            .dwattr $C$DW$199, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3103                            .dwattr $C$DW$199, DW_AT_decl_line(0x1cb)
    3104                            .dwattr $C$DW$199, DW_AT_decl_column(0x12)
    3105                    
    3106                    $C$DW$200       .dwtag  DW_TAG_member
    3107                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$46)
    3108                            .dwattr $C$DW$200, DW_AT_name("RESERVED3")
    3109                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("RESERVED3")
    3110                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    3111                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3112                            .dwattr $C$DW$200, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3113                            .dwattr $C$DW$200, DW_AT_decl_line(0x1cc)
    3114                            .dwattr $C$DW$200, DW_AT_decl_column(0x12)
    3115                    
    3116                    $C$DW$201       .dwtag  DW_TAG_member
    3117                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$45)
    3118                            .dwattr $C$DW$201, DW_AT_name("IABR")
    3119                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("IABR")
    3120                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 07:00:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   59

    3121                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3122                            .dwattr $C$DW$201, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3123                            .dwattr $C$DW$201, DW_AT_decl_line(0x1cd)
    3124                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
    3125                    
    3126                    $C$DW$202       .dwtag  DW_TAG_member
    3127                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$47)
    3128                            .dwattr $C$DW$202, DW_AT_name("RESERVED4")
    3129                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("RESERVED4")
    3130                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    3131                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3132                            .dwattr $C$DW$202, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3133                            .dwattr $C$DW$202, DW_AT_decl_line(0x1ce)
    3134                            .dwattr $C$DW$202, DW_AT_decl_column(0x12)
    3135                    
    3136                    $C$DW$203       .dwtag  DW_TAG_member
