TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Sat Apr 29 13:25:11 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("_enable_interrupts")

    2024 00000088                   .sect   ".text:PORT3_IRQHandler"
    2025                            .align  4
    2026 00000086 00000074! ||$C$CON32||:   .bits   g_sContext,32
         0000008a 00000000 
    2027                            .align  4
    2028 0000008a 4C400000  ||$C$CON33||:   .bits   1073761344,32
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   39

         0000008e 00004000 
    2029                            .align  4
    2030 0000008e 00004000! ||$C$CON34||:   .bits   state,32
         00000092 00000000 
    2031                    ;******************************************************************************
    2032                    ;* CONSTANT TABLE                                                             *
    2033                    ;******************************************************************************
    2034 0000003a                   .sect   ".text:Display_happy"
    2035                            .align  4
    2036 0000003a 000046C0! ||$C$CON35||:   .bits   loop,32
         0000003e 00000000 
    2037                            .align  4
    2038 0000003e 00000000! ||$C$CON36||:   .bits   g_sContext,32
         00000042 00000000 
    2039                            .align  4
    2040 00000042 00000000! ||$C$CON37||:   .bits   happy34BPP_UNCOMP,32
         00000046 00000000 
    2041                            .align  4
    2042 00000046 00000000! ||$C$CON38||:   .bits   happy24BPP_UNCOMP,32
         0000004a 00000000 
    2043                            .align  4
    2044 0000004a 00000000! ||$C$CON40||:   .bits   happy14BPP_UNCOMP,32
         0000004e 00000000 
    2045                    ;*****************************************************************************
    2046                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    2047                    ;*****************************************************************************
    2048                            .global CS_setDCOCenteredFrequency
    2049                            .global Graphics_initContext
    2050                            .global Graphics_drawImage
    2051                            .global Graphics_drawString
    2052                            .global Graphics_setBackgroundColor
    2053                            .global Graphics_setFont
    2054                            .global Graphics_setForegroundColor
    2055                            .global Graphics_drawStringCentered
    2056                            .global Graphics_clearDisplay
    2057                            .global Crystalfontz128x128_Init
    2058                            .global Crystalfontz128x128_SetOrientation
    2059                            .global sprintf
    2060                            .global g_sFontFixed6x8
    2061                            .global g_sCrystalfontz128x128
    2062                            .global g_sCrystalfontz128x128_funcs
    2063                            .global eat14BPP_UNCOMP
    2064                            .global happy14BPP_UNCOMP
    2065                            .global happy24BPP_UNCOMP
    2066                            .global happy34BPP_UNCOMP
    2067                            .global normal14BPP_UNCOMP
    2068                            .global unhappy14BPP_UNCOMP
    2069                            .global walk14BPP_UNCOMP
    2070                            .global play14BPP_UNCOMP
    2071                    
    2072                    ;******************************************************************************
    2073                    ;* BUILD ATTRIBUTES                                                           *
    2074                    ;******************************************************************************
    2075                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    2076                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    2077                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    2078                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    2079                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    2080                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
    2081                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
    2082                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    2083                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
    2084                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    2085                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    2086                    
    2087                    ;******************************************************************************
    2088                    ;* TYPE INFORMATION                                                           *
    2089                    ;******************************************************************************
    2090                    
    2091                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2092                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
    2093                    $C$DW$111       .dwtag  DW_TAG_member
    2094                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    2095                            .dwattr $C$DW$111, DW_AT_name("IN")
    2096                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("IN")
    2097                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2098                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2099                            .dwattr $C$DW$111, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2100                            .dwattr $C$DW$111, DW_AT_decl_line(0x27b)
    2101                            .dwattr $C$DW$111, DW_AT_decl_column(0x0f)
    2102                    
    2103                    $C$DW$112       .dwtag  DW_TAG_member
    2104                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2105                            .dwattr $C$DW$112, DW_AT_name("RESERVED0")
    2106                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("RESERVED0")
    2107                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2108                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2109                            .dwattr $C$DW$112, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2110                            .dwattr $C$DW$112, DW_AT_decl_line(0x27c)
    2111                            .dwattr $C$DW$112, DW_AT_decl_column(0x0b)
    2112                    
    2113                    $C$DW$113       .dwtag  DW_TAG_member
    2114                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    2115                            .dwattr $C$DW$113, DW_AT_name("OUT")
    2116                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("OUT")
    2117                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2118                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2119                            .dwattr $C$DW$113, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2120                            .dwattr $C$DW$113, DW_AT_decl_line(0x27d)
    2121                            .dwattr $C$DW$113, DW_AT_decl_column(0x10)
    2122                    
    2123                    $C$DW$114       .dwtag  DW_TAG_member
    2124                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2125                            .dwattr $C$DW$114, DW_AT_name("RESERVED1")
    2126                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("RESERVED1")
    2127                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2128                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2129                            .dwattr $C$DW$114, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2130                            .dwattr $C$DW$114, DW_AT_decl_line(0x27e)
    2131                            .dwattr $C$DW$114, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    2132                    
    2133                    $C$DW$115       .dwtag  DW_TAG_member
    2134                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    2135                            .dwattr $C$DW$115, DW_AT_name("DIR")
    2136                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("DIR")
    2137                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2138                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2139                            .dwattr $C$DW$115, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2140                            .dwattr $C$DW$115, DW_AT_decl_line(0x27f)
    2141                            .dwattr $C$DW$115, DW_AT_decl_column(0x10)
    2142                    
    2143                    $C$DW$116       .dwtag  DW_TAG_member
    2144                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2145                            .dwattr $C$DW$116, DW_AT_name("RESERVED2")
    2146                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("RESERVED2")
    2147                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2148                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2149                            .dwattr $C$DW$116, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2150                            .dwattr $C$DW$116, DW_AT_decl_line(0x280)
    2151                            .dwattr $C$DW$116, DW_AT_decl_column(0x0b)
    2152                    
    2153                    $C$DW$117       .dwtag  DW_TAG_member
    2154                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    2155                            .dwattr $C$DW$117, DW_AT_name("REN")
    2156                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("REN")
    2157                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2158                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2159                            .dwattr $C$DW$117, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2160                            .dwattr $C$DW$117, DW_AT_decl_line(0x281)
    2161                            .dwattr $C$DW$117, DW_AT_decl_column(0x10)
    2162                    
    2163                    $C$DW$118       .dwtag  DW_TAG_member
    2164                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2165                            .dwattr $C$DW$118, DW_AT_name("RESERVED3")
    2166                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("RESERVED3")
    2167                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2168                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2169                            .dwattr $C$DW$118, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2170                            .dwattr $C$DW$118, DW_AT_decl_line(0x282)
    2171                            .dwattr $C$DW$118, DW_AT_decl_column(0x0b)
    2172                    
    2173                    $C$DW$119       .dwtag  DW_TAG_member
    2174                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$21)
    2175                            .dwattr $C$DW$119, DW_AT_name("DS")
    2176                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("DS")
    2177                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2178                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2179                            .dwattr $C$DW$119, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2180                            .dwattr $C$DW$119, DW_AT_decl_line(0x283)
    2181                            .dwattr $C$DW$119, DW_AT_decl_column(0x10)
    2182                    
    2183                    $C$DW$120       .dwtag  DW_TAG_member
    2184                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2185                            .dwattr $C$DW$120, DW_AT_name("RESERVED4")
    2186                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("RESERVED4")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    2187                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2188                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2189                            .dwattr $C$DW$120, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2190                            .dwattr $C$DW$120, DW_AT_decl_line(0x284)
    2191                            .dwattr $C$DW$120, DW_AT_decl_column(0x0b)
    2192                    
    2193                    $C$DW$121       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    2195                            .dwattr $C$DW$121, DW_AT_name("SEL0")
    2196                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("SEL0")
    2197                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2198                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$121, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2200                            .dwattr $C$DW$121, DW_AT_decl_line(0x285)
    2201                            .dwattr $C$DW$121, DW_AT_decl_column(0x10)
    2202                    
    2203                    $C$DW$122       .dwtag  DW_TAG_member
    2204                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2205                            .dwattr $C$DW$122, DW_AT_name("RESERVED5")
    2206                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("RESERVED5")
    2207                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2208                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2209                            .dwattr $C$DW$122, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2210                            .dwattr $C$DW$122, DW_AT_decl_line(0x286)
    2211                            .dwattr $C$DW$122, DW_AT_decl_column(0x0b)
    2212                    
    2213                    $C$DW$123       .dwtag  DW_TAG_member
    2214                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    2215                            .dwattr $C$DW$123, DW_AT_name("SEL1")
    2216                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("SEL1")
    2217                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2218                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2219                            .dwattr $C$DW$123, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2220                            .dwattr $C$DW$123, DW_AT_decl_line(0x287)
    2221                            .dwattr $C$DW$123, DW_AT_decl_column(0x10)
    2222                    
    2223                    $C$DW$124       .dwtag  DW_TAG_member
    2224                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2225                            .dwattr $C$DW$124, DW_AT_name("RESERVED6")
    2226                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("RESERVED6")
    2227                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2228                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2229                            .dwattr $C$DW$124, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2230                            .dwattr $C$DW$124, DW_AT_decl_line(0x288)
    2231                            .dwattr $C$DW$124, DW_AT_decl_column(0x0b)
    2232                    
    2233                    $C$DW$125       .dwtag  DW_TAG_member
    2234                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$23)
    2235                            .dwattr $C$DW$125, DW_AT_name("IV")
    2236                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("IV")
    2237                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2238                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2239                            .dwattr $C$DW$125, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2240                            .dwattr $C$DW$125, DW_AT_decl_line(0x289)
    2241                            .dwattr $C$DW$125, DW_AT_decl_column(0x11)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2242                    
    2243                    $C$DW$126       .dwtag  DW_TAG_member
    2244                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$24)
    2245                            .dwattr $C$DW$126, DW_AT_name("RESERVED7")
    2246                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("RESERVED7")
    2247                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2248                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$126, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2250                            .dwattr $C$DW$126, DW_AT_decl_line(0x28a)
    2251                            .dwattr $C$DW$126, DW_AT_decl_column(0x0b)
    2252                    
    2253                    $C$DW$127       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    2255                            .dwattr $C$DW$127, DW_AT_name("SELC")
    2256                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("SELC")
    2257                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2258                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$127, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2260                            .dwattr $C$DW$127, DW_AT_decl_line(0x28b)
    2261                            .dwattr $C$DW$127, DW_AT_decl_column(0x10)
    2262                    
    2263                    $C$DW$128       .dwtag  DW_TAG_member
    2264                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2265                            .dwattr $C$DW$128, DW_AT_name("RESERVED8")
    2266                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("RESERVED8")
    2267                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2268                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2269                            .dwattr $C$DW$128, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2270                            .dwattr $C$DW$128, DW_AT_decl_line(0x28c)
    2271                            .dwattr $C$DW$128, DW_AT_decl_column(0x0b)
    2272                    
    2273                    $C$DW$129       .dwtag  DW_TAG_member
    2274                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    2275                            .dwattr $C$DW$129, DW_AT_name("IES")
    2276                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("IES")
    2277                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2278                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2279                            .dwattr $C$DW$129, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2280                            .dwattr $C$DW$129, DW_AT_decl_line(0x28d)
    2281                            .dwattr $C$DW$129, DW_AT_decl_column(0x10)
    2282                    
    2283                    $C$DW$130       .dwtag  DW_TAG_member
    2284                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2285                            .dwattr $C$DW$130, DW_AT_name("RESERVED9")
    2286                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("RESERVED9")
    2287                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2288                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2289                            .dwattr $C$DW$130, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2290                            .dwattr $C$DW$130, DW_AT_decl_line(0x28e)
    2291                            .dwattr $C$DW$130, DW_AT_decl_column(0x0b)
    2292                    
    2293                    $C$DW$131       .dwtag  DW_TAG_member
    2294                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
    2295                            .dwattr $C$DW$131, DW_AT_name("IE")
    2296                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("IE")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2297                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2298                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2299                            .dwattr $C$DW$131, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2300                            .dwattr $C$DW$131, DW_AT_decl_line(0x28f)
    2301                            .dwattr $C$DW$131, DW_AT_decl_column(0x10)
    2302                    
    2303                    $C$DW$132       .dwtag  DW_TAG_member
    2304                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2305                            .dwattr $C$DW$132, DW_AT_name("RESERVED10")
    2306                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("RESERVED10")
    2307                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2308                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2309                            .dwattr $C$DW$132, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2310                            .dwattr $C$DW$132, DW_AT_decl_line(0x290)
    2311                            .dwattr $C$DW$132, DW_AT_decl_column(0x0b)
    2312                    
    2313                    $C$DW$133       .dwtag  DW_TAG_member
    2314                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    2315                            .dwattr $C$DW$133, DW_AT_name("IFG")
    2316                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("IFG")
    2317                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2318                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2319                            .dwattr $C$DW$133, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2320                            .dwattr $C$DW$133, DW_AT_decl_line(0x291)
    2321                            .dwattr $C$DW$133, DW_AT_decl_column(0x10)
    2322                    
    2323                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2324                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x27a)
    2325                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2326                            .dwendtag $C$DW$T$25
    2327                    
    2328                    $C$DW$T$242     .dwtag  DW_TAG_typedef
    2329                            .dwattr $C$DW$T$242, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    2330                            .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$25)
    2331                            .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    2332                            .dwattr $C$DW$T$242, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2333                            .dwattr $C$DW$T$242, DW_AT_decl_line(0x292)
    2334                            .dwattr $C$DW$T$242, DW_AT_decl_column(0x03)
    2335                    
    2336                    
    2337                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2338                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2339                    $C$DW$134       .dwtag  DW_TAG_member
    2340                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$26)
    2341                            .dwattr $C$DW$134, DW_AT_name("KEYID")
    2342                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("KEYID")
    2343                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2344                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2345                            .dwattr $C$DW$134, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2346                            .dwattr $C$DW$134, DW_AT_decl_line(0x3e5)
    2347                            .dwattr $C$DW$134, DW_AT_decl_column(0x11)
    2348                    
    2349                    $C$DW$135       .dwtag  DW_TAG_member
    2350                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$26)
    2351                            .dwattr $C$DW$135, DW_AT_name("CTL")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2352                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("CTL")
    2353                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2354                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2355                            .dwattr $C$DW$135, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2356                            .dwattr $C$DW$135, DW_AT_decl_line(0x3e6)
    2357                            .dwattr $C$DW$135, DW_AT_decl_column(0x11)
    2358                    
    2359                            .dwattr $C$DW$T$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2360                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3e4)
    2361                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2362                            .dwendtag $C$DW$T$27
    2363                    
    2364                    $C$DW$T$244     .dwtag  DW_TAG_typedef
    2365                            .dwattr $C$DW$T$244, DW_AT_name("PMAP_COMMON_Type")
    2366                            .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$27)
    2367                            .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    2368                            .dwattr $C$DW$T$244, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2369                            .dwattr $C$DW$T$244, DW_AT_decl_line(0x3e7)
    2370                            .dwattr $C$DW$T$244, DW_AT_decl_column(0x03)
    2371                    
    2372                    
    2373                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2374                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    2375                    $C$DW$136       .dwtag  DW_TAG_member
    2376                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2377                            .dwattr $C$DW$136, DW_AT_name("PMAP_REGISTER0")
    2378                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("PMAP_REGISTER0")
    2379                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2381                            .dwattr $C$DW$136, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2382                            .dwattr $C$DW$136, DW_AT_decl_line(0x3ed)
    2383                            .dwattr $C$DW$136, DW_AT_decl_column(0x14)
    2384                    
    2385                    $C$DW$137       .dwtag  DW_TAG_member
    2386                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    2387                            .dwattr $C$DW$137, DW_AT_name("PMAP_REGISTER1")
    2388                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("PMAP_REGISTER1")
    2389                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2390                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2391                            .dwattr $C$DW$137, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2392                            .dwattr $C$DW$137, DW_AT_decl_line(0x3ee)
    2393                            .dwattr $C$DW$137, DW_AT_decl_column(0x14)
    2394                    
    2395                    $C$DW$138       .dwtag  DW_TAG_member
    2396                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    2397                            .dwattr $C$DW$138, DW_AT_name("PMAP_REGISTER2")
    2398                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("PMAP_REGISTER2")
    2399                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2400                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2401                            .dwattr $C$DW$138, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2402                            .dwattr $C$DW$138, DW_AT_decl_line(0x3ef)
    2403                            .dwattr $C$DW$138, DW_AT_decl_column(0x14)
    2404                    
    2405                    $C$DW$139       .dwtag  DW_TAG_member
    2406                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2407                            .dwattr $C$DW$139, DW_AT_name("PMAP_REGISTER3")
    2408                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("PMAP_REGISTER3")
    2409                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2410                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2411                            .dwattr $C$DW$139, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2412                            .dwattr $C$DW$139, DW_AT_decl_line(0x3f0)
    2413                            .dwattr $C$DW$139, DW_AT_decl_column(0x14)
    2414                    
    2415                    $C$DW$140       .dwtag  DW_TAG_member
    2416                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    2417                            .dwattr $C$DW$140, DW_AT_name("PMAP_REGISTER4")
    2418                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("PMAP_REGISTER4")
    2419                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2420                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2421                            .dwattr $C$DW$140, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2422                            .dwattr $C$DW$140, DW_AT_decl_line(0x3f1)
    2423                            .dwattr $C$DW$140, DW_AT_decl_column(0x14)
    2424                    
    2425                    $C$DW$141       .dwtag  DW_TAG_member
    2426                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    2427                            .dwattr $C$DW$141, DW_AT_name("PMAP_REGISTER5")
    2428                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("PMAP_REGISTER5")
    2429                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2430                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2431                            .dwattr $C$DW$141, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2432                            .dwattr $C$DW$141, DW_AT_decl_line(0x3f2)
    2433                            .dwattr $C$DW$141, DW_AT_decl_column(0x14)
    2434                    
    2435                    $C$DW$142       .dwtag  DW_TAG_member
    2436                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    2437                            .dwattr $C$DW$142, DW_AT_name("PMAP_REGISTER6")
    2438                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("PMAP_REGISTER6")
    2439                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2440                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2441                            .dwattr $C$DW$142, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2442                            .dwattr $C$DW$142, DW_AT_decl_line(0x3f3)
    2443                            .dwattr $C$DW$142, DW_AT_decl_column(0x14)
    2444                    
    2445                    $C$DW$143       .dwtag  DW_TAG_member
    2446                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    2447                            .dwattr $C$DW$143, DW_AT_name("PMAP_REGISTER7")
    2448                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("PMAP_REGISTER7")
    2449                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2450                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2451                            .dwattr $C$DW$143, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2452                            .dwattr $C$DW$143, DW_AT_decl_line(0x3f4)
    2453                            .dwattr $C$DW$143, DW_AT_decl_column(0x14)
    2454                    
    2455                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2456                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3ec)
    2457                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0c)
    2458                            .dwendtag $C$DW$T$28
    2459                    
    2460                    
    2461                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2462                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2463                    $C$DW$144       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$152)
    2465                            .dwattr $C$DW$144, DW_AT_name("$P$T1")
    2466                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T1")
    2467                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2468                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$144, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2470                            .dwattr $C$DW$144, DW_AT_decl_line(0x3ea)
    2471                            .dwattr $C$DW$144, DW_AT_decl_column(0x03)
    2472                    
    2473                            .dwattr $C$DW$T$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2474                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e9)
    2475                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2476                            .dwendtag $C$DW$T$29
    2477                    
    2478                    $C$DW$T$246     .dwtag  DW_TAG_typedef
    2479                            .dwattr $C$DW$T$246, DW_AT_name("PMAP_REGISTER_Type")
    2480                            .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$29)
    2481                            .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    2482                            .dwattr $C$DW$T$246, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2483                            .dwattr $C$DW$T$246, DW_AT_decl_line(0x3f7)
    2484                            .dwattr $C$DW$T$246, DW_AT_decl_column(0x03)
    2485                    
    2486                    
    2487                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2488                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x30)
    2489                    $C$DW$145       .dwtag  DW_TAG_member
    2490                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$26)
    2491                            .dwattr $C$DW$145, DW_AT_name("CTL")
    2492                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("CTL")
    2493                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2495                            .dwattr $C$DW$145, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2496                            .dwattr $C$DW$145, DW_AT_decl_line(0x4a1)
    2497                            .dwattr $C$DW$145, DW_AT_decl_column(0x11)
    2498                    
    2499                    $C$DW$146       .dwtag  DW_TAG_member
    2500                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$30)
    2501                            .dwattr $C$DW$146, DW_AT_name("CCTL")
    2502                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("CCTL")
    2503                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2504                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2505                            .dwattr $C$DW$146, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2506                            .dwattr $C$DW$146, DW_AT_decl_line(0x4a2)
    2507                            .dwattr $C$DW$146, DW_AT_decl_column(0x11)
    2508                    
    2509                    $C$DW$147       .dwtag  DW_TAG_member
    2510                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$26)
    2511                            .dwattr $C$DW$147, DW_AT_name("R")
    2512                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("R")
    2513                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2514                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2515                            .dwattr $C$DW$147, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2516                            .dwattr $C$DW$147, DW_AT_decl_line(0x4a3)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   48

    2517                            .dwattr $C$DW$147, DW_AT_decl_column(0x11)
    2518                    
    2519                    $C$DW$148       .dwtag  DW_TAG_member
    2520                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$30)
    2521                            .dwattr $C$DW$148, DW_AT_name("CCR")
    2522                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("CCR")
    2523                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2524                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2525                            .dwattr $C$DW$148, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2526                            .dwattr $C$DW$148, DW_AT_decl_line(0x4a4)
    2527                            .dwattr $C$DW$148, DW_AT_decl_column(0x11)
    2528                    
    2529                    $C$DW$149       .dwtag  DW_TAG_member
    2530                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$26)
    2531                            .dwattr $C$DW$149, DW_AT_name("EX0")
    2532                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("EX0")
    2533                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2534                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2535                            .dwattr $C$DW$149, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2536                            .dwattr $C$DW$149, DW_AT_decl_line(0x4a5)
    2537                            .dwattr $C$DW$149, DW_AT_decl_column(0x11)
    2538                    
    2539                    $C$DW$150       .dwtag  DW_TAG_member
    2540                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
    2541                            .dwattr $C$DW$150, DW_AT_name("RESERVED0")
    2542                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("RESERVED0")
    2543                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2544                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2545                            .dwattr $C$DW$150, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2546                            .dwattr $C$DW$150, DW_AT_decl_line(0x4a6)
    2547                            .dwattr $C$DW$150, DW_AT_decl_column(0x11)
    2548                    
    2549                    $C$DW$151       .dwtag  DW_TAG_member
    2550                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$23)
    2551                            .dwattr $C$DW$151, DW_AT_name("IV")
    2552                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("IV")
    2553                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2554                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2555                            .dwattr $C$DW$151, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2556                            .dwattr $C$DW$151, DW_AT_decl_line(0x4a7)
    2557                            .dwattr $C$DW$151, DW_AT_decl_column(0x11)
    2558                    
    2559                            .dwattr $C$DW$T$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2560                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x4a0)
    2561                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2562                            .dwendtag $C$DW$T$32
    2563                    
    2564                    $C$DW$T$247     .dwtag  DW_TAG_typedef
    2565                            .dwattr $C$DW$T$247, DW_AT_name("Timer_A_Type")
    2566                            .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$32)
    2567                            .dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C)
    2568                            .dwattr $C$DW$T$247, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2569                            .dwattr $C$DW$T$247, DW_AT_decl_line(0x4a8)
    2570                            .dwattr $C$DW$T$247, DW_AT_decl_column(0x03)
    2571                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   49

    2572                    
    2573                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2574                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x20)
    2575                    $C$DW$152       .dwtag  DW_TAG_member
    2576                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2577                            .dwattr $C$DW$152, DW_AT_name("RESERVED0")
    2578                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("RESERVED0")
    2579                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2581                            .dwattr $C$DW$152, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2582                            .dwattr $C$DW$152, DW_AT_decl_line(0x295)
    2583                            .dwattr $C$DW$152, DW_AT_decl_column(0x0b)
    2584                    
    2585                    $C$DW$153       .dwtag  DW_TAG_member
    2586                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2587                            .dwattr $C$DW$153, DW_AT_name("IN")
    2588                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("IN")
    2589                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2590                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$153, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2592                            .dwattr $C$DW$153, DW_AT_decl_line(0x296)
    2593                            .dwattr $C$DW$153, DW_AT_decl_column(0x0f)
    2594                    
    2595                    $C$DW$154       .dwtag  DW_TAG_member
    2596                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2597                            .dwattr $C$DW$154, DW_AT_name("RESERVED1")
    2598                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("RESERVED1")
    2599                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2600                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2601                            .dwattr $C$DW$154, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2602                            .dwattr $C$DW$154, DW_AT_decl_line(0x297)
    2603                            .dwattr $C$DW$154, DW_AT_decl_column(0x0b)
    2604                    
    2605                    $C$DW$155       .dwtag  DW_TAG_member
    2606                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    2607                            .dwattr $C$DW$155, DW_AT_name("OUT")
    2608                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("OUT")
    2609                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2610                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2611                            .dwattr $C$DW$155, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2612                            .dwattr $C$DW$155, DW_AT_decl_line(0x298)
    2613                            .dwattr $C$DW$155, DW_AT_decl_column(0x10)
    2614                    
    2615                    $C$DW$156       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2617                            .dwattr $C$DW$156, DW_AT_name("RESERVED2")
    2618                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("RESERVED2")
    2619                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2620                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$156, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2622                            .dwattr $C$DW$156, DW_AT_decl_line(0x299)
    2623                            .dwattr $C$DW$156, DW_AT_decl_column(0x0b)
    2624                    
    2625                    $C$DW$157       .dwtag  DW_TAG_member
    2626                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   50

    2627                            .dwattr $C$DW$157, DW_AT_name("DIR")
    2628                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("DIR")
    2629                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2630                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2631                            .dwattr $C$DW$157, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2632                            .dwattr $C$DW$157, DW_AT_decl_line(0x29a)
    2633                            .dwattr $C$DW$157, DW_AT_decl_column(0x10)
    2634                    
    2635                    $C$DW$158       .dwtag  DW_TAG_member
    2636                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2637                            .dwattr $C$DW$158, DW_AT_name("RESERVED3")
    2638                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("RESERVED3")
    2639                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2640                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2641                            .dwattr $C$DW$158, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2642                            .dwattr $C$DW$158, DW_AT_decl_line(0x29b)
    2643                            .dwattr $C$DW$158, DW_AT_decl_column(0x0b)
    2644                    
    2645                    $C$DW$159       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    2647                            .dwattr $C$DW$159, DW_AT_name("REN")
    2648                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("REN")
    2649                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2650                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2651                            .dwattr $C$DW$159, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2652                            .dwattr $C$DW$159, DW_AT_decl_line(0x29c)
    2653                            .dwattr $C$DW$159, DW_AT_decl_column(0x10)
    2654                    
    2655                    $C$DW$160       .dwtag  DW_TAG_member
    2656                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2657                            .dwattr $C$DW$160, DW_AT_name("RESERVED4")
    2658                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("RESERVED4")
    2659                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2660                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2661                            .dwattr $C$DW$160, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2662                            .dwattr $C$DW$160, DW_AT_decl_line(0x29d)
    2663                            .dwattr $C$DW$160, DW_AT_decl_column(0x0b)
    2664                    
    2665                    $C$DW$161       .dwtag  DW_TAG_member
    2666                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    2667                            .dwattr $C$DW$161, DW_AT_name("DS")
    2668                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("DS")
    2669                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2670                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2671                            .dwattr $C$DW$161, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2672                            .dwattr $C$DW$161, DW_AT_decl_line(0x29e)
    2673                            .dwattr $C$DW$161, DW_AT_decl_column(0x10)
    2674                    
    2675                    $C$DW$162       .dwtag  DW_TAG_member
    2676                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2677                            .dwattr $C$DW$162, DW_AT_name("RESERVED5")
    2678                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("RESERVED5")
    2679                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2680                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2681                            .dwattr $C$DW$162, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   51

    2682                            .dwattr $C$DW$162, DW_AT_decl_line(0x29f)
    2683                            .dwattr $C$DW$162, DW_AT_decl_column(0x0b)
    2684                    
    2685                    $C$DW$163       .dwtag  DW_TAG_member
    2686                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    2687                            .dwattr $C$DW$163, DW_AT_name("SEL0")
    2688                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("SEL0")
    2689                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2690                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2691                            .dwattr $C$DW$163, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2692                            .dwattr $C$DW$163, DW_AT_decl_line(0x2a0)
    2693                            .dwattr $C$DW$163, DW_AT_decl_column(0x10)
    2694                    
    2695                    $C$DW$164       .dwtag  DW_TAG_member
    2696                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2697                            .dwattr $C$DW$164, DW_AT_name("RESERVED6")
    2698                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("RESERVED6")
    2699                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2700                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$164, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2702                            .dwattr $C$DW$164, DW_AT_decl_line(0x2a1)
    2703                            .dwattr $C$DW$164, DW_AT_decl_column(0x0b)
    2704                    
    2705                    $C$DW$165       .dwtag  DW_TAG_member
    2706                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    2707                            .dwattr $C$DW$165, DW_AT_name("SEL1")
    2708                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("SEL1")
    2709                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2710                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2711                            .dwattr $C$DW$165, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2712                            .dwattr $C$DW$165, DW_AT_decl_line(0x2a2)
    2713                            .dwattr $C$DW$165, DW_AT_decl_column(0x10)
    2714                    
    2715                    $C$DW$166       .dwtag  DW_TAG_member
    2716                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$33)
    2717                            .dwattr $C$DW$166, DW_AT_name("RESERVED7")
    2718                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("RESERVED7")
    2719                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2720                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2721                            .dwattr $C$DW$166, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2722                            .dwattr $C$DW$166, DW_AT_decl_line(0x2a3)
    2723                            .dwattr $C$DW$166, DW_AT_decl_column(0x0b)
    2724                    
    2725                    $C$DW$167       .dwtag  DW_TAG_member
    2726                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    2727                            .dwattr $C$DW$167, DW_AT_name("SELC")
    2728                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("SELC")
    2729                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2730                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2731                            .dwattr $C$DW$167, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2732                            .dwattr $C$DW$167, DW_AT_decl_line(0x2a4)
    2733                            .dwattr $C$DW$167, DW_AT_decl_column(0x10)
    2734                    
    2735                    $C$DW$168       .dwtag  DW_TAG_member
    2736                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   52

    2737                            .dwattr $C$DW$168, DW_AT_name("RESERVED8")
    2738                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("RESERVED8")
    2739                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2740                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2741                            .dwattr $C$DW$168, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2742                            .dwattr $C$DW$168, DW_AT_decl_line(0x2a5)
    2743                            .dwattr $C$DW$168, DW_AT_decl_column(0x0b)
    2744                    
    2745                    $C$DW$169       .dwtag  DW_TAG_member
    2746                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2747                            .dwattr $C$DW$169, DW_AT_name("IES")
    2748                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("IES")
    2749                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2750                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2751                            .dwattr $C$DW$169, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2752                            .dwattr $C$DW$169, DW_AT_decl_line(0x2a6)
    2753                            .dwattr $C$DW$169, DW_AT_decl_column(0x10)
    2754                    
    2755                    $C$DW$170       .dwtag  DW_TAG_member
    2756                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2757                            .dwattr $C$DW$170, DW_AT_name("RESERVED9")
    2758                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("RESERVED9")
    2759                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2760                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2761                            .dwattr $C$DW$170, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2762                            .dwattr $C$DW$170, DW_AT_decl_line(0x2a7)
    2763                            .dwattr $C$DW$170, DW_AT_decl_column(0x0b)
    2764                    
    2765                    $C$DW$171       .dwtag  DW_TAG_member
    2766                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    2767                            .dwattr $C$DW$171, DW_AT_name("IE")
    2768                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("IE")
    2769                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2770                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2771                            .dwattr $C$DW$171, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2772                            .dwattr $C$DW$171, DW_AT_decl_line(0x2a8)
    2773                            .dwattr $C$DW$171, DW_AT_decl_column(0x10)
    2774                    
    2775                    $C$DW$172       .dwtag  DW_TAG_member
    2776                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2777                            .dwattr $C$DW$172, DW_AT_name("RESERVED10")
    2778                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("RESERVED10")
    2779                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2780                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2781                            .dwattr $C$DW$172, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2782                            .dwattr $C$DW$172, DW_AT_decl_line(0x2a9)
    2783                            .dwattr $C$DW$172, DW_AT_decl_column(0x0b)
    2784                    
    2785                    $C$DW$173       .dwtag  DW_TAG_member
    2786                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    2787                            .dwattr $C$DW$173, DW_AT_name("IFG")
    2788                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("IFG")
    2789                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2790                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2791                            .dwattr $C$DW$173, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   53

    2792                            .dwattr $C$DW$173, DW_AT_decl_line(0x2aa)
    2793                            .dwattr $C$DW$173, DW_AT_decl_column(0x10)
    2794                    
    2795                    $C$DW$174       .dwtag  DW_TAG_member
    2796                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    2797                            .dwattr $C$DW$174, DW_AT_name("IV")
    2798                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("IV")
    2799                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2800                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2801                            .dwattr $C$DW$174, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2802                            .dwattr $C$DW$174, DW_AT_decl_line(0x2ab)
    2803                            .dwattr $C$DW$174, DW_AT_decl_column(0x10)
    2804                    
    2805                            .dwattr $C$DW$T$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2806                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x294)
    2807                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    2808                            .dwendtag $C$DW$T$34
    2809                    
    2810                    $C$DW$T$249     .dwtag  DW_TAG_typedef
    2811                            .dwattr $C$DW$T$249, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    2812                            .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$34)
    2813                            .dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
    2814                            .dwattr $C$DW$T$249, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2815                            .dwattr $C$DW$T$249, DW_AT_decl_line(0x2ac)
    2816                            .dwattr $C$DW$T$249, DW_AT_decl_column(0x03)
    2817                    
    2818                    
    2819                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2820                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x0e)
    2821                    $C$DW$175       .dwtag  DW_TAG_member
    2822                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    2823                            .dwattr $C$DW$175, DW_AT_name("RESERVED0")
    2824                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("RESERVED0")
    2825                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2827                            .dwattr $C$DW$175, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2828                            .dwattr $C$DW$175, DW_AT_decl_line(0x513)
    2829                            .dwattr $C$DW$175, DW_AT_decl_column(0x11)
    2830                    
    2831                    $C$DW$176       .dwtag  DW_TAG_member
    2832                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$26)
    2833                            .dwattr $C$DW$176, DW_AT_name("CTL")
    2834                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("CTL")
    2835                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2836                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2837                            .dwattr $C$DW$176, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2838                            .dwattr $C$DW$176, DW_AT_decl_line(0x514)
    2839                            .dwattr $C$DW$176, DW_AT_decl_column(0x11)
    2840                    
    2841                            .dwattr $C$DW$T$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    2842                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x512)
    2843                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2844                            .dwendtag $C$DW$T$35
    2845                    
    2846                    $C$DW$T$251     .dwtag  DW_TAG_typedef
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   54

    2847                            .dwattr $C$DW$T$251, DW_AT_name("WDT_A_Type")
    2848                            .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$35)
    2849                            .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    2850                            .dwattr $C$DW$T$251, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    2851                            .dwattr $C$DW$T$251, DW_AT_decl_line(0x515)
    2852                            .dwattr $C$DW$T$251, DW_AT_decl_column(0x03)
    2853                    
    2854                    
    2855                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2856                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x8c)
    2857                    $C$DW$177       .dwtag  DW_TAG_member
    2858                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$37)
    2859                            .dwattr $C$DW$177, DW_AT_name("CPUID")
    2860                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("CPUID")
    2861                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2863                            .dwattr $C$DW$177, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2864                            .dwattr $C$DW$177, DW_AT_decl_line(0x1e7)
    2865                            .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    2866                    
    2867                    $C$DW$178       .dwtag  DW_TAG_member
    2868                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$38)
    2869                            .dwattr $C$DW$178, DW_AT_name("ICSR")
    2870                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ICSR")
    2871                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2872                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2873                            .dwattr $C$DW$178, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2874                            .dwattr $C$DW$178, DW_AT_decl_line(0x1e8)
    2875                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    2876                    
    2877                    $C$DW$179       .dwtag  DW_TAG_member
    2878                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$38)
    2879                            .dwattr $C$DW$179, DW_AT_name("VTOR")
    2880                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("VTOR")
    2881                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2882                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2883                            .dwattr $C$DW$179, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2884                            .dwattr $C$DW$179, DW_AT_decl_line(0x1e9)
    2885                            .dwattr $C$DW$179, DW_AT_decl_column(0x12)
    2886                    
    2887                    $C$DW$180       .dwtag  DW_TAG_member
    2888                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$38)
    2889                            .dwattr $C$DW$180, DW_AT_name("AIRCR")
    2890                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("AIRCR")
    2891                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2892                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2893                            .dwattr $C$DW$180, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2894                            .dwattr $C$DW$180, DW_AT_decl_line(0x1ea)
    2895                            .dwattr $C$DW$180, DW_AT_decl_column(0x12)
    2896                    
    2897                    $C$DW$181       .dwtag  DW_TAG_member
    2898                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$38)
    2899                            .dwattr $C$DW$181, DW_AT_name("SCR")
    2900                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("SCR")
    2901                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   55

    2902                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2903                            .dwattr $C$DW$181, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2904                            .dwattr $C$DW$181, DW_AT_decl_line(0x1eb)
    2905                            .dwattr $C$DW$181, DW_AT_decl_column(0x12)
    2906                    
    2907                    $C$DW$182       .dwtag  DW_TAG_member
    2908                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$38)
    2909                            .dwattr $C$DW$182, DW_AT_name("CCR")
    2910                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("CCR")
    2911                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2912                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2913                            .dwattr $C$DW$182, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2914                            .dwattr $C$DW$182, DW_AT_decl_line(0x1ec)
    2915                            .dwattr $C$DW$182, DW_AT_decl_column(0x12)
    2916                    
    2917                    $C$DW$183       .dwtag  DW_TAG_member
    2918                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$39)
    2919                            .dwattr $C$DW$183, DW_AT_name("SHP")
    2920                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("SHP")
    2921                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2922                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2923                            .dwattr $C$DW$183, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2924                            .dwattr $C$DW$183, DW_AT_decl_line(0x1ed)
    2925                            .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    2926                    
    2927                    $C$DW$184       .dwtag  DW_TAG_member
    2928                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$38)
    2929                            .dwattr $C$DW$184, DW_AT_name("SHCSR")
    2930                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("SHCSR")
    2931                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2932                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2933                            .dwattr $C$DW$184, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2934                            .dwattr $C$DW$184, DW_AT_decl_line(0x1ee)
    2935                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    2936                    
    2937                    $C$DW$185       .dwtag  DW_TAG_member
    2938                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$38)
    2939                            .dwattr $C$DW$185, DW_AT_name("CFSR")
    2940                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("CFSR")
    2941                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2942                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2943                            .dwattr $C$DW$185, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2944                            .dwattr $C$DW$185, DW_AT_decl_line(0x1ef)
    2945                            .dwattr $C$DW$185, DW_AT_decl_column(0x12)
    2946                    
    2947                    $C$DW$186       .dwtag  DW_TAG_member
    2948                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$38)
    2949                            .dwattr $C$DW$186, DW_AT_name("HFSR")
    2950                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("HFSR")
    2951                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2952                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2953                            .dwattr $C$DW$186, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2954                            .dwattr $C$DW$186, DW_AT_decl_line(0x1f0)
    2955                            .dwattr $C$DW$186, DW_AT_decl_column(0x12)
    2956                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   56

    2957                    $C$DW$187       .dwtag  DW_TAG_member
    2958                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$38)
    2959                            .dwattr $C$DW$187, DW_AT_name("DFSR")
    2960                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("DFSR")
    2961                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2962                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2963                            .dwattr $C$DW$187, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2964                            .dwattr $C$DW$187, DW_AT_decl_line(0x1f1)
    2965                            .dwattr $C$DW$187, DW_AT_decl_column(0x12)
    2966                    
    2967                    $C$DW$188       .dwtag  DW_TAG_member
    2968                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$38)
    2969                            .dwattr $C$DW$188, DW_AT_name("MMFAR")
    2970                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("MMFAR")
    2971                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2972                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2973                            .dwattr $C$DW$188, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2974                            .dwattr $C$DW$188, DW_AT_decl_line(0x1f2)
    2975                            .dwattr $C$DW$188, DW_AT_decl_column(0x12)
    2976                    
    2977                    $C$DW$189       .dwtag  DW_TAG_member
    2978                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$38)
    2979                            .dwattr $C$DW$189, DW_AT_name("BFAR")
    2980                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("BFAR")
    2981                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2982                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2983                            .dwattr $C$DW$189, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2984                            .dwattr $C$DW$189, DW_AT_decl_line(0x1f3)
    2985                            .dwattr $C$DW$189, DW_AT_decl_column(0x12)
    2986                    
    2987                    $C$DW$190       .dwtag  DW_TAG_member
    2988                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$38)
    2989                            .dwattr $C$DW$190, DW_AT_name("AFSR")
    2990                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("AFSR")
    2991                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2992                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2993                            .dwattr $C$DW$190, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    2994                            .dwattr $C$DW$190, DW_AT_decl_line(0x1f4)
    2995                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    2996                    
    2997                    $C$DW$191       .dwtag  DW_TAG_member
    2998                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$40)
    2999                            .dwattr $C$DW$191, DW_AT_name("PFR")
    3000                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("PFR")
    3001                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3002                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3003                            .dwattr $C$DW$191, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3004                            .dwattr $C$DW$191, DW_AT_decl_line(0x1f5)
    3005                            .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    3006                    
    3007                    $C$DW$192       .dwtag  DW_TAG_member
    3008                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$37)
    3009                            .dwattr $C$DW$192, DW_AT_name("DFR")
    3010                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("DFR")
    3011                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   57

    3012                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3013                            .dwattr $C$DW$192, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3014                            .dwattr $C$DW$192, DW_AT_decl_line(0x1f6)
    3015                            .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    3016                    
    3017                    $C$DW$193       .dwtag  DW_TAG_member
    3018                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$37)
    3019                            .dwattr $C$DW$193, DW_AT_name("ADR")
    3020                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("ADR")
    3021                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3022                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3023                            .dwattr $C$DW$193, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3024                            .dwattr $C$DW$193, DW_AT_decl_line(0x1f7)
    3025                            .dwattr $C$DW$193, DW_AT_decl_column(0x12)
    3026                    
    3027                    $C$DW$194       .dwtag  DW_TAG_member
    3028                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$41)
    3029                            .dwattr $C$DW$194, DW_AT_name("MMFR")
    3030                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("MMFR")
    3031                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3032                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3033                            .dwattr $C$DW$194, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3034                            .dwattr $C$DW$194, DW_AT_decl_line(0x1f8)
    3035                            .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    3036                    
    3037                    $C$DW$195       .dwtag  DW_TAG_member
    3038                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$42)
    3039                            .dwattr $C$DW$195, DW_AT_name("ISAR")
    3040                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ISAR")
    3041                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3042                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3043                            .dwattr $C$DW$195, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3044                            .dwattr $C$DW$195, DW_AT_decl_line(0x1f9)
    3045                            .dwattr $C$DW$195, DW_AT_decl_column(0x12)
    3046                    
    3047                    $C$DW$196       .dwtag  DW_TAG_member
    3048                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$43)
    3049                            .dwattr $C$DW$196, DW_AT_name("RESERVED0")
    3050                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("RESERVED0")
    3051                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3052                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3053                            .dwattr $C$DW$196, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3054                            .dwattr $C$DW$196, DW_AT_decl_line(0x1fa)
    3055                            .dwattr $C$DW$196, DW_AT_decl_column(0x12)
    3056                    
    3057                    $C$DW$197       .dwtag  DW_TAG_member
    3058                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$38)
    3059                            .dwattr $C$DW$197, DW_AT_name("CPACR")
    3060                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("CPACR")
    3061                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3062                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3063                            .dwattr $C$DW$197, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3064                            .dwattr $C$DW$197, DW_AT_decl_line(0x1fb)
    3065                            .dwattr $C$DW$197, DW_AT_decl_column(0x12)
    3066                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   58

    3067                            .dwattr $C$DW$T$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    3068                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x1e6)
    3069                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    3070                            .dwendtag $C$DW$T$44
    3071                    
    3072                    $C$DW$T$253     .dwtag  DW_TAG_typedef
    3073                            .dwattr $C$DW$T$253, DW_AT_name("SCB_Type")
    3074                            .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$44)
    3075                            .dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
    3076                            .dwattr $C$DW$T$253, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    3077                            .dwattr $C$DW$T$253, DW_AT_decl_line(0x1fc)
    3078                            .dwattr $C$DW$T$253, DW_AT_decl_column(0x03)
    3079                    
    3080                    
    3081                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3082                            .dwattr $C$DW$T$50, DW_AT_byte_size(0xe04)
    3083                    $C$DW$198       .dwtag  DW_TAG_member
    3084                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$45)
    3085                            .dwattr $C$DW$198, DW_AT_name("ISER")
    3086                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("ISER")
    3087                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3088                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3089                            .dwattr $C$DW$198, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3090                            .dwattr $C$DW$198, DW_AT_decl_line(0x1c5)
    3091                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    3092                    
    3093                    $C$DW$199       .dwtag  DW_TAG_member
    3094                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$46)
    3095                            .dwattr $C$DW$199, DW_AT_name("RESERVED0")
    3096                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("RESERVED0")
    3097                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3098                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3099                            .dwattr $C$DW$199, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3100                            .dwattr $C$DW$199, DW_AT_decl_line(0x1c6)
    3101                            .dwattr $C$DW$199, DW_AT_decl_column(0x12)
    3102                    
    3103                    $C$DW$200       .dwtag  DW_TAG_member
    3104                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$45)
    3105                            .dwattr $C$DW$200, DW_AT_name("ICER")
    3106                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("ICER")
    3107                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3108                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3109                            .dwattr $C$DW$200, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3110                            .dwattr $C$DW$200, DW_AT_decl_line(0x1c7)
    3111                            .dwattr $C$DW$200, DW_AT_decl_column(0x12)
    3112                    
    3113                    $C$DW$201       .dwtag  DW_TAG_member
    3114                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$46)
    3115                            .dwattr $C$DW$201, DW_AT_name("RSERVED1")
    3116                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("RSERVED1")
    3117                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3118                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3119                            .dwattr $C$DW$201, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3120                            .dwattr $C$DW$201, DW_AT_decl_line(0x1c8)
    3121                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   59

    3122                    
    3123                    $C$DW$202       .dwtag  DW_TAG_member
    3124                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$45)
    3125                            .dwattr $C$DW$202, DW_AT_name("ISPR")
    3126                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ISPR")
    3127                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3128                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3129                            .dwattr $C$DW$202, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3130                            .dwattr $C$DW$202, DW_AT_decl_line(0x1c9)
    3131                            .dwattr $C$DW$202, DW_AT_decl_column(0x12)
    3132                    
    3133                    $C$DW$203       .dwtag  DW_TAG_member
    3134                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$46)
    3135                            .dwattr $C$DW$203, DW_AT_name("RESERVED2")
    3136                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("RESERVED2")
    3137                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3138                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3139                            .dwattr $C$DW$203, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3140                            .dwattr $C$DW$203, DW_AT_decl_line(0x1ca)
    3141                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    3142                    
    3143                    $C$DW$204       .dwtag  DW_TAG_member
    3144                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$45)
    3145                            .dwattr $C$DW$204, DW_AT_name("ICPR")
    3146                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("ICPR")
    3147                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    3148                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3149                            .dwattr $C$DW$204, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3150                            .dwattr $C$DW$204, DW_AT_decl_line(0x1cb)
    3151                            .dwattr $C$DW$204, DW_AT_decl_column(0x12)
    3152                    
    3153                    $C$DW$205       .dwtag  DW_TAG_member
    3154                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$46)
    3155                            .dwattr $C$DW$205, DW_AT_name("RESERVED3")
    3156                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("RESERVED3")
    3157                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    3158                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3159                            .dwattr $C$DW$205, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3160                            .dwattr $C$DW$205, DW_AT_decl_line(0x1cc)
    3161                            .dwattr $C$DW$205, DW_AT_decl_column(0x12)
    3162                    
    3163                    $C$DW$206       .dwtag  DW_TAG_member
    3164                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$45)
    3165                            .dwattr $C$DW$206, DW_AT_name("IABR")
    3166                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("IABR")
    3167                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    3168                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3169                            .dwattr $C$DW$206, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3170                            .dwattr $C$DW$206, DW_AT_decl_line(0x1cd)
    3171                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    3172                    
    3173                    $C$DW$207       .dwtag  DW_TAG_member
    3174                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$47)
    3175                            .dwattr $C$DW$207, DW_AT_name("RESERVED4")
    3176                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("RESERVED4")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 13:25:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   60

    3177                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    3178                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3179                            .dwattr $C$DW$207, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    3180                            .dwattr $C$DW$207, DW_AT_decl_line(0x1ce)
    3181                            .dwattr $C$DW$207, DW_AT_decl_column(0x12)
    3182                    
    3183                    $C$DW$208       .dwtag  DW_TAG_member
