TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Sat Apr 29 06:20:02 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../normal1.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

     965                    $C$DW$13        .dwtag  DW_TAG_variable
     966                            .dwattr $C$DW$13, DW_AT_name("x")
     967                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("x")
     968                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$95)
     969                            .dwattr $C$DW$13, DW_AT_location[DW_OP_reg1]
     970                    
     971                    ;* A3    assigned to y
     972                    $C$DW$14        .dwtag  DW_TAG_variable
     973                            .dwattr $C$DW$14, DW_AT_name("y")
     974                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("y")
     975                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$95)
     976                            .dwattr $C$DW$14, DW_AT_location[DW_OP_reg2]
     977                    
     978                            .dwcfi  cfa_offset, 0
     979                            .dwpsn  file "../normal1.c",line 97,column 5,is_stmt,isa 1
     980                    ;----------------------------------------------------------------------
     981                    ;  97 | Graphics_drawImage(gs, &normal14BPP_UNCOMP, x, y);                     
     982                    ;----------------------------------------------------------------------
     983 00000000 B213              SXTH      A4, A3                ; [DPU_3_PIPE] |97|  ; [ORIG 16-BIT INS]
     984 00000002 B20A              SXTH      A3, A2                ; [DPU_3_PIPE] |97|  ; [ORIG 16-BIT INS]
     985 00000004 4901              LDR       A2, $C$CON1           ; [DPU_3_PIPE] |97|  ; [ORIG 16-BIT INS]
     986                    $C$DW$15        .dwtag  DW_TAG_TI_branch
     987                            .dwattr $C$DW$15, DW_AT_low_pc(0x00)
     988                            .dwattr $C$DW$15, DW_AT_name("Graphics_drawImage")
     989                            .dwattr $C$DW$15, DW_AT_TI_call
     990                            .dwattr $C$DW$15, DW_AT_TI_return
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   19

     991                    
     992 00000006 BFFEF7FF!         CRET      Graphics_drawImage    ; [DPU_3_PIPE] |97|  ; [KEEP 32-BIT INS]
     993                            ; CALL OCCURS {Graphics_drawImage }  ; [] |97| 
     994                            .dwattr $C$DW$9, DW_AT_TI_end_file("../normal1.c")
     995                            .dwattr $C$DW$9, DW_AT_TI_end_line(0x62)
     996                            .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     997                            .dwendentry
     998                            .dwendtag $C$DW$9
     999                    
    1000                    ;******************************************************************************
    1001                    ;* CONSTANT TABLE                                                             *
    1002                    ;******************************************************************************
    1003 0000000a                   .sect   ".text:draw_normal1"
    1004                            .align  4
    1005 0000000a 000046C0! ||$C$CON1||:    .bits   normal14BPP_UNCOMP,32
         0000000e 00000000 
    1006                    ;*****************************************************************************
    1007                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1008                    ;*****************************************************************************
    1009                            .global Graphics_drawImage
    1010                    
    1011                    ;******************************************************************************
    1012                    ;* BUILD ATTRIBUTES                                                           *
    1013                    ;******************************************************************************
    1014                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    1015                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    1016                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    1017                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    1018                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    1019                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
    1020                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
    1021                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1022                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    1023                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1024                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1025                    
    1026                    ;******************************************************************************
    1027                    ;* TYPE INFORMATION                                                           *
    1028                    ;******************************************************************************
    1029                    
    1030                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1031                            .dwattr $C$DW$T$28, DW_AT_name("Graphics_Context")
    1032                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x1c)
    1033                    $C$DW$16        .dwtag  DW_TAG_member
    1034                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
    1035                            .dwattr $C$DW$16, DW_AT_name("size")
    1036                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("size")
    1037                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
    1039                            .dwattr $C$DW$16, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1040                            .dwattr $C$DW$16, DW_AT_decl_line(0xe8)
    1041                            .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
    1042                    
    1043                    $C$DW$17        .dwtag  DW_TAG_member
    1044                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   20

    1045                            .dwattr $C$DW$17, DW_AT_name("display")
    1046                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("display")
    1047                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1048                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
    1049                            .dwattr $C$DW$17, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1050                            .dwattr $C$DW$17, DW_AT_decl_line(0xe9)
    1051                            .dwattr $C$DW$17, DW_AT_decl_column(0x1d)
    1052                    
    1053                    $C$DW$18        .dwtag  DW_TAG_member
    1054                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$23)
    1055                            .dwattr $C$DW$18, DW_AT_name("clipRegion")
    1056                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("clipRegion")
    1057                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1058                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
    1059                            .dwattr $C$DW$18, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1060                            .dwattr $C$DW$18, DW_AT_decl_line(0xea)
    1061                            .dwattr $C$DW$18, DW_AT_decl_column(0x18)
    1062                    
    1063                    $C$DW$19        .dwtag  DW_TAG_member
    1064                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$24)
    1065                            .dwattr $C$DW$19, DW_AT_name("foreground")
    1066                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("foreground")
    1067                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1068                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
    1069                            .dwattr $C$DW$19, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1070                            .dwattr $C$DW$19, DW_AT_decl_line(0xeb)
    1071                            .dwattr $C$DW$19, DW_AT_decl_column(0x0e)
    1072                    
    1073                    $C$DW$20        .dwtag  DW_TAG_member
    1074                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$24)
    1075                            .dwattr $C$DW$20, DW_AT_name("background")
    1076                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("background")
    1077                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1078                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
    1079                            .dwattr $C$DW$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1080                            .dwattr $C$DW$20, DW_AT_decl_line(0xec)
    1081                            .dwattr $C$DW$20, DW_AT_decl_column(0x0e)
    1082                    
    1083                    $C$DW$21        .dwtag  DW_TAG_member
    1084                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$27)
    1085                            .dwattr $C$DW$21, DW_AT_name("font")
    1086                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("font")
    1087                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1088                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
    1089                            .dwattr $C$DW$21, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1090                            .dwattr $C$DW$21, DW_AT_decl_line(0xed)
    1091                            .dwattr $C$DW$21, DW_AT_decl_column(0x1a)
    1092                    
    1093                            .dwattr $C$DW$T$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1094                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xe6)
    1095                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1096                            .dwendtag $C$DW$T$28
    1097                    
    1098                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1099                            .dwattr $C$DW$T$71, DW_AT_name("Graphics_Context")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   21

    1100                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    1101                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1102                            .dwattr $C$DW$T$71, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1103                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xee)
    1104                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    1105                    
    1106                    $C$DW$T$72      .dwtag  DW_TAG_const_type
    1107                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    1108                    
    1109                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    1110                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1111                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    1112                    
    1113                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1114                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$71)
    1115                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    1116                    
    1117                    
    1118                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1119                            .dwattr $C$DW$T$33, DW_AT_name("Graphics_Display")
    1120                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    1121                    $C$DW$22        .dwtag  DW_TAG_member
    1122                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
    1123                            .dwattr $C$DW$22, DW_AT_name("size")
    1124                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("size")
    1125                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
    1127                            .dwattr $C$DW$22, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1128                            .dwattr $C$DW$22, DW_AT_decl_line(0xb2)
    1129                            .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
    1130                    
    1131                    $C$DW$23        .dwtag  DW_TAG_member
    1132                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$3)
    1133                            .dwattr $C$DW$23, DW_AT_name("displayData")
    1134                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("displayData")
    1135                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1136                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
    1137                            .dwattr $C$DW$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1138                            .dwattr $C$DW$23, DW_AT_decl_line(0xb3)
    1139                            .dwattr $C$DW$23, DW_AT_decl_column(0x0b)
    1140                    
    1141                    $C$DW$24        .dwtag  DW_TAG_member
    1142                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$29)
    1143                            .dwattr $C$DW$24, DW_AT_name("width")
    1144                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("width")
    1145                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1146                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
    1147                            .dwattr $C$DW$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1148                            .dwattr $C$DW$24, DW_AT_decl_line(0xb4)
    1149                            .dwattr $C$DW$24, DW_AT_decl_column(0x0e)
    1150                    
    1151                    $C$DW$25        .dwtag  DW_TAG_member
    1152                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$29)
    1153                            .dwattr $C$DW$25, DW_AT_name("heigth")
    1154                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("heigth")
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   22

    1155                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1156                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
    1157                            .dwattr $C$DW$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1158                            .dwattr $C$DW$25, DW_AT_decl_line(0xb5)
    1159                            .dwattr $C$DW$25, DW_AT_decl_column(0x0e)
    1160                    
    1161                    $C$DW$26        .dwtag  DW_TAG_member
    1162                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$32)
    1163                            .dwattr $C$DW$26, DW_AT_name("pFxns")
    1164                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("pFxns")
    1165                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1166                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
    1167                            .dwattr $C$DW$26, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1168                            .dwattr $C$DW$26, DW_AT_decl_line(0xb6)
    1169                            .dwattr $C$DW$26, DW_AT_decl_column(0x27)
    1170                    
    1171                            .dwattr $C$DW$T$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1172                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xb0)
    1173                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x08)
    1174                            .dwendtag $C$DW$T$33
    1175                    
    1176                    $C$DW$T$20      .dwtag  DW_TAG_typedef
    1177                            .dwattr $C$DW$T$20, DW_AT_name("Graphics_Display")
    1178                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$33)
    1179                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1180                            .dwattr $C$DW$T$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1181                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x66)
    1182                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x21)
    1183                    
    1184                    $C$DW$T$21      .dwtag  DW_TAG_const_type
    1185                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1186                    
    1187                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1188                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    1189                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    1190                    
    1191                    
    1192                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1193                            .dwattr $C$DW$T$63, DW_AT_name("Graphics_Display_Functions")
    1194                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x20)
    1195                    $C$DW$27        .dwtag  DW_TAG_member
    1196                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$37)
    1197                            .dwattr $C$DW$27, DW_AT_name("pfnPixelDraw")
    1198                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("pfnPixelDraw")
    1199                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
    1201                            .dwattr $C$DW$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1202                            .dwattr $C$DW$27, DW_AT_decl_line(0x72)
    1203                            .dwattr $C$DW$27, DW_AT_decl_column(0x12)
    1204                    
    1205                    $C$DW$28        .dwtag  DW_TAG_member
    1206                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$45)
    1207                            .dwattr $C$DW$28, DW_AT_name("pfnPixelDrawMultiple")
    1208                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("pfnPixelDrawMultiple")
    1209                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   23

    1210                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1211                            .dwattr $C$DW$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1212                            .dwattr $C$DW$28, DW_AT_decl_line(0x79)
    1213                            .dwattr $C$DW$28, DW_AT_decl_column(0x12)
    1214                    
    1215                    $C$DW$29        .dwtag  DW_TAG_member
    1216                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$48)
    1217                            .dwattr $C$DW$29, DW_AT_name("pfnLineDrawH")
    1218                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("pfnLineDrawH")
    1219                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1220                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1221                            .dwattr $C$DW$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1222                            .dwattr $C$DW$29, DW_AT_decl_line(0x83)
    1223                            .dwattr $C$DW$29, DW_AT_decl_column(0x12)
    1224                    
    1225                    $C$DW$30        .dwtag  DW_TAG_member
    1226                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$48)
    1227                            .dwattr $C$DW$30, DW_AT_name("pfnLineDrawV")
    1228                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("pfnLineDrawV")
    1229                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1230                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1231                            .dwattr $C$DW$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1232                            .dwattr $C$DW$30, DW_AT_decl_line(0x8a)
    1233                            .dwattr $C$DW$30, DW_AT_decl_column(0x12)
    1234                    
    1235                    $C$DW$31        .dwtag  DW_TAG_member
    1236                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$53)
    1237                            .dwattr $C$DW$31, DW_AT_name("pfnRectFill")
    1238                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("pfnRectFill")
    1239                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1240                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1241                            .dwattr $C$DW$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1242                            .dwattr $C$DW$31, DW_AT_decl_line(0x91)
    1243                            .dwattr $C$DW$31, DW_AT_decl_column(0x12)
    1244                    
    1245                    $C$DW$32        .dwtag  DW_TAG_member
    1246                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$56)
    1247                            .dwattr $C$DW$32, DW_AT_name("pfnColorTranslate")
    1248                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("pfnColorTranslate")
    1249                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1250                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    1251                            .dwattr $C$DW$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1252                            .dwattr $C$DW$32, DW_AT_decl_line(0x99)
    1253                            .dwattr $C$DW$32, DW_AT_decl_column(0x16)
    1254                    
    1255                    $C$DW$33        .dwtag  DW_TAG_member
    1256                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$59)
    1257                            .dwattr $C$DW$33, DW_AT_name("pfnFlush")
    1258                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("pfnFlush")
    1259                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1260                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1261                            .dwattr $C$DW$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1262                            .dwattr $C$DW$33, DW_AT_decl_line(0xa0)
    1263                            .dwattr $C$DW$33, DW_AT_decl_column(0x12)
    1264                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   24

    1265                    $C$DW$34        .dwtag  DW_TAG_member
    1266                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$62)
    1267                            .dwattr $C$DW$34, DW_AT_name("pfnClearDisplay")
    1268                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("pfnClearDisplay")
    1269                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1270                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1271                            .dwattr $C$DW$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1272                            .dwattr $C$DW$34, DW_AT_decl_line(0xa6)
    1273                            .dwattr $C$DW$34, DW_AT_decl_column(0x12)
    1274                    
    1275                            .dwattr $C$DW$T$63, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1276                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x6d)
    1277                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
    1278                            .dwendtag $C$DW$T$63
    1279                    
    1280                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1281                            .dwattr $C$DW$T$30, DW_AT_name("Graphics_Display_Functions")
    1282                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$63)
    1283                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1284                            .dwattr $C$DW$T$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1285                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xa9)
    1286                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1287                    
    1288                    $C$DW$T$31      .dwtag  DW_TAG_const_type
    1289                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1290                    
    1291                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    1292                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1293                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    1294                    
    1295                    
    1296                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    1297                            .dwattr $C$DW$T$65, DW_AT_name("Graphics_Font")
    1298                            .dwattr $C$DW$T$65, DW_AT_byte_size(0xc8)
    1299                    $C$DW$35        .dwtag  DW_TAG_member
    1300                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$38)
    1301                            .dwattr $C$DW$35, DW_AT_name("format")
    1302                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("format")
    1303                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1305                            .dwattr $C$DW$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1306                            .dwattr $C$DW$35, DW_AT_decl_line(0xc0)
    1307                            .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
    1308                    
    1309                    $C$DW$36        .dwtag  DW_TAG_member
    1310                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$38)
    1311                            .dwattr $C$DW$36, DW_AT_name("maxWidth")
    1312                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("maxWidth")
    1313                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1314                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
    1315                            .dwattr $C$DW$36, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1316                            .dwattr $C$DW$36, DW_AT_decl_line(0xc1)
    1317                            .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
    1318                    
    1319                    $C$DW$37        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   25

    1320                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$38)
    1321                            .dwattr $C$DW$37, DW_AT_name("height")
    1322                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("height")
    1323                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1324                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1325                            .dwattr $C$DW$37, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1326                            .dwattr $C$DW$37, DW_AT_decl_line(0xc2)
    1327                            .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
    1328                    
    1329                    $C$DW$38        .dwtag  DW_TAG_member
    1330                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$38)
    1331                            .dwattr $C$DW$38, DW_AT_name("baseline")
    1332                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("baseline")
    1333                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1334                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1335                            .dwattr $C$DW$38, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1336                            .dwattr $C$DW$38, DW_AT_decl_line(0xc3)
    1337                            .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
    1338                    
    1339                    $C$DW$39        .dwtag  DW_TAG_member
    1340                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$64)
    1341                            .dwattr $C$DW$39, DW_AT_name("offset")
    1342                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("offset")
    1343                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1344                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1345                            .dwattr $C$DW$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1346                            .dwattr $C$DW$39, DW_AT_decl_line(0xc4)
    1347                            .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
    1348                    
    1349                    $C$DW$40        .dwtag  DW_TAG_member
    1350                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$40)
    1351                            .dwattr $C$DW$40, DW_AT_name("data")
    1352                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("data")
    1353                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1354                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1355                            .dwattr $C$DW$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1356                            .dwattr $C$DW$40, DW_AT_decl_line(0xc5)
    1357                            .dwattr $C$DW$40, DW_AT_decl_column(0x14)
    1358                    
    1359                            .dwattr $C$DW$T$65, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1360                            .dwattr $C$DW$T$65, DW_AT_decl_line(0xbe)
    1361                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
    1362                            .dwendtag $C$DW$T$65
    1363                    
    1364                    $C$DW$T$25      .dwtag  DW_TAG_typedef
    1365                            .dwattr $C$DW$T$25, DW_AT_name("Graphics_Font")
    1366                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$65)
    1367                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1368                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1369                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xc6)
    1370                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    1371                    
    1372                    $C$DW$T$26      .dwtag  DW_TAG_const_type
    1373                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1374                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   26

    1375                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1376                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1377                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    1378                    
    1379                    
    1380                    $C$DW$T$68      .dwtag  DW_TAG_structure_type
    1381                            .dwattr $C$DW$T$68, DW_AT_name("Graphics_FontEx")
    1382                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    1383                    $C$DW$41        .dwtag  DW_TAG_member
    1384                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$38)
    1385                            .dwattr $C$DW$41, DW_AT_name("format")
    1386                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("format")
    1387                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1389                            .dwattr $C$DW$41, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1390                            .dwattr $C$DW$41, DW_AT_decl_line(0xd6)
    1391                            .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
    1392                    
    1393                    $C$DW$42        .dwtag  DW_TAG_member
    1394                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$38)
    1395                            .dwattr $C$DW$42, DW_AT_name("maxWidth")
    1396                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("maxWidth")
    1397                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1398                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1399                            .dwattr $C$DW$42, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1400                            .dwattr $C$DW$42, DW_AT_decl_line(0xd7)
    1401                            .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
    1402                    
    1403                    $C$DW$43        .dwtag  DW_TAG_member
    1404                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$38)
    1405                            .dwattr $C$DW$43, DW_AT_name("height")
    1406                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("height")
    1407                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1408                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1409                            .dwattr $C$DW$43, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1410                            .dwattr $C$DW$43, DW_AT_decl_line(0xd8)
    1411                            .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
    1412                    
    1413                    $C$DW$44        .dwtag  DW_TAG_member
    1414                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$38)
    1415                            .dwattr $C$DW$44, DW_AT_name("baseline")
    1416                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("baseline")
    1417                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1418                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1419                            .dwattr $C$DW$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1420                            .dwattr $C$DW$44, DW_AT_decl_line(0xd9)
    1421                            .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
    1422                    
    1423                    $C$DW$45        .dwtag  DW_TAG_member
    1424                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$38)
    1425                            .dwattr $C$DW$45, DW_AT_name("first")
    1426                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("first")
    1427                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1428                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$45, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   27

    1430                            .dwattr $C$DW$45, DW_AT_decl_line(0xda)
    1431                            .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
    1432                    
    1433                    $C$DW$46        .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$38)
    1435                            .dwattr $C$DW$46, DW_AT_name("last")
    1436                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("last")
    1437                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1438                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1439                            .dwattr $C$DW$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1440                            .dwattr $C$DW$46, DW_AT_decl_line(0xdb)
    1441                            .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
    1442                    
    1443                    $C$DW$47        .dwtag  DW_TAG_member
    1444                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$67)
    1445                            .dwattr $C$DW$47, DW_AT_name("offset")
    1446                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("offset")
    1447                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1448                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1449                            .dwattr $C$DW$47, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1450                            .dwattr $C$DW$47, DW_AT_decl_line(0xdc)
    1451                            .dwattr $C$DW$47, DW_AT_decl_column(0x15)
    1452                    
    1453                    $C$DW$48        .dwtag  DW_TAG_member
    1454                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$40)
    1455                            .dwattr $C$DW$48, DW_AT_name("data")
    1456                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("data")
    1457                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1458                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1459                            .dwattr $C$DW$48, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1460                            .dwattr $C$DW$48, DW_AT_decl_line(0xdd)
    1461                            .dwattr $C$DW$48, DW_AT_decl_column(0x14)
    1462                    
    1463                            .dwattr $C$DW$T$68, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1464                            .dwattr $C$DW$T$68, DW_AT_decl_line(0xd4)
    1465                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    1466                            .dwendtag $C$DW$T$68
    1467                    
    1468                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1469                            .dwattr $C$DW$T$78, DW_AT_name("Graphics_FontEx")
    1470                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$68)
    1471                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1472                            .dwattr $C$DW$T$78, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1473                            .dwattr $C$DW$T$78, DW_AT_decl_line(0xde)
    1474                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1475                    
    1476                    
    1477                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1478                            .dwattr $C$DW$T$69, DW_AT_name("Graphics_Image")
    1479                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x10)
    1480                    $C$DW$49        .dwtag  DW_TAG_member
    1481                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$38)
    1482                            .dwattr $C$DW$49, DW_AT_name("bPP")
    1483                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("bPP")
    1484                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   28

    1485                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1486                            .dwattr $C$DW$49, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1487                            .dwattr $C$DW$49, DW_AT_decl_line(0x4f)
    1488                            .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
    1489                    
    1490                    $C$DW$50        .dwtag  DW_TAG_member
    1491                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$29)
    1492                            .dwattr $C$DW$50, DW_AT_name("xSize")
    1493                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("xSize")
    1494                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1495                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1496                            .dwattr $C$DW$50, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1497                            .dwattr $C$DW$50, DW_AT_decl_line(0x50)
    1498                            .dwattr $C$DW$50, DW_AT_decl_column(0x0e)
    1499                    
    1500                    $C$DW$51        .dwtag  DW_TAG_member
    1501                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$29)
    1502                            .dwattr $C$DW$51, DW_AT_name("ySize")
    1503                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ySize")
    1504                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1505                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1506                            .dwattr $C$DW$51, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1507                            .dwattr $C$DW$51, DW_AT_decl_line(0x51)
    1508                            .dwattr $C$DW$51, DW_AT_decl_column(0x0e)
    1509                    
    1510                    $C$DW$52        .dwtag  DW_TAG_member
    1511                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$29)
    1512                            .dwattr $C$DW$52, DW_AT_name("numColors")
    1513                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("numColors")
    1514                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1515                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1516                            .dwattr $C$DW$52, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1517                            .dwattr $C$DW$52, DW_AT_decl_line(0x52)
    1518                            .dwattr $C$DW$52, DW_AT_decl_column(0x0e)
    1519                    
    1520                    $C$DW$53        .dwtag  DW_TAG_member
    1521                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$42)
    1522                            .dwattr $C$DW$53, DW_AT_name("pPalette")
    1523                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("pPalette")
    1524                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1525                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1526                            .dwattr $C$DW$53, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1527                            .dwattr $C$DW$53, DW_AT_decl_line(0x53)
    1528                            .dwattr $C$DW$53, DW_AT_decl_column(0x17)
    1529                    
    1530                    $C$DW$54        .dwtag  DW_TAG_member
    1531                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$40)
    1532                            .dwattr $C$DW$54, DW_AT_name("pPixel")
    1533                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pPixel")
    1534                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1535                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1536                            .dwattr $C$DW$54, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1537                            .dwattr $C$DW$54, DW_AT_decl_line(0x54)
    1538                            .dwattr $C$DW$54, DW_AT_decl_column(0x15)
    1539                    
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   29

    1540                            .dwattr $C$DW$T$69, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1541                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x4d)
    1542                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    1543                            .dwendtag $C$DW$T$69
    1544                    
    1545                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1546                            .dwattr $C$DW$T$79, DW_AT_name("Graphics_Image")
    1547                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$69)
    1548                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1549                            .dwattr $C$DW$T$79, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1550                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x55)
    1551                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    1552                    
    1553                    $C$DW$T$80      .dwtag  DW_TAG_const_type
    1554                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    1555                    
    1556                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    1557                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1558                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    1559                    
    1560                    
    1561                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    1562                            .dwattr $C$DW$T$70, DW_AT_name("Graphics_Rectangle")
    1563                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x08)
    1564                    $C$DW$55        .dwtag  DW_TAG_member
    1565                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$34)
    1566                            .dwattr $C$DW$55, DW_AT_name("xMin")
    1567                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("xMin")
    1568                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1570                            .dwattr $C$DW$55, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1571                            .dwattr $C$DW$55, DW_AT_decl_line(0x60)
    1572                            .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1573                    
    1574                    $C$DW$56        .dwtag  DW_TAG_member
    1575                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$34)
    1576                            .dwattr $C$DW$56, DW_AT_name("yMin")
    1577                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("yMin")
    1578                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1579                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1580                            .dwattr $C$DW$56, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1581                            .dwattr $C$DW$56, DW_AT_decl_line(0x61)
    1582                            .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1583                    
    1584                    $C$DW$57        .dwtag  DW_TAG_member
    1585                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$34)
    1586                            .dwattr $C$DW$57, DW_AT_name("xMax")
    1587                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("xMax")
    1588                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1589                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1590                            .dwattr $C$DW$57, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1591                            .dwattr $C$DW$57, DW_AT_decl_line(0x62)
    1592                            .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1593                    
    1594                    $C$DW$58        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   30

    1595                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$34)
    1596                            .dwattr $C$DW$58, DW_AT_name("yMax")
    1597                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("yMax")
    1598                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1599                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1600                            .dwattr $C$DW$58, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1601                            .dwattr $C$DW$58, DW_AT_decl_line(0x63)
    1602                            .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
    1603                    
    1604                            .dwattr $C$DW$T$70, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1605                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x5e)
    1606                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    1607                            .dwendtag $C$DW$T$70
    1608                    
    1609                    $C$DW$T$23      .dwtag  DW_TAG_typedef
    1610                            .dwattr $C$DW$T$23, DW_AT_name("Graphics_Rectangle")
    1611                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$70)
    1612                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1613                            .dwattr $C$DW$T$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1614                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x64)
    1615                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    1616                    
    1617                    $C$DW$T$49      .dwtag  DW_TAG_const_type
    1618                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$23)
    1619                    
    1620                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    1621                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1622                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    1623                    
    1624                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1625                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1626                    
    1627                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1628                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1629                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1630                    
    1631                    
    1632                    $C$DW$T$35      .dwtag  DW_TAG_subroutine_type
    1633                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1634                    $C$DW$59        .dwtag  DW_TAG_formal_parameter
    1635                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
    1636                    
    1637                    $C$DW$60        .dwtag  DW_TAG_formal_parameter
    1638                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$34)
    1639                    
    1640                    $C$DW$61        .dwtag  DW_TAG_formal_parameter
    1641                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$34)
    1642                    
    1643                    $C$DW$62        .dwtag  DW_TAG_formal_parameter
    1644                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$29)
    1645                    
    1646                            .dwendtag $C$DW$T$35
    1647                    
    1648                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1649                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
TI ARM Assembler Unix v16.9.0 Sat Apr 29 06:20:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
normal1.asm                                                          PAGE   31

    1650                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    1651                    
    1652                    $C$DW$T$37      .dwtag  DW_TAG_const_type
    1653                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1654                    
