;******************************************************************************
;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
;* Date/Time created: Sat Apr 29 07:00:42 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../system_msp432p401r.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
	.global	SystemCoreClock
	.data
	.align	4
	.elfsym	SystemCoreClock,SYM_SIZE(4)
SystemCoreClock:
	.bits	3000000,32			; SystemCoreClock @ 0

$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("SystemCoreClock")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("SystemCoreClock")
	.dwattr $C$DW$1, DW_AT_location[DW_OP_addr SystemCoreClock]
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../system_msp432p401r.c")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5a)

        LDRB      V4, [A3, #708]        ; [DPU_3_PIPE] |118| 
        CBZ       V4, ||$C$L14||        ; [] 
        ; BRANCHCC OCCURS {||$C$L14||}   ; [] |118| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../system_msp432p401r.c",line 121,column 13,is_stmt,isa 1
        MOV       A1, #26970            ; [DPU_3_PIPE] |121| 
        STR       A1, [V2, #0]          ; [DPU_3_PIPE] |121| 
	.dwpsn	file "../system_msp432p401r.c",line 122,column 13,is_stmt,isa 1
        LDR       A1, [V2, #80]         ; [DPU_3_PIPE] |122| 
        ORR       A1, A1, #1            ; [DPU_3_PIPE] |122| 
        STR       A1, [V2, #80]         ; [DPU_3_PIPE] |122| 
	.dwpsn	file "../system_msp432p401r.c",line 123,column 13,is_stmt,isa 1
        STR       A4, [V2, #0]          ; [DPU_3_PIPE] |123| 
	.dwpsn	file "../system_msp432p401r.c",line 125,column 13,is_stmt,isa 1
        LDRB      V4, [A3, #708]        ; [DPU_3_PIPE] |125| 
        CBZ       V4, ||$C$L14||        ; [] 
        ; BRANCHCC OCCURS {||$C$L14||}   ; [] |125| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../system_msp432p401r.c",line 127,column 17,is_stmt,isa 1
        LDRB      V4, [A3, #0]          ; [DPU_3_PIPE] |127| 
        CBNZ      V4, ||$C$L13||        ; [] 
        ; BRANCHCC OCCURS {||$C$L13||}   ; [] |127| 
;* --------------------------------------------------------------------------*
||$C$L12||:    
	.dwpsn	file "../system_msp432p401r.c",line 133,column 21,is_stmt,isa 1
        MOV       A1, #32000            ; [DPU_3_PIPE] |133| 
        B         ||$C$L16||            ; [DPU_3_PIPE] |133| 
        ; BRANCH OCCURS {||$C$L16||}     ; [] |133| 
;* --------------------------------------------------------------------------*
||$C$L13||:    
	.dwpsn	file "../system_msp432p401r.c",line 129,column 21,is_stmt,isa 1
        MOV       A1, #128000           ; [DPU_3_PIPE] |129| 
	.dwpsn	file "../system_msp432p401r.c",line 130,column 17,is_stmt,isa 1
        B         ||$C$L16||            ; [DPU_3_PIPE] |130| 
        ; BRANCH OCCURS {||$C$L16||}     ; [] |130| 
;* --------------------------------------------------------------------------*
||$C$L14||:    
	.dwpsn	file "../system_msp432p401r.c",line 143,column 13,is_stmt,isa 1
        MOV       V1, #32768            ; [DPU_3_PIPE] |143| 
	.dwpsn	file "../system_msp432p401r.c",line 216,column 9,is_stmt,isa 1
        B         ||$C$L2||             ; [DPU_3_PIPE] |216| 
        ; BRANCH OCCURS {||$C$L2||}      ; [] |216| 
;* --------------------------------------------------------------------------*
||$C$L15||:    
	.dwpsn	file "../system_msp432p401r.c",line 147,column 9,is_stmt,isa 1
        MOV       A1, #10000            ; [DPU_3_PIPE] |147| 
;* --------------------------------------------------------------------------*
||$C$L16||:    
        SDIV      A1, A1, V9            ; [DPU_3_PIPE] |147| 
;* --------------------------------------------------------------------------*
||$C$L17||:    
        LDR       A2, $C$CON7           ; [DPU_3_PIPE] |147| 
        STR       A1, [A2, #0]          ; [DPU_3_PIPE] |147| 
;* --------------------------------------------------------------------------*
||$C$L18||:    
$C$DW$12	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$12, DW_AT_low_pc(0x00)
	.dwattr $C$DW$12, DW_AT_TI_return

        POP       {A4, V1, V2, V3, V4, PC} ; [DPU_3_PIPE] 
	.dwcfi	cfa_offset, 0
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$4, DW_AT_TI_end_file("../system_msp432p401r.c")
	.dwattr $C$DW$4, DW_AT_TI_end_line(0xf7)
	.dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$4

;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:SystemInit"
	.align	4
||$C$CON1||:	.bits	1073808384,32
	.align	4
||$C$CON2||:	.bits	1610618488,32
	.align	4
||$C$CON3||:	.bits	1073760268,32
	.align	4
||$C$CON4||:	.bits	1610404844,32
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text:SystemCoreClockUpdate"
	.align	4
||$C$CON5||:	.bits	1073808384,32
	.align	4
||$C$CON6||:	.bits	1109427772,32
	.align	4
||$C$CON7||:	.bits	SystemCoreClock,32
	.align	4
||$C$CON8||:	.bits	48000000,32
	.align	4
||$C$CON9||:	.bits	24000000,32
	.align	4
||$C$CON14||:	.bits	1109426392,32
	.align	4
||$C$CON15||:	.bits	2101248,32

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x68)
$C$DW$13	.dwtag  DW_TAG_member
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$13, DW_AT_name("KEY")
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("KEY")
	.dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$13, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$13, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$13, DW_AT_decl_column(0x11)

$C$DW$14	.dwtag  DW_TAG_member
	.dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$14, DW_AT_name("CTL0")
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("CTL0")
	.dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$14, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$14, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$14, DW_AT_decl_column(0x11)

$C$DW$15	.dwtag  DW_TAG_member
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$15, DW_AT_name("CTL1")
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("CTL1")
	.dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$15, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$15, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$15, DW_AT_decl_column(0x11)

$C$DW$16	.dwtag  DW_TAG_member
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$16, DW_AT_name("CTL2")
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("CTL2")
	.dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$16, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$16, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$16, DW_AT_decl_column(0x11)

$C$DW$17	.dwtag  DW_TAG_member
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$17, DW_AT_name("CTL3")
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("CTL3")
	.dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$17, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$17, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$17, DW_AT_decl_column(0x11)

$C$DW$18	.dwtag  DW_TAG_member
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$18, DW_AT_name("RESERVED0")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$18, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$18, DW_AT_decl_line(0x1d1)
	.dwattr $C$DW$18, DW_AT_decl_column(0x11)

$C$DW$19	.dwtag  DW_TAG_member
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$19, DW_AT_name("CLKEN")
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("CLKEN")
	.dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$19, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$19, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$19, DW_AT_decl_column(0x11)

$C$DW$20	.dwtag  DW_TAG_member
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$20, DW_AT_name("STAT")
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("STAT")
	.dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$20, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$20, DW_AT_decl_column(0x11)

$C$DW$21	.dwtag  DW_TAG_member
	.dwattr $C$DW$21, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$21, DW_AT_name("RESERVED1")
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$21, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$21, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$21, DW_AT_decl_column(0x11)

$C$DW$22	.dwtag  DW_TAG_member
	.dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$22, DW_AT_name("IE")
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("IE")
	.dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$22, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$22, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$22, DW_AT_decl_column(0x11)

$C$DW$23	.dwtag  DW_TAG_member
	.dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$23, DW_AT_name("RESERVED2")
	.dwattr $C$DW$23, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$23, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$23, DW_AT_decl_column(0x11)

$C$DW$24	.dwtag  DW_TAG_member
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$24, DW_AT_name("IFG")
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("IFG")
	.dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$24, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$24, DW_AT_decl_column(0x11)

$C$DW$25	.dwtag  DW_TAG_member
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$25, DW_AT_name("RESERVED3")
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$25, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$25, DW_AT_decl_column(0x11)

$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$26, DW_AT_name("CLRIFG")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("CLRIFG")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$26, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$26, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$26, DW_AT_decl_column(0x11)

$C$DW$27	.dwtag  DW_TAG_member
	.dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$27, DW_AT_name("RESERVED4")
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$27, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$27, DW_AT_decl_column(0x11)

$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$28, DW_AT_name("SETIFG")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("SETIFG")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$28, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$28, DW_AT_decl_column(0x11)

$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$29, DW_AT_name("RESERVED5")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$29, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$29, DW_AT_decl_column(0x11)

$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$30, DW_AT_name("DCOERCAL0")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("DCOERCAL0")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$30, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$30, DW_AT_decl_column(0x11)

$C$DW$31	.dwtag  DW_TAG_member
	.dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$31, DW_AT_name("DCOERCAL1")
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("DCOERCAL1")
	.dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$31, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$31, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$24

$C$DW$T$171	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$171, DW_AT_name("CS_Type")
	.dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$171, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x03)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x14c)
$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$32, DW_AT_name("TLV_CHECKSUM")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("TLV_CHECKSUM")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$32, DW_AT_decl_line(0x4b4)
	.dwattr $C$DW$32, DW_AT_decl_column(0x11)

$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$33, DW_AT_name("DEVICE_INFO_TAG")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("DEVICE_INFO_TAG")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$33, DW_AT_decl_line(0x4b5)
	.dwattr $C$DW$33, DW_AT_decl_column(0x11)

$C$DW$34	.dwtag  DW_TAG_member
	.dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$34, DW_AT_name("DEVICE_INFO_LEN")
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("DEVICE_INFO_LEN")
	.dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$34, DW_AT_decl_line(0x4b6)
	.dwattr $C$DW$34, DW_AT_decl_column(0x11)

$C$DW$35	.dwtag  DW_TAG_member
	.dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$35, DW_AT_name("DEVICE_ID")
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("DEVICE_ID")
	.dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$35, DW_AT_decl_line(0x4b7)
	.dwattr $C$DW$35, DW_AT_decl_column(0x11)

$C$DW$36	.dwtag  DW_TAG_member
	.dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$36, DW_AT_name("HWREV")
	.dwattr $C$DW$36, DW_AT_TI_symbol_name("HWREV")
	.dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$36, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$36, DW_AT_decl_line(0x4b8)
	.dwattr $C$DW$36, DW_AT_decl_column(0x11)

$C$DW$37	.dwtag  DW_TAG_member
	.dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$37, DW_AT_name("BCREV")
	.dwattr $C$DW$37, DW_AT_TI_symbol_name("BCREV")
	.dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$37, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$37, DW_AT_decl_line(0x4b9)
	.dwattr $C$DW$37, DW_AT_decl_column(0x11)

$C$DW$38	.dwtag  DW_TAG_member
	.dwattr $C$DW$38, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$38, DW_AT_name("ROM_DRVLIB_REV")
	.dwattr $C$DW$38, DW_AT_TI_symbol_name("ROM_DRVLIB_REV")
	.dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$38, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$38, DW_AT_decl_line(0x4ba)
	.dwattr $C$DW$38, DW_AT_decl_column(0x11)

$C$DW$39	.dwtag  DW_TAG_member
	.dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$39, DW_AT_name("DIE_REC_TAG")
	.dwattr $C$DW$39, DW_AT_TI_symbol_name("DIE_REC_TAG")
	.dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$39, DW_AT_decl_line(0x4bb)
	.dwattr $C$DW$39, DW_AT_decl_column(0x11)

$C$DW$40	.dwtag  DW_TAG_member
	.dwattr $C$DW$40, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$40, DW_AT_name("DIE_REC_LEN")
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("DIE_REC_LEN")
	.dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$40, DW_AT_decl_line(0x4bc)
	.dwattr $C$DW$40, DW_AT_decl_column(0x11)

$C$DW$41	.dwtag  DW_TAG_member
	.dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$41, DW_AT_name("DIE_XPOS")
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("DIE_XPOS")
	.dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$41, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$41, DW_AT_decl_line(0x4bd)
	.dwattr $C$DW$41, DW_AT_decl_column(0x11)

$C$DW$42	.dwtag  DW_TAG_member
	.dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$42, DW_AT_name("DIE_YPOS")
	.dwattr $C$DW$42, DW_AT_TI_symbol_name("DIE_YPOS")
	.dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$42, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$42, DW_AT_decl_line(0x4be)
	.dwattr $C$DW$42, DW_AT_decl_column(0x11)

$C$DW$43	.dwtag  DW_TAG_member
	.dwattr $C$DW$43, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$43, DW_AT_name("WAFER_ID")
	.dwattr $C$DW$43, DW_AT_TI_symbol_name("WAFER_ID")
	.dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$43, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$43, DW_AT_decl_line(0x4bf)
	.dwattr $C$DW$43, DW_AT_decl_column(0x11)

$C$DW$44	.dwtag  DW_TAG_member
	.dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$44, DW_AT_name("LOT_ID")
	.dwattr $C$DW$44, DW_AT_TI_symbol_name("LOT_ID")
	.dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$44, DW_AT_decl_line(0x4c0)
	.dwattr $C$DW$44, DW_AT_decl_column(0x11)

$C$DW$45	.dwtag  DW_TAG_member
	.dwattr $C$DW$45, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$45, DW_AT_name("RESERVED0")
	.dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$45, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$45, DW_AT_decl_line(0x4c1)
	.dwattr $C$DW$45, DW_AT_decl_column(0x11)

$C$DW$46	.dwtag  DW_TAG_member
	.dwattr $C$DW$46, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$46, DW_AT_name("RESERVED1")
	.dwattr $C$DW$46, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$46, DW_AT_decl_line(0x4c2)
	.dwattr $C$DW$46, DW_AT_decl_column(0x11)

$C$DW$47	.dwtag  DW_TAG_member
	.dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$47, DW_AT_name("RESERVED2")
	.dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$47, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$47, DW_AT_decl_line(0x4c3)
	.dwattr $C$DW$47, DW_AT_decl_column(0x11)

$C$DW$48	.dwtag  DW_TAG_member
	.dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$48, DW_AT_name("TEST_RESULTS")
	.dwattr $C$DW$48, DW_AT_TI_symbol_name("TEST_RESULTS")
	.dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$48, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$48, DW_AT_decl_line(0x4c4)
	.dwattr $C$DW$48, DW_AT_decl_column(0x11)

$C$DW$49	.dwtag  DW_TAG_member
	.dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$49, DW_AT_name("CS_CAL_TAG")
	.dwattr $C$DW$49, DW_AT_TI_symbol_name("CS_CAL_TAG")
	.dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$49, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$49, DW_AT_decl_line(0x4c5)
	.dwattr $C$DW$49, DW_AT_decl_column(0x11)

$C$DW$50	.dwtag  DW_TAG_member
	.dwattr $C$DW$50, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$50, DW_AT_name("CS_CAL_LEN")
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("CS_CAL_LEN")
	.dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$50, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$50, DW_AT_decl_line(0x4c6)
	.dwattr $C$DW$50, DW_AT_decl_column(0x11)

$C$DW$51	.dwtag  DW_TAG_member
	.dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$51, DW_AT_name("DCOIR_FCAL_RSEL04")
	.dwattr $C$DW$51, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL04")
	.dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$51, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$51, DW_AT_decl_line(0x4c7)
	.dwattr $C$DW$51, DW_AT_decl_column(0x11)

$C$DW$52	.dwtag  DW_TAG_member
	.dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$52, DW_AT_name("DCOIR_FCAL_RSEL5")
	.dwattr $C$DW$52, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL5")
	.dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$52, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$52, DW_AT_decl_line(0x4c8)
	.dwattr $C$DW$52, DW_AT_decl_column(0x11)

$C$DW$53	.dwtag  DW_TAG_member
	.dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$53, DW_AT_name("RESERVED3")
	.dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$53, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$53, DW_AT_decl_line(0x4c9)
	.dwattr $C$DW$53, DW_AT_decl_column(0x11)

$C$DW$54	.dwtag  DW_TAG_member
	.dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$54, DW_AT_name("RESERVED4")
	.dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$54, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$54, DW_AT_decl_line(0x4ca)
	.dwattr $C$DW$54, DW_AT_decl_column(0x11)

$C$DW$55	.dwtag  DW_TAG_member
	.dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$55, DW_AT_name("RESERVED5")
	.dwattr $C$DW$55, DW_AT_TI_symbol_name("RESERVED5")
	.dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$55, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$55, DW_AT_decl_line(0x4cb)
	.dwattr $C$DW$55, DW_AT_decl_column(0x11)

$C$DW$56	.dwtag  DW_TAG_member
	.dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$56, DW_AT_name("RESERVED6")
	.dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED6")
	.dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$56, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$56, DW_AT_decl_line(0x4cc)
	.dwattr $C$DW$56, DW_AT_decl_column(0x11)

$C$DW$57	.dwtag  DW_TAG_member
	.dwattr $C$DW$57, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$57, DW_AT_name("DCOIR_CONSTK_RSEL04")
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL04")
	.dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$57, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$57, DW_AT_decl_line(0x4cd)
	.dwattr $C$DW$57, DW_AT_decl_column(0x11)

$C$DW$58	.dwtag  DW_TAG_member
	.dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$58, DW_AT_name("DCOIR_CONSTK_RSEL5")
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL5")
	.dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$58, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$58, DW_AT_decl_line(0x4ce)
	.dwattr $C$DW$58, DW_AT_decl_column(0x11)

$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$59, DW_AT_name("DCOER_FCAL_RSEL04")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL04")
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$59, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$59, DW_AT_decl_line(0x4cf)
	.dwattr $C$DW$59, DW_AT_decl_column(0x11)

$C$DW$60	.dwtag  DW_TAG_member
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$60, DW_AT_name("DCOER_FCAL_RSEL5")
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL5")
	.dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$60, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$60, DW_AT_decl_line(0x4d0)
	.dwattr $C$DW$60, DW_AT_decl_column(0x11)

$C$DW$61	.dwtag  DW_TAG_member
	.dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$61, DW_AT_name("RESERVED7")
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("RESERVED7")
	.dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$61, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$61, DW_AT_decl_line(0x4d1)
	.dwattr $C$DW$61, DW_AT_decl_column(0x11)

$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$62, DW_AT_name("RESERVED8")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED8")
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$62, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$62, DW_AT_decl_line(0x4d2)
	.dwattr $C$DW$62, DW_AT_decl_column(0x11)

$C$DW$63	.dwtag  DW_TAG_member
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$63, DW_AT_name("RESERVED9")
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED9")
	.dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$63, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$63, DW_AT_decl_line(0x4d3)
	.dwattr $C$DW$63, DW_AT_decl_column(0x11)

$C$DW$64	.dwtag  DW_TAG_member
	.dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$64, DW_AT_name("RESERVED10")
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED10")
	.dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$64, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$64, DW_AT_decl_line(0x4d4)
	.dwattr $C$DW$64, DW_AT_decl_column(0x11)

$C$DW$65	.dwtag  DW_TAG_member
	.dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$65, DW_AT_name("DCOER_CONSTK_RSEL04")
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL04")
	.dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$65, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$65, DW_AT_decl_line(0x4d5)
	.dwattr $C$DW$65, DW_AT_decl_column(0x11)

$C$DW$66	.dwtag  DW_TAG_member
	.dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$66, DW_AT_name("DCOER_CONSTK_RSEL5")
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL5")
	.dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$66, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$66, DW_AT_decl_line(0x4d6)
	.dwattr $C$DW$66, DW_AT_decl_column(0x11)

$C$DW$67	.dwtag  DW_TAG_member
	.dwattr $C$DW$67, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$67, DW_AT_name("ADC14_CAL_TAG")
	.dwattr $C$DW$67, DW_AT_TI_symbol_name("ADC14_CAL_TAG")
	.dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$67, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$67, DW_AT_decl_line(0x4d7)
	.dwattr $C$DW$67, DW_AT_decl_column(0x11)

$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$68, DW_AT_name("ADC14_CAL_LEN")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("ADC14_CAL_LEN")
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$68, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$68, DW_AT_decl_line(0x4d8)
	.dwattr $C$DW$68, DW_AT_decl_column(0x11)

$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$69, DW_AT_name("ADC_GAIN_FACTOR")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("ADC_GAIN_FACTOR")
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$69, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$69, DW_AT_decl_line(0x4d9)
	.dwattr $C$DW$69, DW_AT_decl_column(0x11)

$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$70, DW_AT_name("ADC_OFFSET")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("ADC_OFFSET")
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$70, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$70, DW_AT_decl_line(0x4da)
	.dwattr $C$DW$70, DW_AT_decl_column(0x11)

$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$71, DW_AT_name("RESERVED11")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED11")
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$71, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$71, DW_AT_decl_line(0x4db)
	.dwattr $C$DW$71, DW_AT_decl_column(0x11)

$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$72, DW_AT_name("RESERVED12")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED12")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$72, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$72, DW_AT_decl_line(0x4dc)
	.dwattr $C$DW$72, DW_AT_decl_column(0x11)

$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$73, DW_AT_name("RESERVED13")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED13")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$73, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$73, DW_AT_decl_line(0x4dd)
	.dwattr $C$DW$73, DW_AT_decl_column(0x11)

$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$74, DW_AT_name("RESERVED14")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED14")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$74, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$74, DW_AT_decl_line(0x4de)
	.dwattr $C$DW$74, DW_AT_decl_column(0x11)

$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$75, DW_AT_name("RESERVED15")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED15")
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$75, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$75, DW_AT_decl_line(0x4df)
	.dwattr $C$DW$75, DW_AT_decl_column(0x11)

$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$76, DW_AT_name("RESERVED16")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED16")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$76, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$76, DW_AT_decl_line(0x4e0)
	.dwattr $C$DW$76, DW_AT_decl_column(0x11)

$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$77, DW_AT_name("RESERVED17")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED17")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$77, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$77, DW_AT_decl_line(0x4e1)
	.dwattr $C$DW$77, DW_AT_decl_column(0x11)

$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$78, DW_AT_name("RESERVED18")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED18")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$78, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$78, DW_AT_decl_line(0x4e2)
	.dwattr $C$DW$78, DW_AT_decl_column(0x11)

$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$79, DW_AT_name("RESERVED19")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED19")
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$79, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$79, DW_AT_decl_line(0x4e3)
	.dwattr $C$DW$79, DW_AT_decl_column(0x11)

$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$80, DW_AT_name("RESERVED20")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED20")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$80, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$80, DW_AT_decl_line(0x4e4)
	.dwattr $C$DW$80, DW_AT_decl_column(0x11)

$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$81, DW_AT_name("RESERVED21")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED21")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$81, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$81, DW_AT_decl_line(0x4e5)
	.dwattr $C$DW$81, DW_AT_decl_column(0x11)

$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$82, DW_AT_name("RESERVED22")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED22")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$82, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$82, DW_AT_decl_line(0x4e6)
	.dwattr $C$DW$82, DW_AT_decl_column(0x11)

$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$83, DW_AT_name("RESERVED23")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED23")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$83, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$83, DW_AT_decl_line(0x4e7)
	.dwattr $C$DW$83, DW_AT_decl_column(0x11)

$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$84, DW_AT_name("RESERVED24")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED24")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$84, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$84, DW_AT_decl_line(0x4e8)
	.dwattr $C$DW$84, DW_AT_decl_column(0x11)

$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$85, DW_AT_name("RESERVED25")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED25")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$85, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0x4e9)
	.dwattr $C$DW$85, DW_AT_decl_column(0x11)

$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$86, DW_AT_name("RESERVED26")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED26")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$86, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0x4ea)
	.dwattr $C$DW$86, DW_AT_decl_column(0x11)

$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$87, DW_AT_name("ADC14_REF1P2V_TS30C")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS30C")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$87, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0x4eb)
	.dwattr $C$DW$87, DW_AT_decl_column(0x11)

$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$88, DW_AT_name("ADC14_REF1P2V_TS85C")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS85C")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$88, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0x4ec)
	.dwattr $C$DW$88, DW_AT_decl_column(0x11)

$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$89, DW_AT_name("ADC14_REF1P45V_TS30C")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS30C")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$89, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0x4ed)
	.dwattr $C$DW$89, DW_AT_decl_column(0x11)

$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$90, DW_AT_name("ADC14_REF1P45V_TS85C")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS85C")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$90, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0x4ee)
	.dwattr $C$DW$90, DW_AT_decl_column(0x11)

$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$91, DW_AT_name("ADC14_REF2P5V_TS30C")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS30C")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$91, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0x4ef)
	.dwattr $C$DW$91, DW_AT_decl_column(0x11)

$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$92, DW_AT_name("ADC14_REF2P5V_TS85C")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS85C")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$92, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0x4f0)
	.dwattr $C$DW$92, DW_AT_decl_column(0x11)

$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$93, DW_AT_name("REF_CAL_TAG")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("REF_CAL_TAG")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$93, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0x4f1)
	.dwattr $C$DW$93, DW_AT_decl_column(0x11)

$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$94, DW_AT_name("REF_CAL_LEN")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("REF_CAL_LEN")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$94, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x4f2)
	.dwattr $C$DW$94, DW_AT_decl_column(0x11)

$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$95, DW_AT_name("REF_1P2V")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("REF_1P2V")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$95, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x4f3)
	.dwattr $C$DW$95, DW_AT_decl_column(0x11)

$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$96, DW_AT_name("REF_1P45V")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("REF_1P45V")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$96, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0x4f4)
	.dwattr $C$DW$96, DW_AT_decl_column(0x11)

$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$97, DW_AT_name("REF_2P5V")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("REF_2P5V")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$97, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0x4f5)
	.dwattr $C$DW$97, DW_AT_decl_column(0x11)

$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$98, DW_AT_name("FLASH_INFO_TAG")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("FLASH_INFO_TAG")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$98, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x4f6)
	.dwattr $C$DW$98, DW_AT_decl_column(0x11)

$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$99, DW_AT_name("FLASH_INFO_LEN")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("FLASH_INFO_LEN")
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$99, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$99, DW_AT_decl_line(0x4f7)
	.dwattr $C$DW$99, DW_AT_decl_column(0x11)

$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$100, DW_AT_name("FLASH_MAX_PROG_PULSES")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("FLASH_MAX_PROG_PULSES")
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$100, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$100, DW_AT_decl_line(0x4f8)
	.dwattr $C$DW$100, DW_AT_decl_column(0x11)

$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$101, DW_AT_name("FLASH_MAX_ERASE_PULSES")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("FLASH_MAX_ERASE_PULSES")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$101, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x4f9)
	.dwattr $C$DW$101, DW_AT_decl_column(0x11)

$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$102, DW_AT_name("RANDOM_NUM_TAG")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("RANDOM_NUM_TAG")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$102, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x4fa)
	.dwattr $C$DW$102, DW_AT_decl_column(0x11)

$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$103, DW_AT_name("RANDOM_NUM_LEN")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("RANDOM_NUM_LEN")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$103, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x4fb)
	.dwattr $C$DW$103, DW_AT_decl_column(0x11)

$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$104, DW_AT_name("RANDOM_NUM_1")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("RANDOM_NUM_1")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$104, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0x4fc)
	.dwattr $C$DW$104, DW_AT_decl_column(0x11)

$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$105, DW_AT_name("RANDOM_NUM_2")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("RANDOM_NUM_2")
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$105, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x4fd)
	.dwattr $C$DW$105, DW_AT_decl_column(0x11)

$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$106, DW_AT_name("RANDOM_NUM_3")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("RANDOM_NUM_3")
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$106, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$106, DW_AT_decl_line(0x4fe)
	.dwattr $C$DW$106, DW_AT_decl_column(0x11)

$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$107, DW_AT_name("RANDOM_NUM_4")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("RANDOM_NUM_4")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$107, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0x4ff)
	.dwattr $C$DW$107, DW_AT_decl_column(0x11)

$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$108, DW_AT_name("BSL_CFG_TAG")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("BSL_CFG_TAG")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$108, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x500)
	.dwattr $C$DW$108, DW_AT_decl_column(0x11)

$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$109, DW_AT_name("BSL_CFG_LEN")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("BSL_CFG_LEN")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$109, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x501)
	.dwattr $C$DW$109, DW_AT_decl_column(0x11)

$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$110, DW_AT_name("BSL_PERIPHIF_SEL")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("BSL_PERIPHIF_SEL")
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$110, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x502)
	.dwattr $C$DW$110, DW_AT_decl_column(0x11)

$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$111, DW_AT_name("BSL_PORTIF_CFG_UART")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_UART")
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$111, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x503)
	.dwattr $C$DW$111, DW_AT_decl_column(0x11)

$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$112, DW_AT_name("BSL_PORTIF_CFG_SPI")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_SPI")
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$112, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x504)
	.dwattr $C$DW$112, DW_AT_decl_column(0x11)

$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$113, DW_AT_name("BSL_PORTIF_CFG_I2C")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_I2C")
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$113, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0x505)
	.dwattr $C$DW$113, DW_AT_decl_column(0x11)

$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$114, DW_AT_name("TLV_END")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("TLV_END")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$114, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x506)
	.dwattr $C$DW$114, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x4b3)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$25

$C$DW$T$173	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$173, DW_AT_name("TLV_Type")
	.dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$173, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0x507)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x03)


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x8c)
$C$DW$115	.dwtag  DW_TAG_member
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$115, DW_AT_name("CPUID")
	.dwattr $C$DW$115, DW_AT_TI_symbol_name("CPUID")
	.dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$115, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$115, DW_AT_decl_column(0x12)

$C$DW$116	.dwtag  DW_TAG_member
	.dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$116, DW_AT_name("ICSR")
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("ICSR")
	.dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$116, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$116, DW_AT_decl_column(0x12)

$C$DW$117	.dwtag  DW_TAG_member
	.dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$117, DW_AT_name("VTOR")
	.dwattr $C$DW$117, DW_AT_TI_symbol_name("VTOR")
	.dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$117, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$117, DW_AT_decl_column(0x12)

$C$DW$118	.dwtag  DW_TAG_member
	.dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$118, DW_AT_name("AIRCR")
	.dwattr $C$DW$118, DW_AT_TI_symbol_name("AIRCR")
	.dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$118, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$118, DW_AT_decl_column(0x12)

$C$DW$119	.dwtag  DW_TAG_member
	.dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$119, DW_AT_name("SCR")
	.dwattr $C$DW$119, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$119, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$119, DW_AT_decl_column(0x12)

$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$120, DW_AT_name("CCR")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("CCR")
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$120, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$120, DW_AT_decl_column(0x12)

$C$DW$121	.dwtag  DW_TAG_member
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$121, DW_AT_name("SHP")
	.dwattr $C$DW$121, DW_AT_TI_symbol_name("SHP")
	.dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$121, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$121, DW_AT_decl_column(0x12)

$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$122, DW_AT_name("SHCSR")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("SHCSR")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$122, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$122, DW_AT_decl_column(0x12)

$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$123, DW_AT_name("CFSR")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("CFSR")
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$123, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$123, DW_AT_decl_column(0x12)

$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$124, DW_AT_name("HFSR")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("HFSR")
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$124, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$124, DW_AT_decl_column(0x12)

$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$125, DW_AT_name("DFSR")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("DFSR")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$125, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$125, DW_AT_decl_column(0x12)

$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$126, DW_AT_name("MMFAR")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("MMFAR")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$126, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$126, DW_AT_decl_column(0x12)

$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$127, DW_AT_name("BFAR")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("BFAR")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$127, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$127, DW_AT_decl_column(0x12)

$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$128, DW_AT_name("AFSR")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("AFSR")
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$128, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$128, DW_AT_decl_column(0x12)

$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$129, DW_AT_name("PFR")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("PFR")
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$129, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$129, DW_AT_decl_column(0x12)

$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$130, DW_AT_name("DFR")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("DFR")
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$130, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$130, DW_AT_decl_column(0x12)

$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$131, DW_AT_name("ADR")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("ADR")
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$131, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$131, DW_AT_decl_column(0x12)

$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$132, DW_AT_name("MMFR")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("MMFR")
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$132, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$132, DW_AT_decl_column(0x12)

$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$133, DW_AT_name("ISAR")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("ISAR")
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$133, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$133, DW_AT_decl_column(0x12)

$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$134, DW_AT_name("RESERVED0")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$134, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$134, DW_AT_decl_column(0x12)

$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$135, DW_AT_name("CPACR")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("CPACR")
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$135, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$135, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$33

$C$DW$T$175	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$175, DW_AT_name("SCB_Type")
	.dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$175, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/third_party/CMSIS/Include/core_cm4.h")
	.dwattr $C$DW$T$175, DW_AT_decl_line(0x1fc)
	.dwattr $C$DW$T$175, DW_AT_decl_column(0x03)


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x0e)
$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$136, DW_AT_name("RESERVED0")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$136, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x513)
	.dwattr $C$DW$136, DW_AT_decl_column(0x11)

$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$137, DW_AT_name("CTL")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("CTL")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$137, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0x514)
	.dwattr $C$DW$137, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$37, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x512)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$37

$C$DW$T$177	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$177, DW_AT_name("WDT_A_Type")
	.dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$177, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$177, DW_AT_decl_line(0x515)
	.dwattr $C$DW$T$177, DW_AT_decl_column(0x03)


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x44)
$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$138, DW_AT_name("REBOOT_CTL")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("REBOOT_CTL")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$138, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0x46b)
	.dwattr $C$DW$138, DW_AT_decl_column(0x11)

$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$139, DW_AT_name("NMI_CTLSTAT")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("NMI_CTLSTAT")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$139, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x46c)
	.dwattr $C$DW$139, DW_AT_decl_column(0x11)

$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$140, DW_AT_name("WDTRESET_CTL")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("WDTRESET_CTL")
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$140, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x46d)
	.dwattr $C$DW$140, DW_AT_decl_column(0x11)

$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$141, DW_AT_name("PERIHALT_CTL")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("PERIHALT_CTL")
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$141, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x46e)
	.dwattr $C$DW$141, DW_AT_decl_column(0x11)

$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$142, DW_AT_name("SRAM_SIZE")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("SRAM_SIZE")
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$142, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x46f)
	.dwattr $C$DW$142, DW_AT_decl_column(0x11)

$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$143, DW_AT_name("SRAM_BANKEN")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("SRAM_BANKEN")
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$143, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x470)
	.dwattr $C$DW$143, DW_AT_decl_column(0x11)

$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$144, DW_AT_name("SRAM_BANKRET")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("SRAM_BANKRET")
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$144, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x471)
	.dwattr $C$DW$144, DW_AT_decl_column(0x11)

$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$145, DW_AT_name("RESERVED0")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$145, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x472)
	.dwattr $C$DW$145, DW_AT_decl_column(0x11)

$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$146, DW_AT_name("FLASH_SIZE")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("FLASH_SIZE")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$146, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x473)
	.dwattr $C$DW$146, DW_AT_decl_column(0x11)

$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$147, DW_AT_name("RESERVED1")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x474)
	.dwattr $C$DW$147, DW_AT_decl_column(0x11)

$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$148, DW_AT_name("DIO_GLTFLT_CTL")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("DIO_GLTFLT_CTL")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x475)
	.dwattr $C$DW$148, DW_AT_decl_column(0x11)

$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$149, DW_AT_name("RESERVED2")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x476)
	.dwattr $C$DW$149, DW_AT_decl_column(0x11)

$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$150, DW_AT_name("SECDATA_UNLOCK")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("SECDATA_UNLOCK")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x477)
	.dwattr $C$DW$150, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x46a)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$39

$C$DW$T$179	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$179, DW_AT_name("SYSCTL_Type")
	.dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$179, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$T$179, DW_AT_decl_line(0x478)
	.dwattr $C$DW$T$179, DW_AT_decl_column(0x03)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x124)
$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$151, DW_AT_name("POWER_STAT")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("POWER_STAT")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x344)
	.dwattr $C$DW$151, DW_AT_decl_column(0x11)

$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$152, DW_AT_name("RESERVED0")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("RESERVED0")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x345)
	.dwattr $C$DW$152, DW_AT_decl_column(0x11)

$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$153, DW_AT_name("BANK0_RDCTL")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("BANK0_RDCTL")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x346)
	.dwattr $C$DW$153, DW_AT_decl_column(0x11)

$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$154, DW_AT_name("BANK1_RDCTL")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("BANK1_RDCTL")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x347)
	.dwattr $C$DW$154, DW_AT_decl_column(0x11)

$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$155, DW_AT_name("RESERVED1")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("RESERVED1")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x348)
	.dwattr $C$DW$155, DW_AT_decl_column(0x11)

$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$156, DW_AT_name("RDBRST_CTLSTAT")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("RDBRST_CTLSTAT")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x349)
	.dwattr $C$DW$156, DW_AT_decl_column(0x11)

$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$157, DW_AT_name("RDBRST_STARTADDR")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("RDBRST_STARTADDR")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x34a)
	.dwattr $C$DW$157, DW_AT_decl_column(0x11)

$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$158, DW_AT_name("RDBRST_LEN")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("RDBRST_LEN")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x34b)
	.dwattr $C$DW$158, DW_AT_decl_column(0x11)

$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$159, DW_AT_name("RESERVED2")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("RESERVED2")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x34c)
	.dwattr $C$DW$159, DW_AT_decl_column(0x11)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$160, DW_AT_name("RDBRST_FAILADDR")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("RDBRST_FAILADDR")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x34d)
	.dwattr $C$DW$160, DW_AT_decl_column(0x11)

$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$161, DW_AT_name("RDBRST_FAILCNT")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("RDBRST_FAILCNT")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x34e)
	.dwattr $C$DW$161, DW_AT_decl_column(0x11)

$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$162, DW_AT_name("RESERVED3")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("RESERVED3")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x34f)
	.dwattr $C$DW$162, DW_AT_decl_column(0x11)

$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$163, DW_AT_name("PRG_CTLSTAT")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("PRG_CTLSTAT")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x350)
	.dwattr $C$DW$163, DW_AT_decl_column(0x11)

$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$164, DW_AT_name("PRGBRST_CTLSTAT")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("PRGBRST_CTLSTAT")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x351)
	.dwattr $C$DW$164, DW_AT_decl_column(0x11)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$165, DW_AT_name("PRGBRST_STARTADDR")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("PRGBRST_STARTADDR")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x352)
	.dwattr $C$DW$165, DW_AT_decl_column(0x11)

$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$166, DW_AT_name("RESERVED4")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("RESERVED4")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x353)
	.dwattr $C$DW$166, DW_AT_decl_column(0x11)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$167, DW_AT_name("PRGBRST_DATA0_0")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("PRGBRST_DATA0_0")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x354)
	.dwattr $C$DW$167, DW_AT_decl_column(0x11)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$168, DW_AT_name("PRGBRST_DATA0_1")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("PRGBRST_DATA0_1")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x355)
	.dwattr $C$DW$168, DW_AT_decl_column(0x11)

$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$169, DW_AT_name("PRGBRST_DATA0_2")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("PRGBRST_DATA0_2")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x356)
	.dwattr $C$DW$169, DW_AT_decl_column(0x11)

$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$170, DW_AT_name("PRGBRST_DATA0_3")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("PRGBRST_DATA0_3")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x357)
	.dwattr $C$DW$170, DW_AT_decl_column(0x11)

$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$171, DW_AT_name("PRGBRST_DATA1_0")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("PRGBRST_DATA1_0")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x358)
	.dwattr $C$DW$171, DW_AT_decl_column(0x11)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$172, DW_AT_name("PRGBRST_DATA1_1")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("PRGBRST_DATA1_1")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x359)
	.dwattr $C$DW$172, DW_AT_decl_column(0x11)

$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$173, DW_AT_name("PRGBRST_DATA1_2")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("PRGBRST_DATA1_2")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x35a)
	.dwattr $C$DW$173, DW_AT_decl_column(0x11)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$174, DW_AT_name("PRGBRST_DATA1_3")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("PRGBRST_DATA1_3")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x35b)
	.dwattr $C$DW$174, DW_AT_decl_column(0x11)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$175, DW_AT_name("PRGBRST_DATA2_0")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("PRGBRST_DATA2_0")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x35c)
	.dwattr $C$DW$175, DW_AT_decl_column(0x11)

$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$176, DW_AT_name("PRGBRST_DATA2_1")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("PRGBRST_DATA2_1")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x35d)
	.dwattr $C$DW$176, DW_AT_decl_column(0x11)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$177, DW_AT_name("PRGBRST_DATA2_2")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("PRGBRST_DATA2_2")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_00_45/source/ti/devices/msp432p4xx/inc/msp432p401r.h")
