TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v16.9.0.LTS *
       3                    ;* Date/Time created: Sun Apr 30 23:23:07 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../system_msp432p401r.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v16.9.0.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/Users/jadedh/Desktop/2017Spring/EC450/workspace/PET/Debug")
      13                            .global SystemCoreClock
      14 00000000                   .data
      15                            .align  4

     773 0000015a F0FCFB90          SDIV      A1, A1, V9            ; [DPU_3_PIPE] |147|  ; [KEEP 32-BIT INS]
     774                    ;* --------------------------------------------------------------------------*
     775 0000015e           ||$C$L17||:    
     776 0000015e 4903              LDR       A2, $C$CON7           ; [DPU_3_PIPE] |147|  ; [ORIG 16-BIT INS]
     777 00000160 6008              STR       A1, [A2, #0]          ; [DPU_3_PIPE] |147|  ; [ORIG 16-BIT INS]
     778                    ;* --------------------------------------------------------------------------*
     779                    ||$C$L18||:    
     780                    $C$DW$12        .dwtag  DW_TAG_TI_branch
     781                            .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     782                            .dwattr $C$DW$12, DW_AT_TI_return
     783                    
     784 00000162 BDF8              POP       {A4, V1, V2, V3, V4, PC} ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     785                            .dwcfi  cfa_offset, 0
     786                            ; BRANCH OCCURS                  ; [] 
     787                            .dwattr $C$DW$4, DW_AT_TI_end_file("../system_msp432p401r.c")
     788                            .dwattr $C$DW$4, DW_AT_TI_end_line(0xf7)
     789                            .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     790                            .dwendentry
     791                            .dwendtag $C$DW$4
     792                    
     793                    ;******************************************************************************
     794                    ;* CONSTANT TABLE                                                             *
     795                    ;******************************************************************************
     796 00000056                   .sect   ".text:SystemInit"
     797                            .align  4
     798 00000056 040046C0  ||$C$CON1||:    .bits   1073808384,32
         0000005a 00004001 
     799                            .align  4
     800 0000005a 16784001  ||$C$CON2||:    .bits   1610618488,32
         0000005e 00006000 
     801                            .align  4
     802 0000005e 480C6000  ||$C$CON3||:    .bits   1073760268,32
         00000062 00004000 
     803                            .align  4
     804 00000062 D3EC4000  ||$C$CON4||:    .bits   1610404844,32
         00000066 00005FFC 
     805                    ;******************************************************************************
     806                    ;* CONSTANT TABLE                                                             *
     807                    ;******************************************************************************
     808 00000164                   .sect   ".text:SystemCoreClockUpdate"
     809                            .align  4
     810 00000164 40010400  ||$C$CON5||:    .bits   1073808384,32
     811                            .align  4
     812 00000168 4220863C  ||$C$CON6||:    .bits   1109427772,32
     813                            .align  4
     814 0000016c 00000000! ||$C$CON7||:    .bits   SystemCoreClock,32
     815                            .align  4
     816 00000170 02DC6C00  ||$C$CON8||:    .bits   48000000,32
     817                            .align  4
     818 00000174 016E3600  ||$C$CON9||:    .bits   24000000,32
     819                            .align  4
     820 00000178 422080D8  ||$C$CON14||:   .bits   1109426392,32
     821                            .align  4
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   16

     822 0000017c 00201000  ||$C$CON15||:   .bits   2101248,32
     823                    
     824                    ;******************************************************************************
     825                    ;* BUILD ATTRIBUTES                                                           *
     826                    ;******************************************************************************
     827                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     828                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     829                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     830                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     831                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     832                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     833                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(4)
     834                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     835                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     836                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     837                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     838                    
     839                    ;******************************************************************************
     840                    ;* TYPE INFORMATION                                                           *
     841                    ;******************************************************************************
     842                    
     843                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
     844                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x68)
     845                    $C$DW$13        .dwtag  DW_TAG_member
     846                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     847                            .dwattr $C$DW$13, DW_AT_name("KEY")
     848                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("KEY")
     849                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     851                            .dwattr $C$DW$13, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     852                            .dwattr $C$DW$13, DW_AT_decl_line(0x1cc)
     853                            .dwattr $C$DW$13, DW_AT_decl_column(0x11)
     854                    
     855                    $C$DW$14        .dwtag  DW_TAG_member
     856                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     857                            .dwattr $C$DW$14, DW_AT_name("CTL0")
     858                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("CTL0")
     859                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     860                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     861                            .dwattr $C$DW$14, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     862                            .dwattr $C$DW$14, DW_AT_decl_line(0x1cd)
     863                            .dwattr $C$DW$14, DW_AT_decl_column(0x11)
     864                    
     865                    $C$DW$15        .dwtag  DW_TAG_member
     866                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     867                            .dwattr $C$DW$15, DW_AT_name("CTL1")
     868                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("CTL1")
     869                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     870                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     871                            .dwattr $C$DW$15, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     872                            .dwattr $C$DW$15, DW_AT_decl_line(0x1ce)
     873                            .dwattr $C$DW$15, DW_AT_decl_column(0x11)
     874                    
     875                    $C$DW$16        .dwtag  DW_TAG_member
     876                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   17

     877                            .dwattr $C$DW$16, DW_AT_name("CTL2")
     878                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("CTL2")
     879                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     880                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     881                            .dwattr $C$DW$16, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     882                            .dwattr $C$DW$16, DW_AT_decl_line(0x1cf)
     883                            .dwattr $C$DW$16, DW_AT_decl_column(0x11)
     884                    
     885                    $C$DW$17        .dwtag  DW_TAG_member
     886                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
     887                            .dwattr $C$DW$17, DW_AT_name("CTL3")
     888                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("CTL3")
     889                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     890                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     891                            .dwattr $C$DW$17, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     892                            .dwattr $C$DW$17, DW_AT_decl_line(0x1d0)
     893                            .dwattr $C$DW$17, DW_AT_decl_column(0x11)
     894                    
     895                    $C$DW$18        .dwtag  DW_TAG_member
     896                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$21)
     897                            .dwattr $C$DW$18, DW_AT_name("RESERVED0")
     898                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("RESERVED0")
     899                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     900                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     901                            .dwattr $C$DW$18, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     902                            .dwattr $C$DW$18, DW_AT_decl_line(0x1d1)
     903                            .dwattr $C$DW$18, DW_AT_decl_column(0x11)
     904                    
     905                    $C$DW$19        .dwtag  DW_TAG_member
     906                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     907                            .dwattr $C$DW$19, DW_AT_name("CLKEN")
     908                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("CLKEN")
     909                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     910                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     911                            .dwattr $C$DW$19, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     912                            .dwattr $C$DW$19, DW_AT_decl_line(0x1d2)
     913                            .dwattr $C$DW$19, DW_AT_decl_column(0x11)
     914                    
     915                    $C$DW$20        .dwtag  DW_TAG_member
     916                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
     917                            .dwattr $C$DW$20, DW_AT_name("STAT")
     918                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("STAT")
     919                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     920                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     921                            .dwattr $C$DW$20, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     922                            .dwattr $C$DW$20, DW_AT_decl_line(0x1d3)
     923                            .dwattr $C$DW$20, DW_AT_decl_column(0x11)
     924                    
     925                    $C$DW$21        .dwtag  DW_TAG_member
     926                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$23)
     927                            .dwattr $C$DW$21, DW_AT_name("RESERVED1")
     928                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("RESERVED1")
     929                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     930                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     931                            .dwattr $C$DW$21, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   18

     932                            .dwattr $C$DW$21, DW_AT_decl_line(0x1d4)
     933                            .dwattr $C$DW$21, DW_AT_decl_column(0x11)
     934                    
     935                    $C$DW$22        .dwtag  DW_TAG_member
     936                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     937                            .dwattr $C$DW$22, DW_AT_name("IE")
     938                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("IE")
     939                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     940                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     941                            .dwattr $C$DW$22, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     942                            .dwattr $C$DW$22, DW_AT_decl_line(0x1d5)
     943                            .dwattr $C$DW$22, DW_AT_decl_column(0x11)
     944                    
     945                    $C$DW$23        .dwtag  DW_TAG_member
     946                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     947                            .dwattr $C$DW$23, DW_AT_name("RESERVED2")
     948                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("RESERVED2")
     949                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     950                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     951                            .dwattr $C$DW$23, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     952                            .dwattr $C$DW$23, DW_AT_decl_line(0x1d6)
     953                            .dwattr $C$DW$23, DW_AT_decl_column(0x11)
     954                    
     955                    $C$DW$24        .dwtag  DW_TAG_member
     956                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     957                            .dwattr $C$DW$24, DW_AT_name("IFG")
     958                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("IFG")
     959                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     960                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     961                            .dwattr $C$DW$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     962                            .dwattr $C$DW$24, DW_AT_decl_line(0x1d7)
     963                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     964                    
     965                    $C$DW$25        .dwtag  DW_TAG_member
     966                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     967                            .dwattr $C$DW$25, DW_AT_name("RESERVED3")
     968                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("RESERVED3")
     969                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     970                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     971                            .dwattr $C$DW$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     972                            .dwattr $C$DW$25, DW_AT_decl_line(0x1d8)
     973                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     974                    
     975                    $C$DW$26        .dwtag  DW_TAG_member
     976                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     977                            .dwattr $C$DW$26, DW_AT_name("CLRIFG")
     978                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("CLRIFG")
     979                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     980                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     981                            .dwattr $C$DW$26, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     982                            .dwattr $C$DW$26, DW_AT_decl_line(0x1d9)
     983                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     984                    
     985                    $C$DW$27        .dwtag  DW_TAG_member
     986                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   19

     987                            .dwattr $C$DW$27, DW_AT_name("RESERVED4")
     988                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("RESERVED4")
     989                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     990                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     991                            .dwattr $C$DW$27, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
     992                            .dwattr $C$DW$27, DW_AT_decl_line(0x1da)
     993                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     994                    
     995                    $C$DW$28        .dwtag  DW_TAG_member
     996                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     997                            .dwattr $C$DW$28, DW_AT_name("SETIFG")
     998                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("SETIFG")
     999                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1000                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
    1001                            .dwattr $C$DW$28, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1002                            .dwattr $C$DW$28, DW_AT_decl_line(0x1db)
    1003                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
    1004                    
    1005                    $C$DW$29        .dwtag  DW_TAG_member
    1006                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
    1007                            .dwattr $C$DW$29, DW_AT_name("RESERVED5")
    1008                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("RESERVED5")
    1009                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1010                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
    1011                            .dwattr $C$DW$29, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1012                            .dwattr $C$DW$29, DW_AT_decl_line(0x1dc)
    1013                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
    1014                    
    1015                    $C$DW$30        .dwtag  DW_TAG_member
    1016                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
    1017                            .dwattr $C$DW$30, DW_AT_name("DCOERCAL0")
    1018                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("DCOERCAL0")
    1019                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1020                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
    1021                            .dwattr $C$DW$30, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1022                            .dwattr $C$DW$30, DW_AT_decl_line(0x1dd)
    1023                            .dwattr $C$DW$30, DW_AT_decl_column(0x11)
    1024                    
    1025                    $C$DW$31        .dwtag  DW_TAG_member
    1026                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
    1027                            .dwattr $C$DW$31, DW_AT_name("DCOERCAL1")
    1028                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("DCOERCAL1")
    1029                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1030                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
    1031                            .dwattr $C$DW$31, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1032                            .dwattr $C$DW$31, DW_AT_decl_line(0x1de)
    1033                            .dwattr $C$DW$31, DW_AT_decl_column(0x11)
    1034                    
    1035                            .dwattr $C$DW$T$24, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1036                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x1cb)
    1037                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1038                            .dwendtag $C$DW$T$24
    1039                    
    1040                    $C$DW$T$171     .dwtag  DW_TAG_typedef
    1041                            .dwattr $C$DW$T$171, DW_AT_name("CS_Type")
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   20

    1042                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$24)
    1043                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    1044                            .dwattr $C$DW$T$171, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    1045                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x1df)
    1046                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x03)
    1047                    
    1048                    
    1049                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1050                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14c)
    1051                    $C$DW$32        .dwtag  DW_TAG_member
    1052                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
    1053                            .dwattr $C$DW$32, DW_AT_name("TLV_CHECKSUM")
    1054                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("TLV_CHECKSUM")
    1055                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
    1057                            .dwattr $C$DW$32, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1058                            .dwattr $C$DW$32, DW_AT_decl_line(0x4b4)
    1059                            .dwattr $C$DW$32, DW_AT_decl_column(0x11)
    1060                    
    1061                    $C$DW$33        .dwtag  DW_TAG_member
    1062                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
    1063                            .dwattr $C$DW$33, DW_AT_name("DEVICE_INFO_TAG")
    1064                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("DEVICE_INFO_TAG")
    1065                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1066                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
    1067                            .dwattr $C$DW$33, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1068                            .dwattr $C$DW$33, DW_AT_decl_line(0x4b5)
    1069                            .dwattr $C$DW$33, DW_AT_decl_column(0x11)
    1070                    
    1071                    $C$DW$34        .dwtag  DW_TAG_member
    1072                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
    1073                            .dwattr $C$DW$34, DW_AT_name("DEVICE_INFO_LEN")
    1074                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("DEVICE_INFO_LEN")
    1075                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1076                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
    1077                            .dwattr $C$DW$34, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1078                            .dwattr $C$DW$34, DW_AT_decl_line(0x4b6)
    1079                            .dwattr $C$DW$34, DW_AT_decl_column(0x11)
    1080                    
    1081                    $C$DW$35        .dwtag  DW_TAG_member
    1082                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
    1083                            .dwattr $C$DW$35, DW_AT_name("DEVICE_ID")
    1084                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DEVICE_ID")
    1085                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1086                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
    1087                            .dwattr $C$DW$35, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1088                            .dwattr $C$DW$35, DW_AT_decl_line(0x4b7)
    1089                            .dwattr $C$DW$35, DW_AT_decl_column(0x11)
    1090                    
    1091                    $C$DW$36        .dwtag  DW_TAG_member
    1092                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
    1093                            .dwattr $C$DW$36, DW_AT_name("HWREV")
    1094                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("HWREV")
    1095                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1096                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   21

    1097                            .dwattr $C$DW$36, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1098                            .dwattr $C$DW$36, DW_AT_decl_line(0x4b8)
    1099                            .dwattr $C$DW$36, DW_AT_decl_column(0x11)
    1100                    
    1101                    $C$DW$37        .dwtag  DW_TAG_member
    1102                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
    1103                            .dwattr $C$DW$37, DW_AT_name("BCREV")
    1104                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("BCREV")
    1105                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1106                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
    1107                            .dwattr $C$DW$37, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1108                            .dwattr $C$DW$37, DW_AT_decl_line(0x4b9)
    1109                            .dwattr $C$DW$37, DW_AT_decl_column(0x11)
    1110                    
    1111                    $C$DW$38        .dwtag  DW_TAG_member
    1112                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$22)
    1113                            .dwattr $C$DW$38, DW_AT_name("ROM_DRVLIB_REV")
    1114                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("ROM_DRVLIB_REV")
    1115                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1116                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
    1117                            .dwattr $C$DW$38, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1118                            .dwattr $C$DW$38, DW_AT_decl_line(0x4ba)
    1119                            .dwattr $C$DW$38, DW_AT_decl_column(0x11)
    1120                    
    1121                    $C$DW$39        .dwtag  DW_TAG_member
    1122                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
    1123                            .dwattr $C$DW$39, DW_AT_name("DIE_REC_TAG")
    1124                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("DIE_REC_TAG")
    1125                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1126                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
    1127                            .dwattr $C$DW$39, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1128                            .dwattr $C$DW$39, DW_AT_decl_line(0x4bb)
    1129                            .dwattr $C$DW$39, DW_AT_decl_column(0x11)
    1130                    
    1131                    $C$DW$40        .dwtag  DW_TAG_member
    1132                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$22)
    1133                            .dwattr $C$DW$40, DW_AT_name("DIE_REC_LEN")
    1134                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("DIE_REC_LEN")
    1135                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1136                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1137                            .dwattr $C$DW$40, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1138                            .dwattr $C$DW$40, DW_AT_decl_line(0x4bc)
    1139                            .dwattr $C$DW$40, DW_AT_decl_column(0x11)
    1140                    
    1141                    $C$DW$41        .dwtag  DW_TAG_member
    1142                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
    1143                            .dwattr $C$DW$41, DW_AT_name("DIE_XPOS")
    1144                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("DIE_XPOS")
    1145                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1146                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1147                            .dwattr $C$DW$41, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1148                            .dwattr $C$DW$41, DW_AT_decl_line(0x4bd)
    1149                            .dwattr $C$DW$41, DW_AT_decl_column(0x11)
    1150                    
    1151                    $C$DW$42        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   22

    1152                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
    1153                            .dwattr $C$DW$42, DW_AT_name("DIE_YPOS")
    1154                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("DIE_YPOS")
    1155                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1156                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1157                            .dwattr $C$DW$42, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1158                            .dwattr $C$DW$42, DW_AT_decl_line(0x4be)
    1159                            .dwattr $C$DW$42, DW_AT_decl_column(0x11)
    1160                    
    1161                    $C$DW$43        .dwtag  DW_TAG_member
    1162                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$22)
    1163                            .dwattr $C$DW$43, DW_AT_name("WAFER_ID")
    1164                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("WAFER_ID")
    1165                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1166                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1167                            .dwattr $C$DW$43, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1168                            .dwattr $C$DW$43, DW_AT_decl_line(0x4bf)
    1169                            .dwattr $C$DW$43, DW_AT_decl_column(0x11)
    1170                    
    1171                    $C$DW$44        .dwtag  DW_TAG_member
    1172                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
    1173                            .dwattr $C$DW$44, DW_AT_name("LOT_ID")
    1174                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("LOT_ID")
    1175                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1176                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1177                            .dwattr $C$DW$44, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1178                            .dwattr $C$DW$44, DW_AT_decl_line(0x4c0)
    1179                            .dwattr $C$DW$44, DW_AT_decl_column(0x11)
    1180                    
    1181                    $C$DW$45        .dwtag  DW_TAG_member
    1182                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$22)
    1183                            .dwattr $C$DW$45, DW_AT_name("RESERVED0")
    1184                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED0")
    1185                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1186                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1187                            .dwattr $C$DW$45, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1188                            .dwattr $C$DW$45, DW_AT_decl_line(0x4c1)
    1189                            .dwattr $C$DW$45, DW_AT_decl_column(0x11)
    1190                    
    1191                    $C$DW$46        .dwtag  DW_TAG_member
    1192                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$22)
    1193                            .dwattr $C$DW$46, DW_AT_name("RESERVED1")
    1194                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("RESERVED1")
    1195                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1196                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1197                            .dwattr $C$DW$46, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1198                            .dwattr $C$DW$46, DW_AT_decl_line(0x4c2)
    1199                            .dwattr $C$DW$46, DW_AT_decl_column(0x11)
    1200                    
    1201                    $C$DW$47        .dwtag  DW_TAG_member
    1202                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
    1203                            .dwattr $C$DW$47, DW_AT_name("RESERVED2")
    1204                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED2")
    1205                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1206                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   23

    1207                            .dwattr $C$DW$47, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1208                            .dwattr $C$DW$47, DW_AT_decl_line(0x4c3)
    1209                            .dwattr $C$DW$47, DW_AT_decl_column(0x11)
    1210                    
    1211                    $C$DW$48        .dwtag  DW_TAG_member
    1212                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
    1213                            .dwattr $C$DW$48, DW_AT_name("TEST_RESULTS")
    1214                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("TEST_RESULTS")
    1215                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1216                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1217                            .dwattr $C$DW$48, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1218                            .dwattr $C$DW$48, DW_AT_decl_line(0x4c4)
    1219                            .dwattr $C$DW$48, DW_AT_decl_column(0x11)
    1220                    
    1221                    $C$DW$49        .dwtag  DW_TAG_member
    1222                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
    1223                            .dwattr $C$DW$49, DW_AT_name("CS_CAL_TAG")
    1224                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("CS_CAL_TAG")
    1225                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1226                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1227                            .dwattr $C$DW$49, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1228                            .dwattr $C$DW$49, DW_AT_decl_line(0x4c5)
    1229                            .dwattr $C$DW$49, DW_AT_decl_column(0x11)
    1230                    
    1231                    $C$DW$50        .dwtag  DW_TAG_member
    1232                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$22)
    1233                            .dwattr $C$DW$50, DW_AT_name("CS_CAL_LEN")
    1234                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("CS_CAL_LEN")
    1235                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1236                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1237                            .dwattr $C$DW$50, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1238                            .dwattr $C$DW$50, DW_AT_decl_line(0x4c6)
    1239                            .dwattr $C$DW$50, DW_AT_decl_column(0x11)
    1240                    
    1241                    $C$DW$51        .dwtag  DW_TAG_member
    1242                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
    1243                            .dwattr $C$DW$51, DW_AT_name("DCOIR_FCAL_RSEL04")
    1244                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL04")
    1245                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1246                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1247                            .dwattr $C$DW$51, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1248                            .dwattr $C$DW$51, DW_AT_decl_line(0x4c7)
    1249                            .dwattr $C$DW$51, DW_AT_decl_column(0x11)
    1250                    
    1251                    $C$DW$52        .dwtag  DW_TAG_member
    1252                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
    1253                            .dwattr $C$DW$52, DW_AT_name("DCOIR_FCAL_RSEL5")
    1254                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL5")
    1255                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1256                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1257                            .dwattr $C$DW$52, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1258                            .dwattr $C$DW$52, DW_AT_decl_line(0x4c8)
    1259                            .dwattr $C$DW$52, DW_AT_decl_column(0x11)
    1260                    
    1261                    $C$DW$53        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   24

    1262                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
    1263                            .dwattr $C$DW$53, DW_AT_name("RESERVED3")
    1264                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED3")
    1265                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1266                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1267                            .dwattr $C$DW$53, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1268                            .dwattr $C$DW$53, DW_AT_decl_line(0x4c9)
    1269                            .dwattr $C$DW$53, DW_AT_decl_column(0x11)
    1270                    
    1271                    $C$DW$54        .dwtag  DW_TAG_member
    1272                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
    1273                            .dwattr $C$DW$54, DW_AT_name("RESERVED4")
    1274                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED4")
    1275                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1276                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1277                            .dwattr $C$DW$54, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1278                            .dwattr $C$DW$54, DW_AT_decl_line(0x4ca)
    1279                            .dwattr $C$DW$54, DW_AT_decl_column(0x11)
    1280                    
    1281                    $C$DW$55        .dwtag  DW_TAG_member
    1282                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
    1283                            .dwattr $C$DW$55, DW_AT_name("RESERVED5")
    1284                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("RESERVED5")
    1285                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1286                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1287                            .dwattr $C$DW$55, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1288                            .dwattr $C$DW$55, DW_AT_decl_line(0x4cb)
    1289                            .dwattr $C$DW$55, DW_AT_decl_column(0x11)
    1290                    
    1291                    $C$DW$56        .dwtag  DW_TAG_member
    1292                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
    1293                            .dwattr $C$DW$56, DW_AT_name("RESERVED6")
    1294                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED6")
    1295                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1296                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1297                            .dwattr $C$DW$56, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1298                            .dwattr $C$DW$56, DW_AT_decl_line(0x4cc)
    1299                            .dwattr $C$DW$56, DW_AT_decl_column(0x11)
    1300                    
    1301                    $C$DW$57        .dwtag  DW_TAG_member
    1302                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$22)
    1303                            .dwattr $C$DW$57, DW_AT_name("DCOIR_CONSTK_RSEL04")
    1304                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL04")
    1305                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1306                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1307                            .dwattr $C$DW$57, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1308                            .dwattr $C$DW$57, DW_AT_decl_line(0x4cd)
    1309                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1310                    
    1311                    $C$DW$58        .dwtag  DW_TAG_member
    1312                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
    1313                            .dwattr $C$DW$58, DW_AT_name("DCOIR_CONSTK_RSEL5")
    1314                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL5")
    1315                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1316                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   25

    1317                            .dwattr $C$DW$58, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1318                            .dwattr $C$DW$58, DW_AT_decl_line(0x4ce)
    1319                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
    1320                    
    1321                    $C$DW$59        .dwtag  DW_TAG_member
    1322                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
    1323                            .dwattr $C$DW$59, DW_AT_name("DCOER_FCAL_RSEL04")
    1324                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL04")
    1325                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1326                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1327                            .dwattr $C$DW$59, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1328                            .dwattr $C$DW$59, DW_AT_decl_line(0x4cf)
    1329                            .dwattr $C$DW$59, DW_AT_decl_column(0x11)
    1330                    
    1331                    $C$DW$60        .dwtag  DW_TAG_member
    1332                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
    1333                            .dwattr $C$DW$60, DW_AT_name("DCOER_FCAL_RSEL5")
    1334                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL5")
    1335                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1336                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1337                            .dwattr $C$DW$60, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1338                            .dwattr $C$DW$60, DW_AT_decl_line(0x4d0)
    1339                            .dwattr $C$DW$60, DW_AT_decl_column(0x11)
    1340                    
    1341                    $C$DW$61        .dwtag  DW_TAG_member
    1342                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
    1343                            .dwattr $C$DW$61, DW_AT_name("RESERVED7")
    1344                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("RESERVED7")
    1345                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1346                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1347                            .dwattr $C$DW$61, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1348                            .dwattr $C$DW$61, DW_AT_decl_line(0x4d1)
    1349                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1350                    
    1351                    $C$DW$62        .dwtag  DW_TAG_member
    1352                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
    1353                            .dwattr $C$DW$62, DW_AT_name("RESERVED8")
    1354                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED8")
    1355                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1356                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1357                            .dwattr $C$DW$62, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1358                            .dwattr $C$DW$62, DW_AT_decl_line(0x4d2)
    1359                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1360                    
    1361                    $C$DW$63        .dwtag  DW_TAG_member
    1362                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
    1363                            .dwattr $C$DW$63, DW_AT_name("RESERVED9")
    1364                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED9")
    1365                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1366                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1367                            .dwattr $C$DW$63, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1368                            .dwattr $C$DW$63, DW_AT_decl_line(0x4d3)
    1369                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1370                    
    1371                    $C$DW$64        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   26

    1372                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
    1373                            .dwattr $C$DW$64, DW_AT_name("RESERVED10")
    1374                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED10")
    1375                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1376                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1377                            .dwattr $C$DW$64, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1378                            .dwattr $C$DW$64, DW_AT_decl_line(0x4d4)
    1379                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1380                    
    1381                    $C$DW$65        .dwtag  DW_TAG_member
    1382                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
    1383                            .dwattr $C$DW$65, DW_AT_name("DCOER_CONSTK_RSEL04")
    1384                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL04")
    1385                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1386                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1387                            .dwattr $C$DW$65, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1388                            .dwattr $C$DW$65, DW_AT_decl_line(0x4d5)
    1389                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
    1390                    
    1391                    $C$DW$66        .dwtag  DW_TAG_member
    1392                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1393                            .dwattr $C$DW$66, DW_AT_name("DCOER_CONSTK_RSEL5")
    1394                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL5")
    1395                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1396                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1397                            .dwattr $C$DW$66, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1398                            .dwattr $C$DW$66, DW_AT_decl_line(0x4d6)
    1399                            .dwattr $C$DW$66, DW_AT_decl_column(0x11)
    1400                    
    1401                    $C$DW$67        .dwtag  DW_TAG_member
    1402                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$22)
    1403                            .dwattr $C$DW$67, DW_AT_name("ADC14_CAL_TAG")
    1404                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("ADC14_CAL_TAG")
    1405                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1406                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1407                            .dwattr $C$DW$67, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1408                            .dwattr $C$DW$67, DW_AT_decl_line(0x4d7)
    1409                            .dwattr $C$DW$67, DW_AT_decl_column(0x11)
    1410                    
    1411                    $C$DW$68        .dwtag  DW_TAG_member
    1412                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
    1413                            .dwattr $C$DW$68, DW_AT_name("ADC14_CAL_LEN")
    1414                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("ADC14_CAL_LEN")
    1415                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1416                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1417                            .dwattr $C$DW$68, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1418                            .dwattr $C$DW$68, DW_AT_decl_line(0x4d8)
    1419                            .dwattr $C$DW$68, DW_AT_decl_column(0x11)
    1420                    
    1421                    $C$DW$69        .dwtag  DW_TAG_member
    1422                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
    1423                            .dwattr $C$DW$69, DW_AT_name("ADC_GAIN_FACTOR")
    1424                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("ADC_GAIN_FACTOR")
    1425                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1426                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   27

    1427                            .dwattr $C$DW$69, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1428                            .dwattr $C$DW$69, DW_AT_decl_line(0x4d9)
    1429                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1430                    
    1431                    $C$DW$70        .dwtag  DW_TAG_member
    1432                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
    1433                            .dwattr $C$DW$70, DW_AT_name("ADC_OFFSET")
    1434                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ADC_OFFSET")
    1435                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1436                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1437                            .dwattr $C$DW$70, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1438                            .dwattr $C$DW$70, DW_AT_decl_line(0x4da)
    1439                            .dwattr $C$DW$70, DW_AT_decl_column(0x11)
    1440                    
    1441                    $C$DW$71        .dwtag  DW_TAG_member
    1442                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
    1443                            .dwattr $C$DW$71, DW_AT_name("RESERVED11")
    1444                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED11")
    1445                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1446                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1447                            .dwattr $C$DW$71, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1448                            .dwattr $C$DW$71, DW_AT_decl_line(0x4db)
    1449                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
    1450                    
    1451                    $C$DW$72        .dwtag  DW_TAG_member
    1452                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
    1453                            .dwattr $C$DW$72, DW_AT_name("RESERVED12")
    1454                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED12")
    1455                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1456                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1457                            .dwattr $C$DW$72, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1458                            .dwattr $C$DW$72, DW_AT_decl_line(0x4dc)
    1459                            .dwattr $C$DW$72, DW_AT_decl_column(0x11)
    1460                    
    1461                    $C$DW$73        .dwtag  DW_TAG_member
    1462                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$22)
    1463                            .dwattr $C$DW$73, DW_AT_name("RESERVED13")
    1464                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED13")
    1465                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1466                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1467                            .dwattr $C$DW$73, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1468                            .dwattr $C$DW$73, DW_AT_decl_line(0x4dd)
    1469                            .dwattr $C$DW$73, DW_AT_decl_column(0x11)
    1470                    
    1471                    $C$DW$74        .dwtag  DW_TAG_member
    1472                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$22)
    1473                            .dwattr $C$DW$74, DW_AT_name("RESERVED14")
    1474                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED14")
    1475                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1476                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$74, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1478                            .dwattr $C$DW$74, DW_AT_decl_line(0x4de)
    1479                            .dwattr $C$DW$74, DW_AT_decl_column(0x11)
    1480                    
    1481                    $C$DW$75        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   28

    1482                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
    1483                            .dwattr $C$DW$75, DW_AT_name("RESERVED15")
    1484                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED15")
    1485                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1486                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1487                            .dwattr $C$DW$75, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1488                            .dwattr $C$DW$75, DW_AT_decl_line(0x4df)
    1489                            .dwattr $C$DW$75, DW_AT_decl_column(0x11)
    1490                    
    1491                    $C$DW$76        .dwtag  DW_TAG_member
    1492                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$22)
    1493                            .dwattr $C$DW$76, DW_AT_name("RESERVED16")
    1494                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED16")
    1495                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1496                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1497                            .dwattr $C$DW$76, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1498                            .dwattr $C$DW$76, DW_AT_decl_line(0x4e0)
    1499                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1500                    
    1501                    $C$DW$77        .dwtag  DW_TAG_member
    1502                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
    1503                            .dwattr $C$DW$77, DW_AT_name("RESERVED17")
    1504                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED17")
    1505                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1506                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1507                            .dwattr $C$DW$77, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1508                            .dwattr $C$DW$77, DW_AT_decl_line(0x4e1)
    1509                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1510                    
    1511                    $C$DW$78        .dwtag  DW_TAG_member
    1512                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$22)
    1513                            .dwattr $C$DW$78, DW_AT_name("RESERVED18")
    1514                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED18")
    1515                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1516                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1517                            .dwattr $C$DW$78, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1518                            .dwattr $C$DW$78, DW_AT_decl_line(0x4e2)
    1519                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1520                    
    1521                    $C$DW$79        .dwtag  DW_TAG_member
    1522                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
    1523                            .dwattr $C$DW$79, DW_AT_name("RESERVED19")
    1524                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED19")
    1525                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1526                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1527                            .dwattr $C$DW$79, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1528                            .dwattr $C$DW$79, DW_AT_decl_line(0x4e3)
    1529                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1530                    
    1531                    $C$DW$80        .dwtag  DW_TAG_member
    1532                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$22)
    1533                            .dwattr $C$DW$80, DW_AT_name("RESERVED20")
    1534                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED20")
    1535                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1536                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   29

    1537                            .dwattr $C$DW$80, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1538                            .dwattr $C$DW$80, DW_AT_decl_line(0x4e4)
    1539                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1540                    
    1541                    $C$DW$81        .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
    1543                            .dwattr $C$DW$81, DW_AT_name("RESERVED21")
    1544                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED21")
    1545                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1546                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1547                            .dwattr $C$DW$81, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1548                            .dwattr $C$DW$81, DW_AT_decl_line(0x4e5)
    1549                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1550                    
    1551                    $C$DW$82        .dwtag  DW_TAG_member
    1552                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$22)
    1553                            .dwattr $C$DW$82, DW_AT_name("RESERVED22")
    1554                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED22")
    1555                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1556                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1557                            .dwattr $C$DW$82, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1558                            .dwattr $C$DW$82, DW_AT_decl_line(0x4e6)
    1559                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1560                    
    1561                    $C$DW$83        .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
    1563                            .dwattr $C$DW$83, DW_AT_name("RESERVED23")
    1564                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED23")
    1565                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1566                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1567                            .dwattr $C$DW$83, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1568                            .dwattr $C$DW$83, DW_AT_decl_line(0x4e7)
    1569                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1570                    
    1571                    $C$DW$84        .dwtag  DW_TAG_member
    1572                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$22)
    1573                            .dwattr $C$DW$84, DW_AT_name("RESERVED24")
    1574                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED24")
    1575                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1576                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1577                            .dwattr $C$DW$84, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1578                            .dwattr $C$DW$84, DW_AT_decl_line(0x4e8)
    1579                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1580                    
    1581                    $C$DW$85        .dwtag  DW_TAG_member
    1582                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    1583                            .dwattr $C$DW$85, DW_AT_name("RESERVED25")
    1584                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED25")
    1585                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1586                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1587                            .dwattr $C$DW$85, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1588                            .dwattr $C$DW$85, DW_AT_decl_line(0x4e9)
    1589                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1590                    
    1591                    $C$DW$86        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   30

    1592                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
    1593                            .dwattr $C$DW$86, DW_AT_name("RESERVED26")
    1594                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED26")
    1595                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1596                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1597                            .dwattr $C$DW$86, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1598                            .dwattr $C$DW$86, DW_AT_decl_line(0x4ea)
    1599                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1600                    
    1601                    $C$DW$87        .dwtag  DW_TAG_member
    1602                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1603                            .dwattr $C$DW$87, DW_AT_name("ADC14_REF1P2V_TS30C")
    1604                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS30C")
    1605                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1606                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1607                            .dwattr $C$DW$87, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1608                            .dwattr $C$DW$87, DW_AT_decl_line(0x4eb)
    1609                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1610                    
    1611                    $C$DW$88        .dwtag  DW_TAG_member
    1612                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    1613                            .dwattr $C$DW$88, DW_AT_name("ADC14_REF1P2V_TS85C")
    1614                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS85C")
    1615                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1616                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1617                            .dwattr $C$DW$88, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1618                            .dwattr $C$DW$88, DW_AT_decl_line(0x4ec)
    1619                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1620                    
    1621                    $C$DW$89        .dwtag  DW_TAG_member
    1622                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
    1623                            .dwattr $C$DW$89, DW_AT_name("ADC14_REF1P45V_TS30C")
    1624                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS30C")
    1625                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1626                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1627                            .dwattr $C$DW$89, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1628                            .dwattr $C$DW$89, DW_AT_decl_line(0x4ed)
    1629                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1630                    
    1631                    $C$DW$90        .dwtag  DW_TAG_member
    1632                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
    1633                            .dwattr $C$DW$90, DW_AT_name("ADC14_REF1P45V_TS85C")
    1634                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS85C")
    1635                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1636                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$90, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1638                            .dwattr $C$DW$90, DW_AT_decl_line(0x4ee)
    1639                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1640                    
    1641                    $C$DW$91        .dwtag  DW_TAG_member
    1642                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
    1643                            .dwattr $C$DW$91, DW_AT_name("ADC14_REF2P5V_TS30C")
    1644                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS30C")
    1645                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1646                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   31

    1647                            .dwattr $C$DW$91, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1648                            .dwattr $C$DW$91, DW_AT_decl_line(0x4ef)
    1649                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1650                    
    1651                    $C$DW$92        .dwtag  DW_TAG_member
    1652                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
    1653                            .dwattr $C$DW$92, DW_AT_name("ADC14_REF2P5V_TS85C")
    1654                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS85C")
    1655                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1656                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1657                            .dwattr $C$DW$92, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1658                            .dwattr $C$DW$92, DW_AT_decl_line(0x4f0)
    1659                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1660                    
    1661                    $C$DW$93        .dwtag  DW_TAG_member
    1662                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
    1663                            .dwattr $C$DW$93, DW_AT_name("REF_CAL_TAG")
    1664                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("REF_CAL_TAG")
    1665                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1666                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1667                            .dwattr $C$DW$93, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1668                            .dwattr $C$DW$93, DW_AT_decl_line(0x4f1)
    1669                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
    1670                    
    1671                    $C$DW$94        .dwtag  DW_TAG_member
    1672                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
    1673                            .dwattr $C$DW$94, DW_AT_name("REF_CAL_LEN")
    1674                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("REF_CAL_LEN")
    1675                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1676                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1677                            .dwattr $C$DW$94, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1678                            .dwattr $C$DW$94, DW_AT_decl_line(0x4f2)
    1679                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1680                    
    1681                    $C$DW$95        .dwtag  DW_TAG_member
    1682                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
    1683                            .dwattr $C$DW$95, DW_AT_name("REF_1P2V")
    1684                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("REF_1P2V")
    1685                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1686                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1687                            .dwattr $C$DW$95, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1688                            .dwattr $C$DW$95, DW_AT_decl_line(0x4f3)
    1689                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1690                    
    1691                    $C$DW$96        .dwtag  DW_TAG_member
    1692                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
    1693                            .dwattr $C$DW$96, DW_AT_name("REF_1P45V")
    1694                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("REF_1P45V")
    1695                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1696                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1697                            .dwattr $C$DW$96, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1698                            .dwattr $C$DW$96, DW_AT_decl_line(0x4f4)
    1699                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    1700                    
    1701                    $C$DW$97        .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   32

    1702                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
    1703                            .dwattr $C$DW$97, DW_AT_name("REF_2P5V")
    1704                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("REF_2P5V")
    1705                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    1706                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1707                            .dwattr $C$DW$97, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1708                            .dwattr $C$DW$97, DW_AT_decl_line(0x4f5)
    1709                            .dwattr $C$DW$97, DW_AT_decl_column(0x11)
    1710                    
    1711                    $C$DW$98        .dwtag  DW_TAG_member
    1712                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$22)
    1713                            .dwattr $C$DW$98, DW_AT_name("FLASH_INFO_TAG")
    1714                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("FLASH_INFO_TAG")
    1715                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    1716                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1717                            .dwattr $C$DW$98, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1718                            .dwattr $C$DW$98, DW_AT_decl_line(0x4f6)
    1719                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
    1720                    
    1721                    $C$DW$99        .dwtag  DW_TAG_member
    1722                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$22)
    1723                            .dwattr $C$DW$99, DW_AT_name("FLASH_INFO_LEN")
    1724                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("FLASH_INFO_LEN")
    1725                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1726                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1727                            .dwattr $C$DW$99, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_0
    1728                            .dwattr $C$DW$99, DW_AT_decl_line(0x4f7)
    1729                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    1730                    
    1731                    $C$DW$100       .dwtag  DW_TAG_member
    1732                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
    1733                            .dwattr $C$DW$100, DW_AT_name("FLASH_MAX_PROG_PULSES")
    1734                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("FLASH_MAX_PROG_PULSES")
    1735                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1736                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1737                            .dwattr $C$DW$100, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1738                            .dwattr $C$DW$100, DW_AT_decl_line(0x4f8)
    1739                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    1740                    
    1741                    $C$DW$101       .dwtag  DW_TAG_member
    1742                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
    1743                            .dwattr $C$DW$101, DW_AT_name("FLASH_MAX_ERASE_PULSES")
    1744                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("FLASH_MAX_ERASE_PULSES")
    1745                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1746                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1747                            .dwattr $C$DW$101, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1748                            .dwattr $C$DW$101, DW_AT_decl_line(0x4f9)
    1749                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
    1750                    
    1751                    $C$DW$102       .dwtag  DW_TAG_member
    1752                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    1753                            .dwattr $C$DW$102, DW_AT_name("RANDOM_NUM_TAG")
    1754                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("RANDOM_NUM_TAG")
    1755                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    1756                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   33

    1757                            .dwattr $C$DW$102, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1758                            .dwattr $C$DW$102, DW_AT_decl_line(0x4fa)
    1759                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1760                    
    1761                    $C$DW$103       .dwtag  DW_TAG_member
    1762                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$22)
    1763                            .dwattr $C$DW$103, DW_AT_name("RANDOM_NUM_LEN")
    1764                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("RANDOM_NUM_LEN")
    1765                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    1766                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1767                            .dwattr $C$DW$103, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1768                            .dwattr $C$DW$103, DW_AT_decl_line(0x4fb)
    1769                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    1770                    
    1771                    $C$DW$104       .dwtag  DW_TAG_member
    1772                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$22)
    1773                            .dwattr $C$DW$104, DW_AT_name("RANDOM_NUM_1")
    1774                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("RANDOM_NUM_1")
    1775                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1776                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1777                            .dwattr $C$DW$104, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1778                            .dwattr $C$DW$104, DW_AT_decl_line(0x4fc)
    1779                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
    1780                    
    1781                    $C$DW$105       .dwtag  DW_TAG_member
    1782                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
    1783                            .dwattr $C$DW$105, DW_AT_name("RANDOM_NUM_2")
    1784                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("RANDOM_NUM_2")
    1785                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    1786                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1787                            .dwattr $C$DW$105, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1788                            .dwattr $C$DW$105, DW_AT_decl_line(0x4fd)
    1789                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1790                    
    1791                    $C$DW$106       .dwtag  DW_TAG_member
    1792                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$22)
    1793                            .dwattr $C$DW$106, DW_AT_name("RANDOM_NUM_3")
    1794                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("RANDOM_NUM_3")
    1795                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    1796                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1797                            .dwattr $C$DW$106, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1798                            .dwattr $C$DW$106, DW_AT_decl_line(0x4fe)
    1799                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    1800                    
    1801                    $C$DW$107       .dwtag  DW_TAG_member
    1802                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$22)
    1803                            .dwattr $C$DW$107, DW_AT_name("RANDOM_NUM_4")
    1804                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RANDOM_NUM_4")
    1805                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    1806                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1807                            .dwattr $C$DW$107, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1808                            .dwattr $C$DW$107, DW_AT_decl_line(0x4ff)
    1809                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    1810                    
    1811                    $C$DW$108       .dwtag  DW_TAG_member
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   34

    1812                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$22)
    1813                            .dwattr $C$DW$108, DW_AT_name("BSL_CFG_TAG")
    1814                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("BSL_CFG_TAG")
    1815                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    1816                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1817                            .dwattr $C$DW$108, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1818                            .dwattr $C$DW$108, DW_AT_decl_line(0x500)
    1819                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
    1820                    
    1821                    $C$DW$109       .dwtag  DW_TAG_member
    1822                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$22)
    1823                            .dwattr $C$DW$109, DW_AT_name("BSL_CFG_LEN")
    1824                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("BSL_CFG_LEN")
    1825                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    1826                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1827                            .dwattr $C$DW$109, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1828                            .dwattr $C$DW$109, DW_AT_decl_line(0x501)
    1829                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1830                    
    1831                    $C$DW$110       .dwtag  DW_TAG_member
    1832                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1833                            .dwattr $C$DW$110, DW_AT_name("BSL_PERIPHIF_SEL")
    1834                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("BSL_PERIPHIF_SEL")
    1835                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    1836                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1837                            .dwattr $C$DW$110, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1838                            .dwattr $C$DW$110, DW_AT_decl_line(0x502)
    1839                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    1840                    
    1841                    $C$DW$111       .dwtag  DW_TAG_member
    1842                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1843                            .dwattr $C$DW$111, DW_AT_name("BSL_PORTIF_CFG_UART")
    1844                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_UART")
    1845                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    1846                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1847                            .dwattr $C$DW$111, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1848                            .dwattr $C$DW$111, DW_AT_decl_line(0x503)
    1849                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1850                    
    1851                    $C$DW$112       .dwtag  DW_TAG_member
    1852                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
    1853                            .dwattr $C$DW$112, DW_AT_name("BSL_PORTIF_CFG_SPI")
    1854                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_SPI")
    1855                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    1856                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1857                            .dwattr $C$DW$112, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1858                            .dwattr $C$DW$112, DW_AT_decl_line(0x504)
    1859                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    1860                    
    1861                    $C$DW$113       .dwtag  DW_TAG_member
    1862                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$22)
    1863                            .dwattr $C$DW$113, DW_AT_name("BSL_PORTIF_CFG_I2C")
    1864                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_I2C")
    1865                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    1866                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   35

    1867                            .dwattr $C$DW$113, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1868                            .dwattr $C$DW$113, DW_AT_decl_line(0x505)
    1869                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1870                    
    1871                    $C$DW$114       .dwtag  DW_TAG_member
    1872                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1873                            .dwattr $C$DW$114, DW_AT_name("TLV_END")
    1874                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("TLV_END")
    1875                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    1876                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1877                            .dwattr $C$DW$114, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1878                            .dwattr $C$DW$114, DW_AT_decl_line(0x506)
    1879                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1880                    
    1881                            .dwattr $C$DW$T$25, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20
    1882                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x4b3)
    1883                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1884                            .dwendtag $C$DW$T$25
    1885                    
    1886                    $C$DW$T$173     .dwtag  DW_TAG_typedef
    1887                            .dwattr $C$DW$T$173, DW_AT_name("TLV_Type")
    1888                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$25)
    1889                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    1890                            .dwattr $C$DW$T$173, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_2
    1891                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x507)
    1892                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x03)
    1893                    
    1894                    
    1895                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1896                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x8c)
    1897                    $C$DW$115       .dwtag  DW_TAG_member
    1898                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1899                            .dwattr $C$DW$115, DW_AT_name("CPUID")
    1900                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("CPUID")
    1901                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1903                            .dwattr $C$DW$115, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1904                            .dwattr $C$DW$115, DW_AT_decl_line(0x1e7)
    1905                            .dwattr $C$DW$115, DW_AT_decl_column(0x12)
    1906                    
    1907                    $C$DW$116       .dwtag  DW_TAG_member
    1908                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1909                            .dwattr $C$DW$116, DW_AT_name("ICSR")
    1910                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ICSR")
    1911                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1912                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1913                            .dwattr $C$DW$116, DW_AT_decl_file("/Users/jadedh/ti/tirex-content/simplelink_msp432_sdk_1_20_
    1914                            .dwattr $C$DW$116, DW_AT_decl_line(0x1e8)
    1915                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1916                    
    1917                    $C$DW$117       .dwtag  DW_TAG_member
    1918                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1919                            .dwattr $C$DW$117, DW_AT_name("VTOR")
    1920                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("VTOR")
    1921                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler Unix v16.9.0 Sun Apr 30 23:23:08 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   36

